[{"url": "http://espn.go.com/nba/story/_/id/14783975/the-nba-trade-deadline-full-big-names-cap-questions", "text": "We should take two lessons from last season's trade deadline, which started quietly before descending into madness over those frantic final 45 minutes.The strange brew of shorter contracts and an unprecedented cap spike brings real incentives to stand pat -- \"Why trade for this dude when he's about to hit free agency and we have cap space?\" -- but also creates harder-to-spot variables that push teams toward action.Never underestimate what unhappy, desperate teams might talk themselves into during the frenzy. There are only four teams with a realistic chance to win the title -- something that should dull the market -- but there is also of angst around the league. Teams without extra first-round picks should hoard their own like gold, since they bring cheapo, set-in-stone rookie deals, but that didn't stop them last year.After four days of skulking around with team executives in Toronto, let's bounce around some of the bigger questions as the NBA's annual bonanza approaches.Teams unsure about the implications of the cap spike may put off big choices until the draft, which means June and July could be absolutely nuts.That applies to two of the starry names riding the rumor mill:  and . Love's fit as a third wheel remains awkward, but the Cavs want to win the title, and they know their core is good enough to approach the finish line. Rejiggering things now would be a gamble. The Cavs might draw juicier offers in June; Boston dangled four first-rounders for  in the heat of draft night, after all.The Cavs are hunting for upgrades, but Love isn't the bait -- yet. They have a rare open roster spot, and could wait for Brooklyn to buy out Joe Johnson.Conflicting noise is spouting from Clipperville, but the smart money is on L.A. waiting until the summer to really get busy on the Griffin front. Doc Rivers wants to give this core one last postseason shot, and the Clips need Griffin just in case  picks them, triggering a Griffin-for-Durant sign-and-trade.But the Griffin noise is real. He's no longer untouchable. The Clips are listening, even right now, and they've rarely listened before. If they get wind over the next four days that they're out of the Durant sweepstakes, they could accelerate the Griffin trade timetable. It'd take a monster offer to pry him away before the draft, but the ground is trembling (, Rivers needs to think very hard about whether trading Griffin is a good idea).Trade-niks have been lamenting the lack of sellers, but that creates a void for some non-traditional seller to slide a quality player onto the market and net a bounty in return -- especially when wannabe contenders like Houston, Chicago, Atlanta, and Memphis are hopelessly behind the Big Four. Before he broke his foot,  was my favorite sneaky theoretical trade target -- even though Memphis would never have gone through with it. The Grizz need to recoup lost picks, and in the land of short contracts, a true star locked up for years could rock the market. Alas, Gasol is hurt, and  is on an expiring deal, playing the league's most loaded position.Howard is at the epicenter of all these competing trends. Houston has been making calls on him for two weeks, but the Rockets have found little interest so far, per several league sources. Howard is 30, declining and about to enter free agency as the cap spikes to around $92 million -- the new estimate lots of teams are using after the league initially projected an $89 million ceiling for next season.Howard wants a max deal that would start at $30 million per season. That would officially end the era of every contract looking fantastic amid an indefinitely rising cap. The league and union still project the cap to dip down after rising to a high around $108 million in 2017-18, and if that happens, Howard's theoretical max deal won't be some anomalous bargain like the contracts inked last summer under a $70 million cap. It will be pricey and constraining, and those are scary words attached to an aging center with a history of back, shoulder and knee issues.It's hard to find a team willing to meet Houston in the middle. No team is a  away from vaulting into Warriors/Spurs/Cavs/Thunder territory; the Rockets contacted Toronto, perhaps the closest thing to a one-player-away team, and found zippo interest, sources say. The Celtics, loaded with ammo, have recoiled at paying a price Houston would find acceptable.Houston needs to find a front office under pressure, that sees value in nabbing Howard's Bird Rights -- the ability to offer him one more year than any other suitor this summer. No one is quite sure how valuable that fifth year is under a rising cap. On the one hand, good players can sign three- or four-year max deals anywhere, re-enter free agency during their primes and sign another fat deal.On the flip side, some players crave that extra year of security. People close to , another sell-off target about to hit free agency, say he will value that fifth year more than almost every other variable in his free-agency calculus. If teams see a crowded free-agent bidding war for a player they like, they might feel an urgency to acquire him now and use that fifth year to get a leg up in that bidding war.It's also a carrot that might coax a discount on annual salary. A rival team could offer Howard up to about $129 million over four seasons this summer. Howard becomes more appealing to his incumbent team if he's willing to spread that $129 million over five seasons, perhaps even on a flat contract, in exchange for an extra year. That savings could mitigate the obvious winner's curse here: If Howard's next contract is dicey, then what do you really gain with the right to pay him more money over more years?If Houston anticipates a cool July market for Howard, those Bird Rights might be the reason the Rockets keep him: an edge re-signing him in July might be more valuable than the best offer they get today.Only a few teams stand as plausible Howard destinations: Just last season, the Heat gave up two first-round picks for an impending free agent, , they were confident they could re-sign on a below-max five-year deal. Houston coveted Dragic before he signed that mega-deal, and he has disappointed so far in Miami. The Heat are also facing a cap crunch in re-signing  and .You could build a bunch of deals in which Miami sends out some combination of Dragic, Whiteside and  for Howard, but there are factors working against it. Miami is over the tax and more likely to dump money. Houston is hard-capped, and can barely add a dime without violating league rules. Miami has questions about Howard's character and fit, sources say, and the Heat have been sniffing around cheaper 3-and-D wings -- including  in Denver.The Heat might also ask for , and that could be a deal-breaker; if Houston plays its cards right, the Rockets can keep Ariza on the books and still open up max cap space this summer for Durant.By the way: Howard is getting a little creaky, but he's still damn good, and he turns it up in the playoffs. The Pelicans still like the idea of surrounding  with a bruiser; they've gone back and forth with the Bucks about , sources say. New Orleans' roster is pretty bare going forward, and the team might feel pressure to salvage something from this disastrous, injury-riddled season.The Pels and Rockets once flirted about a - swap, and the Pelicans now have both to send to Houston in exchange for Howard. But the Pelicans are sifting through a pile of potential Anderson offers, and teams have gotten the impression that Dell Demps, the New Orleans general manager, may not have the freedom to toss in a first-rounder after dealing three picks for  and Asik. Other teams have offered to slap top-of-the-lottery protections onto New Orleans' 2016 pick, but that hasn't swayed the Pelicans, sources say. Teams are also confused about whether Mickey Loomis, a top executive for Tom Benson's New Orleans Saints, has the final say over Demps.Anderson has drawn a ton of interest, considering his abysmal defense and approaching free agency; dude might earn $20 million per year on his next deal, and some teams would run from that contract. Detroit and Sacramento both hope to sign him in free agency, sources say, but the teams are deciding whether it might be safer to acquire him now and gain that fifth-year edge in the July auction.Anderson thrived in Orlando under Stan Van Gundy, Detroit's coach, and he grew up around Sacramento. The Pistons badly want to make the playoffs after a seven-year wait, and they've shown some willingness to at least talk about dealing a protected 2016 first-rounder. Failing to make the playoffs in the Year of Durant would be catastrophic, and possibly lead to blood-letting across the organization. The Wizards are getting  back soon as a pseudo-deadline acquisition, but that doesn't feel like enough, and teams that fall short of expectations are prone to bad short-term moves. Washington is already asking around about reserve big men, league sources say.The Wiz could send Marcin Gortat, salary filler, and either a young player or a protected first-round pick. If Houston demands both, the Wiz probably walk away. The Rockets could absorb Gortat's salary and still wriggle their way to Durant-level cap space this summer -- especially since either  or  is a lock to jet in free agency.The Wiz are also a natural Anderson trade partner;  would get him all the open 3s he could eat, and Washington has a readymade trade package in the /Kelly Oubre combo. Oubre's an intriguing young player at a position of need; the Pelicans aren't doing much better than that. Washington is reluctant to trade Oubre, but he's barely playing, and the status quo hasn't worked.There are rumors that Howard would like to end up in Atlanta, his hometown, and the Hawks stand as the mid-tier seller who could dictate this deadline if they make Horford available. With the cap jumping, any non-contender with a 30-ish player approaching free agency has to at least gauge the trade market. Horford's pectoral issues raise some health concerns, but he has been healthy for two years, and his silky game figures to age well.To put it politely, the league is skeptical this is anything more than a Hawks fishing expedition designed to gin up one crazy offer for Horford. Wes Wilcox, Atlanta's GM, is asking teams to \"wow\" him, sources say, and no one is biting.The Hawks may not be fretting as much as it seems about Horford walking. Horford will look around, and he likes the idea of playing in a bigger media market with a larger Dominican population, per several sources familiar with the matter. But he also cherishes the continuity Atlanta has built, and the Hawks understand he is the keystone to their culture of selflessnes. If the Hawks keep Horford into the summer, they will have that extra fifth year in the quiver.As for Howard, he doesn't fit Mike Budenholzer's system, he's older than Horford, and he's eligible for an even larger max contract.A Jeff Teague deal is more likely, with the Bucks, Jazz, Nets, Knicks and perhaps even the Magic kicking the tires. The Bucks chased Teague in free agency three years ago, and they remain unconvinced that Michael Carter-Williams, coming off the bench again, is the long-term answer, league sources say.The Jazz are sending out the stand-pat vibe, especially since they've been on a hot streak with  healthy, but no one ever really knows what's up in Utah. The Jazz should at least engage Atlanta about swapping Teague for the / Killer Bs package.The Nets and Knicks don't have many assets; the Nets are testing the market for Thad Young and  -- they'd be irresponsible not to, even without a full-time GM -- and if they snare a first-round pick for one of them, Brooklyn could flip it for Teague.The Knicks, meanwhile, are trying to get off money. They're dangling  and  in exchange for rotation players on expiring deals, sources say. Good luck!There has never been more noise about the normally dormant Bulls, the last of the obvious mid-tier sellers. They could re-center their roster around  by dealing , ,  and other vets for younger players and draft picks. Unfortunately, Noah is out for the season, Dunleavy just got back and Gasol's deal will expire after only two seasons -- meaning anyone acquiring Gasol will only get his Early Bird Rights, which limits a team over the cap to an offer starting around $13 million. If Gasol wants more, that team will have to dip into its cap space.The Bulls may also want quality rotation guys instead of just future assets; Chicago and Toronto had initial discussions on a Taj Gibson-Patrick Patterson swap that would give Chicago yet another stretch power forward and trim its tax bill, but those discussions appear to have led nowhere so far. Speaking of Toronto ...A lot of signs in Drakeville point to stasis for the clear No. 2 team in the East. They're 14-2 in their past 16 games, and would be easy favorites over any potential No. 7 or No. 6 seed.  and  are on poison-pill deals that make them hard to trade; the Raps love Patterson, their most tradable, mid-sized contract; and Masai Ujiri, their GM, doesn't appear to be in love with any of the available power forwards who might displace , per several league sources.But the Drakes are masters at keeping the marketplace guessing, and they have extra goodies to deal at a time when winning at least one playoff series is something like an organizational mandate.  and  will never be better. The Scola-Valanciunas starting front-line has been flammable on defense, and it's unrealistic for now to count on  and  filling those minutes as small-ball power forwards; Carroll's recovery time from knee surgery is uncertain, and Dwane Casey, the Raps coach, hasn't trusted Johnson.You can understand why Ujiri might be wary of trading a first-round pick for Anderson, Young, Gibson,  or . None of those guys changes your life as a franchise. They bring baggage, holes in their game, or salary concerns for a team that will be capped out if they re-sign DeRozan. Those players don't catapult you into the conversation with the best Western Conference teams. Horford is a different story. It would take almost everything in the Toronto's arsenal to get him, but if they manage it, the Raps would have a good chance of re-signing him, sources say. Still, such a bold move is unlikely.But even those non-Horford guys are better than what Toronto has, and that incremental improvement might be the difference in a quarter, a game, or a series for a team with ugly postseason demons. Toronto cannot flame out in the playoffs again -- not with its grand ambitions in free agency. If the Raptors advance to Cleveland, Toronto will need to switch the LeBron-Love pick-and-roll as often as possible; Scola isn't up for that.A small boost might be worth it if it costs only one of the following three assets: Patterson, the Knicks pick and Toronto's 2016 first-rounder.Quick notes on a few wild-card teams: The Blazers are being pulled in opposite directions. They are way ahead of schedule at 27-27, to the point that Neil Olshey, the team's deal-makin' GM, might pivot into \"buy\" mode if he finds a young-ish player who fits the timeline of  and . The Blazers have pursued Monroe before, and despite Milwaukee striking a strong pose in some talks, Monroe could be had if some suitor tosses in a decent first-round pick.Portland has $20 million in cap room to play with, plus two restricted free agents --  and  -- due big raises under the skyrocketing cap. Teams queasy about paying their restricted free agents ditched them at least season's deadline, when ,  and  flew around the league.The Blazers are high on Crabbe, but Leonard's asking price in preseason extension talks gave them sticker shock. (The restricted free-agency thing is yet another reason to keep an eye on Boston, with both  and  ticking toward it).Alas, the Blazers owe their pick to Denver if they make the playoffs, and given Olshey's draft record, he might prefer to keep it. My best guess: Portland avoids an upgrade, uses its space to nab a couple of extra second-rounders and resumes its pursuit of Monroe -- or someone else -- around draft time. Whoa, boy. 's people want him out of there, and the Kings are liable to do damn near anything. Can Vlade Divac sign himself to a contract? It might be time for a shake-up that adds more shooting, or unclutters a positional logjam.  could be the odd man out, and in this bizarro NBA, his four-year deal with declining annual salary brings the value of certainty: You know you're getting him for his full prime. is another restricted free agent heading toward a raise. The Magic love him, but they might listen. Larry Legend keeps things close to the vest, and Indy doesn't have a lot of expendable pieces with league-wide appeal. The Pacers are also generally protective of their draft picks. But teams will call about some of their guys, including , and the Pacers are quietly confident they can be a problem in the playoffs if they win a deal on the fringes.The league has already started talking about a rematch, and this absolutely needs to happen. LaVine is the best dunker since peak , and perhaps the best dunker in basketball history. He's just 20, and he won't be a real All-Star anytime soon. He won't graduate out of the dunk contest, though he must feel some pressure about conjuring new tricks as the hype grows.LaVine should make this contest his thing -- his All-Star tradition. The dunk contest will be \"back\" as long as he's in it, and he seems like the kind of guy who might want to establish the first dunk contest dynasty. Why couldn't he win five years in a row?The league wasn't prepared for a prolonged battle of perfect 50s, and it felt as if we were going on and on until someone made a mistake -- the NBA version of a spelling bee in which the final two contestants keep getting it right. One solution: Declare co-winners earlier. Would anyone have complained?Wyc Grousbeck, the Celtics owner, offered another solution in a few chit-chats with higher-ups after the dunk contest, sources say: giving each judge a \"golden 11\" score to use just once over the full contest. That would introduce some suspense and break ties earlier. I'm not sure anyone wanted that dunk contest to stop, but it's an interesting idea.Heads-up to casual fans: The dunk contest's breakout star does bananas stuff in the flow of regular games -- put-back dunks, baseline hammers, chase-down rejections and \"where in the hell did he come from????!!\" close-outs like this:That was by far the best Skills Challenge I can remember. One small change transformed the whole event. We saw one big man gaffe -- Boogie losing the ball on one of his first dribbles -- and the awesome site of all the bigs storming the court as  dueled  on those final, rushed Pop-A-Shot 3s. There was real joy in what had been a silent, blah event.It's too easy to recover from botching the chest pass through the glow-in-the-dark tire. Players can move on after three misses, and if the first one rattles out, they whip the next two blindly to get their three attempts out of the way. Guys who aim true on the first try deserve a bigger lead.Yeah, it was arctic. That put a damper on party-hopping; once you were in one place, you didn't want to leave. But if you play All-Star right, you don't have to be outdoors for more than 20 minutes combined over four days. Stop whining.Toronto is a fantastic city, and a near-perfect All-Star host. It should get another shot within the next 10 years. It's easy to get around the compact downtown area, and everything is close together. In L.A., you spend half your time in traffic. In Orlando, you waste hours on shuttle buses traversing desolate landscapes between spread-out events.If we just got run-of-the-mill cold -- if it were 25 degrees instead of below zero -- everyone would have loved Toronto's All-Star year. Let's do it again.In a bloated night of a thousand commercial breaks, this baby takes only 10 minutes start to finish, and the NBA scrapped it without explanation. It's fun watching retirees, current players and WNBA stars launch half-court shots! The league clearly -- and correctly -- concluded no one would ever dethrone the legend Swin Cash, but the Cash-- dynasty deserves a chance to extend its rule.The league's entertainment crew built multiple Jumbotron segments around American players guessing the meaning of Canadian phrases like loonie, poutine and kerfuffle. (I was unaware kerfuffle was a Canadian thing, and not just a regular word).The game included \"Canadian tuxedo,\" and I had forgotten this glorious term for an all-denim outfit before  guessed it. What a perfect piece of language. We should use it more in America.Let's honor a few borderline candidates absent from the weekend. Lillard's snub drew the loudest objections, and he's the main reason Portland has demolished expectations -- including mine -- after losing four starters to free agency. Lillard is Curry Lite -- a point guard who launches off-the-dribble 3s through teensy windows with enough accuracy to drag opponents out of their standard pick-and-roll defense.Few players create more space with step-back moves, and Lillard's long-distance moonwalks help him manufacture at least semi-open looks under crunch-time harassment:Teams have been smart about switching the Jackson- pick-and-roll, sliding a little guy onto Ilyasova, and daring the Pistons to post him up. Ryan Anderson looms as a potential upgrade over Ilyasova precisely because he has learned to exploit those switches with a funky mix of bully-ball, spin moves and step-backs. He's also an elite offensive rebounder.The switch leaves a power forward on Jackson, and most power forwards are fast enough to at least make Jackson work for a good look. Centers are slower, and Jackson has adjusted by shifting right into a pick-and-roll with :Most defenses switch again, figuring they already have a big man on Jackson anyway, but that second switcheroo gives Jackson an extra speed advantage -- and an easier path to the rim.Vooch's defensive limitations contribute to Orlando's stagnancy and his permanent All-Star snub status, but he gets more polished on offense every season. Teams have to honor his jump shot out to 20 feet, and he has gotten better zipping passes around double teams.He also has a nifty array of quick-hitting, reverse-pivot moves and head fakes that confuse defenders expecting standard fare:There aren't many seven-footers busting out moves like that at high speed. Stay strange, Vooch."},
{"url": "http://espn.go.com/nba/story/_/page/allstar-14773976/adam-silver-supersized-salary-cap", "text": "TORONTO -- Ho hum, nothing to report from Adam Silver's annual All-Star news conference, other than this summer could change the future of the NBA.It requires some dot connecting, but just be aware that the league's power brokers will pay close attention to player movement in this offseason of the supersized salary cap. If, say,  signs with the , it would not only alter the competitive balance for the near future, but also could bring permanent changes to the framework of the NBA.The current collective bargaining agreement is due to expire in 2021, but either the owners or players can opt out by Dec. 15 of this year. That would start the timer ticking to reach an agreement by July 1, 2017, or put the league at risk of a work stoppage. There have been informal discussions, with the understanding that the deal in place now is working pretty well for everyone involved.The wild card that no one anticipated when the current CBA was signed in 2011 was the avalanche of money from the new nine-year, $24 billion national television rights deals. That is expected to make the salary cap jump from $67 million this year to an estimated $90 million next season. Suddenly, teams that had been frugal with their payroll will be competing against teams armed with both established players  enough room to bring in a max-contract guy.\"We'd prefer a system where teams are managing for cap room, and we'd prefer a system in which stars are distributed throughout the league as opposed to congregating in one market,\" Silver said. \"Whether that will happen with all this additional cap room this summer is uncertain to me.\"There will be unintended consequences from all this additional cap room this summer,\" he added. \"I just don't know what those consequences will be.\"The \"unintended consequences\" don't sound quite as ominous as the \"enormous consequences\" his predecessor David Stern warned of during the 2011 lockout, but those consequences could trigger a major chain reaction. One unintended consequence is that higher salary caps also mean higher salary floors (the minimum payrolls for teams), and it's easier for teams with high TV and sponsor revenues to get to the floor than teams in smaller markets.\"So ultimately what that situation is about is player distribution. So if you look now at the league, we see the way our stars are distributed throughout the league, you see seemingly no correlation between market size and where the stars are located.\"But another consequence will be that a Warriors team that already has signed  and  to lucrative long-term deals can maneuver to throw a maximum-contract offer at Durant. Or a Lakers team that will have 's $25 million salary coming off the books could have as much as $60 million in cap space this summer. These are all unique circumstances that might never happen again. And it could be that other factors, such as the Lakers' down cycle or the current rules that make it financially wise for Durant to re-sign with the Thunder for one year, could win out. Then again, one landscape-altering transaction might be all it takes for the owners to get antsy.As the NBA prepares for the largest salary-cap jump in league history this summer, commissioner Adam Silver said Saturday that \"there will be unintended consequences\" of such an increase.The NBA tends to react to landmark events. 's $126 million contract in 1998 led to a lockout and the implementation of maximum contracts. 's forced trade from  to the  brought limits to the ability of players to extend their contracts in conjunction with trades. ' decision and the formation of the Big Three in Miami helped usher in the harsher luxury taxes in place today.Silver said all the regulations have helped bring competitive balance to the league and shrink the gap between large- and small-market teams.\"We know that by tightening up the cap and putting in place a harsher tax, we're seeing fewer teams go into the tax because the financial consequences are so great of going high into the tax and what it would mean for their payrolls,\" Silver said. \"In addition, other changes we made were once teams go into the tax, it dramatically limits what they're able to do in terms of trades and free agents.\"So ultimately what that situation is about is player distribution. So if you look now at the league, we see the way our stars are distributed throughout the league, you see seemingly no correlation between market size and where the stars are located.\"Ultimately,\" Silver said, \"our goal from the league standpoint is to have truly a 30-team league where the teams are competing based on management, based on either market size or an owner's willingness to lose substantial amounts of money. Is it a perfect system? Absolutely not. Did we get everything we were looking for in collective bargaining last time? No. But we feel it's a fair compromise, and we feel it's working fairly well.\"Could the supersized salary cap undo all that?\"The answer is, I'm not sure,\" Silver said.There's a new variable in the categories the owners had worked so hard to control: cost certainty and restrictions on player movement. In the past, the loophole for players to exercise control was to take less money. This summer won't require such a compromise by them.The owners' uncertainty means uncertainty over the sticking points of the next collective bargaining agreement. They need to discover how this current agreement can be exploited before they determine what loopholes to close. Silver is in wait-and-see mode, which could ultimately mean waiting to see NBA basketball again. Silver didn't connect the dots on Saturday. What he did was raise awareness of their existence, thus raising the stakes for this summer."},
{"url": "http://espn.go.com/nba/story/_/id/14757066/nba-schedule-breaking-players", "text": ", Kristaps Porzingis looked fresh and rested as he walked into the Quicken Loans Arena for a late-December game in Cleveland. And for the first three quarters, he played that way.But even if the 20-year-old rookie phenom looked good on the outside, on the inside his body was surely a mess. For the past three months, it had been systematically trashed by the NBA's silent killer: its grueling 82-game schedule. New York had just come off a three-games-in-four-nights stretch, which had come on the heels of a three-games-in-four-nights swing through Utah, Sacramento and Portland. Not surprisingly, Carmelo Anthony had rolled his ankle late in a game two nights earlier and was now out.Sure enough, by the fourth quarter, the hormonal, mental and physical aftershock of the Knicks' schedule emerged into full view. With a minute left, Porzingis, who had scored 23 points in the first three quarters, had yet to score in the fourth and was visibly dragging. The Knicks trailed by four and needed a stop. And with the entire arena on its feet, LeBron James -- coming off a luxurious, if rare, two days of rest -- made his move. From the left corner, LeBron darted toward Porzingis before rising up for a sky-high one-handed slam. Instead of challenging James at the rim, Porzingis ducked away, like a matador. The Cavs would win by seven, with the Knicks mustering just 12 points in the fourth, tying their then-season low.For the NBA, LeBron's slam was the stuff of dreams: A superstar soaring for a game-clinching dunk is the very thing that sells tickets, spikes ratings and launches Vines. But here's the thing: It almost never happens, and for reasons most people don't realize.As it turns out, the fourth-quarter dunk is a rare phenomenon. From the 2005-06 season through 2014-15, there were nearly 5,000 fewer dunks in the fourth quarter compared with the first, a decline of 20 percent. In fact, dunks become rarer with each passing quarter: from an average of 1.98 in the first to 1.59 in the fourth. More fascinating: The overall frequency falls 24 percent when teams play on zero days' rest versus one day off, dropping from 5.5 dunks per game to 4.2. The upshot: It took a dog-tired Knicks team on the road against a fresh Cavs squad to produce that James highlight.It's merely one of a hundred signals that NBA players are exhausted and sleep-deprived. In this case it was to the benefit of the highlight makers. But the evidence suggests that, over the course of a season, all players -- and fans -- end up losing.\"It makes no sense to me,\" says Dr. Charles Czeisler, director of sleep medicine at Harvard Medical School. \"These guys are so extraordinarily talented, and it's a shame that they're being impaired. It'd be like the NBA saying, 'OK, let's see how they do if we starve the players. OK, let's see how they do if we make them all drunk before they play, so everybody has to do six shots before they do the game.' Would anyone in their right minds consider that?\" one of the world's top running coaches -- his middle- distance and marathon runners are prepping for the Olympics now -- and a leading authority on athlete exhaustion. There are disagreements among experts in his world about how hard to push athletes, but nobody recommends anything like what the NBA prescribes: four contests in five nights, say -- or 82 in 169 days.\"It's almost ludicrous how often they play,\" says Magness, who has a master's in exercise science and wrote the book . With so few days off, the restorative faculties of the human body start to shut down. And it's a problem the NBA knows it has. Commissioner Adam Silver recently told reporters in London that \"we're becoming more sophisticated about the impact of fatigue on our players and the direct correlation between fatigue and injuries.\"Over the past decade, there have been about 5,000 fewer dunks in the fourth quarter than in the first frame.But even with a new push by the league to reduce back-to-backs and four-in-fives to all-time lows, there are still 533 back-to-backs in the NBA schedule, far too many in the eyes of Magness, who advises his top Olympic athletes to race no more than once a week.The problem is mounting. Research from ESPN's Kevin Pelton indicates that stars are more injury-prone than ever. Incumbent All-Stars from 2013-14 missed 19 games on average last season, or about a quarter of the season. Compare that with 2009-10, when incumbent All-Stars missed just 10.8 percent of their games -- or one of every 10 games. The plague of the injured star was evident in the 2015 Finals, when James shot 38 percent sans Kyrie Irving and Kevin Love. And Jimmy Butler, the NBA leader in minutes per game, just suffered a knee injury on the second night of a back-to-back that will keep him out for three to four weeks.If you survey doctors and sports scientists around the world, the NBA's problem stems in large part from chronic lack of sleep, the body's natural performance-enhancing drug. How important is it? A recent Stanford University study found that shooting accuracy improved by 9 percent and 3-point percentage by 9.2 percent after basketball players spent at least 10 hours in bed for nocturnal sleep during a five-to-seven-week period. \"We get this nice big surge of testosterone and human growth hormone when we get into deep sleep,\" Magness says. \"The longer the deep sleep phase gets, the more HGH and testosterone you produce.\"Magness describes a war between two biomarkers in the body: testosterone and cortisol. The more testosterone, the better; it's the anabolic steroid that promotes muscle growth and recovery. Cortisol, though, is a stress hormone that parachutes in when the body is breaking down. As cortisol levels rise, the body signals that it's in distress and dispatches ambulances and firetrucks to fix the damage. In October and November, he says, NBA athletes show strong testosterone-to-cortisol levels. But as the season grinds on, the ratio flips: \"As your body flip-flops into 'not being able to repair itself' state, your immune system can't keep up; it eventually taps out.\"Magness has seen this firsthand: It's common for marathoners to stay healthy all during training and then get sick a week or two before the race. \"Because they cooked it just a little too hard.\"In early January, the NBA's ironman, Clippers center DeAndre Jordan, missed his first game since 2011. The DNP was due to a bout with, of all things, pneumonia, to which Magness quips, \"Yeah, exactly.\"There's a reason, after all, teams play three points per 100 possessions worse on the second day of back-to-backs. And even worse when they play four games in five days. \"Basically, it makes the body a mess,\" Magness says. \"What happens when you play 82 games in a 160-day stretch is you don't give your body time to repair itself and get ready for the next go-round. It just kicks into this stage where it can't keep up with the demands.\" since Chris Bosh's diagnosis of a pulmonary embolism -- a blood clot in his lungs that forced him to miss much of last season. Fresh off scoring 18 points in a win over the Hawks, the 6-foot-11 Bosh is slumped deep in the red leather chair in front of his locker, trying to illustrate what air travel is like for him. He says the constant flying contributed to the life-threatening clot that migrated from his calf to his lungs: \"You sit so much. You're like this for two hours. If you get kicked, blood just pools up somewhere and you don't move it, it just sits there.\"Deputy editor Ty Wenger is joined by ESPN NBA writers Tom Haberstroh and Kevin Arnovitz to discuss Haberstroh's latest piece on injuries,Bosh played for weeks last season with chest pains from the embolism, forcing him to spend days laid up in February in a Miami hospital bed with tubes in his chest. With 12 years of NBA life under his belt, he thought he had the whole travel thing figured out. \"Yeah,\" Bosh says, \"until you're in the hospital.\"Doctors indicated that being tall and flying frequently -- defining characteristics of NBA players -- were the main contributors to his condition. Other NBA giants have fallen prey to similar diagnoses in recent years, including 6-11 center Anderson Varejao in 2012-13 and 6-9 power forward Mirza Teletovic last season. \"We got strong hearts,\" Bosh says, before pointing down to his feet, \"but that's a long way away.\"Of course, Bosh's case is at the extreme end of the spectrum. For many players, zipping across time zones and being forced to scrape for z's while upright on planes, in unfamiliar beds or folded onto training room couches leads not just to poor basketball but to greater injury risk. Eliminating back-to-backs is critical, says Dr. Michael Joyner, a renowned expert in human performance and physiology at the Mayo Clinic in Minnesota.Thirty-three years ago, Joyner was in medical school at Arizona -- where he'd run track as an undergrad -- when a sweet-shooting guard named Steve Kerr stepped onto the Tucson campus. It was there -- watching coach Lute Olson turn around the program with Kerr -- that he became obsessed not only with hoops but also with the madness of the NBA schedule. \"There's a reason why airline pilots have sleep rules,\" Joyner says.No sport spends more time at 30,000 feet than the NBA. Consider that the Warriors will travel an NBA-high 54,000 miles this season, per an NBAsavant.com analysis, twice as many as the NFL's top travel team (the 49ers, who jetted 28,000 miles in 2015, according to Pro Football Reference). Baseball obviously has it worse with its 162-game schedule, right? Wrong: The average NBA team logged 44,214 miles last season; in MLB it was 29,374, according to BaseballSavant.com. Even NHL teams travel less than NBA teams do, averaging about 40,000 miles of flight per season. leaves players at risk, particularly the ones who log big minutes. Research shows that risk increases exponentially as minutes rise. NBA empirical data is notoriously scant, but a 1999 study in the British Journal of Sports Medicine found there were significantly more injuries in English Premier League soccer in the 15-minute periods at the end of each half, when fatigue was at its highest.What's more, there were far more injuries in the second half compared with the first half of matches for both professional (56 percent versus 44 percent) and youth players (59 percent versus 41 percent). A 2010 study in the American Journal of Sports Medicine found that pro soccer players suffer six times as many injuries playing two matches in a week compared with just one match per week. And a 2012 Basketball Prospectus study by Pelton found that the period of playing time when players are most likely to tear their ACLs arrives between minutes 33 and 39. Even the injuries that seem driven by bad luck -- say, turning an ankle by landing on an opponent's foot -- might be avoidable with more rest, as spatial awareness improves with sleep and muscle strength is hardened by rest.According to research from ESPN's Kevin Pelton, incumbent All-Stars are missing about twice as many games due to injury as they did in the 1980s.\"Timing is off, and when muscles fatigue, they're more likely to tear from overuse,\" Joyner says. \"The things you do easily -- jumping and landing -- become more difficult. You see this with ballerinas and ice-skaters; you miss your jumps because you land weird. And that's when you turn an ankle and twist your knee.\"In fairness, the NBA has shuffled the schedule to reduce the number of back-to-backs. \"We have more people than ever looking at the impact of the schedule on injuries and analyzing how we can potentially make it better,\" a league official says. In 2014-15, the Blazers traveled an absurd 64,576 miles. The league shaved 12,000 miles off that this season, thanks to a fancy algorithm implemented by the NBA's analytics guru, Jason Rosenfeld.But Portland fans might argue that the schedule tweak was too late. Although correlation does not equal causation, former Blazers starter Wes Matthews, in the midst of a breakout season, ruptured his Achilles on the second night of a back-to-back in March, ruining his season and setting off a personnel chain reaction that led to this season's franchise rebuild., Silver will host a gathering of owners and power brokers at his All-Star Tech Summit in Toronto. At the main panel, the literature boasts, health and analytics will be the focus: \"We'll explore how technology is rapidly improving the game of basketball.\"Coaches are adapting too: The number of players averaging 35 or more minutes per game stands at 21 this season, down from 58 a decade ago. But DNPs and scheduling algorithms can only do so much -- at a certain point, more rest means fewer games, which means fewer events to sell tickets to and broadcast.Read more stories from TrueHoop's feature series.It's clear, for now, that the league is not ready to take up the hard work of getting the owners and players to consider more profound changes. \"It's not a conversation that is being had,\" Silver told  in June. \"We've had an 82-game regular season for almost 50 years.\" A league spokesman affirms that thinking, noting that there's \"no definitive evidence to this point that fewer games would mean a lower rate of injury -- and therefore, not sufficient evidence to consider a big structural change.\"To researchers, the evidence is clear: Players are overworked. When presented with stats showing that dunks trail off as the game progresses, Joyner audibly giggles. He points out that the legendary Oscar Robertson famously never dunked in the NBA, despite being 6-5 and averaging a triple-double one season.\"Oscar Robertson is the id of NBA players,\" Joyner says. \"The body is telling the NBA player what Oscar's mind told him: Don't bother to dunk unless there is a desperate reason to do it. In a long season like the NBA's, why do gratuitous stuff that can ruin the body?\"The Spurs, no surprise, have already gotten that memo. Between 2005-06 and 2014-15, they dunked at a rate of almost half the NBA average, registering 567 dunks fewer than the next-lowest team, the Pacers. \"It's just easier to save energy and not do it,\" says Spurs guard Danny Green, who believes his team's style helps reduce injuries.Indeed, the Spurs have been ahead of the curve on injury prevention and are leading the way on body monitoring and controlling minutes. Research by Jeff Stotts of Rotowire.com found the Spurs have lost 995 games due to injury since 2005-06, the lowest number in the NBA. And therein lies the NBA's great contradiction. The Spurs are boring, in part because they play below the rim but also because they manage the 82-game grind with strategic rest. What ruins the body is also what sells, but as Spurs forward Kawhi Leonard says, \"We're not trying to put on a Globetrotter show.\"Flash back to 2012, when then- commissioner David Stern fined San Antonio $250,000 for holding Tim Duncan, Manu Ginobili, Tony Parker and Green out of a nationally broadcast game in Miami, the finale of a six-game, nine-day road trip. Coach Gregg Popovich defended his move before the game, calling it \"pretty logical.\" According to Stern, Pop's decision to send the players home early ran \"contrary to the best interests of the NBA.\"The clear verdict from science, though, backs Popovich. Turns out, the thing that runs contrary to the best interests of the NBA is its own schedule."},
{"url": "http://espn.go.com/nba/story/_/page/nbarank1/all-nbarank-1", "text": "Michael Jordan is the greatest of all time, topping our All-Time #NBArank list of the 100 best players ever.To create All-Time #NBArank, we put together a ballot with the 150 greatest players ever. Then our ESPN expert panel voted on thousands of head-to-head matchups, . The result is our .\n\nWe counted down the greatest players in NBA history.    |  |  |  |  |  |  |  |  |   |  |  |  |  |  |   |   |  |  | \n\n\n\n\nIn the 11 seasons in which he played at least 20 games with the Bulls, Jordan finished in the top five of MVP voting 10 times. The exception? His rookie season, when he finished sixth. And in the playoffs, going strictly by seeding, MJ's teams were never upset. Against teams seeded the same or lower, Jordan's teams had a perfect 24-0 series record. -- Here's the thing: Bird's famous statement about Michael Jordan is not the one that defines him or his career. MJ's \"love of the game\" clause does.Jordan had the provision written into his first contract, allowing him at any time, any place -- playground, rec center, backyard, arenas, stadiums -- to pick up a basketball and just ball. Those words speak more to his game than the 63 points he put on Bird and the Celtics in '86 that became his warning to the world of what we were all about to witness during the next 13 seasons.What are the best moments in Michael Jordan's legendary career? Could LeBron James catch MJ on the all-time list? Our experts discuss the greatness of Air Jordan, All-Time #NBArank's No. 1So you thought you knew everything there is to know about the No. 1 player in the #NBArank, Michael Jordan?  Not so fast.  Prepare to be amazed.A look at the best players in NBA history, according to a recent ESPN survey.And that love ran . Unconditional. Often parallel to his addiction to competition, his need to win and his almost inhuman (or inhumane) ability to use losing to make himself -- and others around him -- greater.Be like Mike? He left room for others to come close. But could you be like him ? All due respect to Wilt, Kobe, LeBron, Steph, Magic and all other players who fall below Jordan's No. 1 position on this list, but what set Jordan apart was his ability to follow up his own \"God-like\" performances with something greater the next game, the next series, the next season. And  more than anything -- more than his talent, more than his desire, more than his will, his insane 30.1 PPG scoring average and 27.9 PER, his overall winning percentage, his six rings and the fact he has become the true measure of greatness in sports -- is the Sum of Jordan.That, and the fact that he balled so large that Bird's \"God\" comment actually became an afterthought.-- "},
{"url": "http://espn.go.com/nba/insider/story/_/id/14764209/chad-ford-big-board-50-nba-draft-201", "text": "To see Chad Ford's latest Big Board for 2016, become an Insider today.Magazine subscribers:"},
{"url": "http://espn.go.com/nba/story/_/id/14771329/nba-all-star-game-vince-carter-reflects-historic-slam-dunk-contest-2000", "text": " spent six-plus seasons in Toronto helping build the NBA brand in the city and country of Canada. With the All-Star Game in Toronto and on foreign soil for the first time, Toronto's most famous Raptor recently looked back on his time with the franchise, trying to put Toronto on the NBA map and discussing what his impact has been on basketball and a generation of players coming up in Canada. At 21, I was just trying to establish myself, the fifth pick [in the 1998 draft], traded on draft night [for Antawn Jamison], learning things about the game, learning a new city, new country, coming in and then a lockout [in 1999]. Just figuring out because everything was condensed and it was going fast, fast, fast, fast.Here's Kevin Pelton's grades for the Rising Stars game, which pits the top young NBA players against one another in a Team USA-versus-World format. Team USA won 157-154.Enjoy the NBA's 3-point contest, because some of the best shooters  will be on display. We have evidence.For me, I am just trying to establish myself and show the league, the world really, who I am, what I bring to the table, and I think just the excitement that was in that first two years with Tracy [McGrady], and now we are starting to win and it's not like, 'Yeah, you are the pushover.' When I got there, that's what it was. People considered Toronto, 'Oh yeah, this is a practice game.' Now we are starting to win games, now we are in the playoffs, we are not the pushover anymore. We are coming to play. The city enjoyed that. Now we are relevant.So we continued to fight for the NBA to put us on the map, put us in the spotlight, give us a chance on TV or TNT or NBC at the time. I sound old. But give us a chance to really be in the spotlight to show the world what Toronto has to offer. I think for young kids, that is what it was all about. 'Look at us now, we are on TV, they are talking about Toronto and our city.' We have something to represent, and then I won the dunk contest and got in the All-Star Game, so now they are talking about the .It is funny you hear people -- I remember [them saying], 'Yeah we don't know much about the city.' ... Now we are starting to get [recognition]. ... Antonio [Davis] and I are starting to represent Toronto; now people have to recognize us and it's pretty cool. It's freaking awesome. It is hard to believe that because I think about at that time, I was just trying to make my way. It's hard to believe, yes. It's hard to believe. It's a long time ago. Sometimes I still look at it and it feels like yesterday, but that was a long time ago. No, not then. Now I do. I say I didn't because I wasn't established myself. I was so caught up in wanting to show everybody what I can do. And I knew who I was representing. But I knew that would take care of itself if I did my job and do what I want to do. I mean, I was fulfilling a dream. I always wanted to be in the dunk contest, and I wanted to show the world, this is what I can do. People had an idea but they didn't really know. And I had to show them.When I was little, I used to tape and study the dunk contest. And that night, that was my moment. So I was living in the moment. So I never realized at the time what it would do for younger kids in the city and the country. As you move on, it's like, 'OK, now you are making playoffs and winning games and in the conference, we are playing in big games now' -- that is when you can see how much it meant to the city because now it went from just, 'Oh yeah, cool, my first year.' And then second year, it was unbelievable and in years to come, when we went on to the second round, it was nuts in 2001. That was crazy. That arena was so nice. Yeah, I heard that. I don't know. [Zach] LaVine is definitely capable; he brings a lot to the table. It was a special night for me. It's going to happen. He is the guy who can do it. It's bonkers. It's a great city. I think they'll be a great host, and I think guys are going to have a lot of fun. It's going to be cold. It's going to be cold! ... I think with the team putting two All-Stars [Kyle Lowry and DeMar DeRozan] in the All-Star Game is big. Consistently winning, getting to the playoffs, that's what it's all about now, and I watched -- what do they call it? Jurassic Park -- that little area right there [outside the arena]. I wish they had that when I was playing. I just remembered it when we were playing, we battled against the Knicks [in the playoffs], and then of course, just how loud and how crazy the crowd was then, so I know it's bonkers now. No, daughter comes first. She's an athlete. She has her own tennis tournament this weekend, so can't miss that -- that won't go well. She comes first and she has asked me every day, twice a day, 'You are going to be there!' It's just bad timing. Daddy's duty first. Not now -- it's been a while. But we tried to push for it years ago. It's a great atmosphere, a great city to host an All-Star Game. I have been saying this for years and years, it's the best-kept secret. For guys and players who haven't had the opportunity to hang out and be around the city, they are going to enjoy it and fall in love with what Toronto has to offer. I really think so."},
{"url": "http://espn.go.com/nba/story/_/id/14760324/cultural-impact-jordan-sneakers-goes-far-basketball", "text": "Here's what they say: All true. All missing the point.In the winter of 1985, something more than  was happening, something unknown to anyone -- even those who were paying attention. See, the shoe game has always been an extension of the game, a subtext of basketball's culture that made \"Is it the shoes?\" a plausible and legit question.The shoes helped define who our heroes were. That was a part of their third dimension. Clyde Frazier  Puma.   Nike. Dr. J, Magic Johnson and Larry Bird not only wore Converse -- they  Converse. So when Jordan took to the \"Air,\" he was defined.With All-Star Weekend kicking off, it's time to rank the top five All-Star kicks ever.Before the newest Air Jordan comes out, we take a look back at every previous model and pick the best, worst and everything in between.Before the newest Air Jordan comes out, weigh in on all the previous models.It was 30 years ago when MJ's signature shoe first blessed the court. After he \"wear-tested\" the Nike Air Ships for the first few months of his NBA career, Jordan -- with the help, ingenuity and foresight of executive Sonny Vaccaro, agent David Falk and designer Peter Moore, among others -- ignited the sneaker game that, three decades later, has become almost as important globally as the game of basketball itself.Because Jordan's name is still attached to his shoes -- and only his name, not necessarily Nike's -- we connect the signature shoe bearing his name directly to his spirit, performance and being. Logically, we know his sneakers are not going to make us \"be like Mike,\" but there is a commercial and universal belief that having his shoes in our lives makes us more connected to him.\"I've had a few experiences,\" newest Jordan Brand member  said. \"Growing up in my neighborhood, [Jordans] were kind of like the Holy Grail. I couldn't afford them. So just being able to work and save up the money to actually buy them was huge.\"The first pair I bought was the Concords [Air Jordan XI]. Those have been a hot commodity since day one, so being able to save up for those, that was pretty cool. And since then, I've met Michael Jordan a few times. [I] have his number.\"That validates the \"dreams sometimes become reality\" mythology.In the video project created to celebrate the 30 years of Jordan, Tinker Hatfield spoke about designing his first pair of Jordans, and he reinforced his ongoing belief as to why the product continues to resonate.\"The Jordan III was the first shoe with the logo -- the Jumpman logo -- and that was my choice,\" he said. \"I put it right on the tongue, and I felt like, almost instantly at that point, that this mark was going to be important for a long, long time. Because I did feel it spoke to people on several different levels.\"It was Michael, but also it was I asked the man who helped create Jordan's third dimension the best and most challenging question he had to answer.\"Tinker, who is better: you at design or Jordan at basketball?\"His immediate, don't-think-twice response: \"Michael is a better basketball player than I am a designer.\"That was his take until I pushed. I told him that I asked Jordan the same question and revealed that Jordan's answer was Jordan.Jordan also added, \"Tinker was able to do what he did because of what I did on the court.\"Then Hatfield's answer shifted a bit -- with reason.\"I agree with that,\" he said, \"when it comes to basketball.\"\"Now, having you point this out and put me on the spot, I'm not so sure that Michael even knows that I've even invented different categories of shoes away from the Jordan Brand -- in cross-training, in ACG [All Conditions Gear], in running, shoes like the Huarache. I mean, that's done way away from the Jordan Brand. That all would have happened without Michael.\"I'll say this: In his world, he's right. He's the main ingredient in the big drink here. But of everything I do, I'd say Jordan represents probably about 20 percent of it.\"\"Growing up in my neighborhood, [Jordans] were kind of like the Holy Grail. I couldn't afford them. So just being able to work and save up the money to actually buy them was huge.\"Spurs forward LaMarcus AldridgeImagine being significant across the world -- and only using 20 percent of your gift. Imagine not being able to go anywhere in the world without seeing something you've done, something you've created or some impact you've had on a culture.Hatfield can't even get away from his work on vacation. He has traveled to the Caribbean, all over Europe and to West Africa, and he said he \"never went one place and didn't see something I designed.\"Imagine, after nearly 30 years of being involved in a singular project, that you not only are the subject of cultish fandom in an industry but also can hold up a sneaker and people -- for a second -- stop breathing.In this culture of sports aesthetics, one of the most difficult things to do is separate Tinker Hatfield from the shoes he has designed for the brand named after Michael Jordan. It is much easier to do that with his other works.The Air Max, Nike's most influential and popular line of sneakers besides the Air Force 1, isn't attached to Hatfield, Nike's vice president of creative concepts, the way his Jordan concepts, designs and inventions are. There aren't sneaker fiends and shoeheads walking around with T-shirts that say \"TINKER MADE ME DO IT\" because of the Air Maxs, Air Huaraches, Air Trainers or Air Mags he created.To get to this point is beyond expectation. It's a culture within itself, as well as a subculture within sports and commerce that to some degree is beyond explanation. The word \"timeless\" comes up in the conversation about why we discuss Jordan sneakers after all these years.When Jordan Brand creative director and co-lead designer Mark Smith was asked about the new Air Jordan XXX, his response spoke to the greater function of the brand's importance and why the brand has sustained that importance for so long.\"If it ain't broke, don't fix it,\" he said. \"[That frame of thought] allows us to really focus on the meaningful difference in things we could elevate.\"Business is like, 'Change, change, change! It's gotta be different.' No, no, no. This is a new opportunity for us to build off of something we know works very well, and we listen to the athletes, and the athletes were saying, 'Don't change. We really like what's going on.' And that allowed us to prioritize, keep things that were working. We were making meaningful changes based on priority.\"The priorities have always been the athlete and the game, at least in the design and construction process as Nike annually builds its signature sneaker.  has already put the XXX to the test in games, and , ,  and Aldridge will follow. In the upcoming All-Star Game in Toronto, the XXX edition of Air Jordan might be the most represented shoe.But that is a fraction of the overall narrative. The genius to be able to remain one of the most significant brands in sports is a shared commodity: design, innovation and performance -- not necessarily in that order.In design, creativity can be seen as the key factor. But limiting Jordan sneakers to just that would diminish all the other components that attempt to explain how this phenomenon came to be and remains.By hitting the game from two ends -- on the court with its newest and on the streets with the retros -- the Jordan Brand has positioned itself in a can't-lose \"Catch-23.\"Soon, the company will rerelease the Retro OG Jordan I \"Chicago,\" a shoe  hailed as the \".\" The new Jordan XXX will share shelf space with the \"Chicago.\"\"Whether the majority of people like or dislike [the XXX], it's still out there as, like, this new thing,\" Hatfield said. \"No one has put together a basketball shoe like this in the history of basketball.\"And there you have the sell, the perfect buy-in. Players aren't going to argue with Tinker, and people aren't going to challenge history.For those who love Jordan Brand, the All-Star break was like a second Christmas.For years, the brand used the midwinter break in the NBA schedule to release the newest Jordan into the marketplace. Michael would \"break the shoe in\" at some point during the first half of the season -- depending how far along Nike was with the shoe and how much MJ \"loved\" the model -- but for the retail release, it was always \"hold your breath until All-Star Weekend\" for the product possession to come full circle.It was an ingenious business and societal move. It let the public know -- not guess or speculate -- that something directly connected to Michael Jordan -- something we could own -- was going to be available.Even for athletes signed to the brand, the impact and brand impression are sort of the same.\"To be the athlete to debut the Air Jordan XXX is definitely an honor,\" Westbrook, the lead Jordan Brand baller, said in a statement.\"I definitely was big on [Jordans], I just wasn't able to afford them. Growing up, I never thought I'd be in this situation to be able to debut a Michael Jordan shoe, which is crazy to think about. But I'm just excited to be able to do that, and to be associated with Jordan is an honor in itself.\"NBA stars still remember their first pairs and the depth of that experience.\"I think it was like the 13s, the white and red with the black bottom. I just ended up getting those for my first day of school,\" Spurs star Leonard said. \"That was like my first pair of J's that I really liked at the time. I was in the second or third grade. I was just fortunate enough that my mom and dad were able to combine to get me those shoes.\"Beyond the numbering of each sneaker is the sub-branding, as each rerelease receives a retro vault name (from AJXI \"Space Jams\" to AJXII \"Bordeauxs\" to AJ 17 \"Coppers\" to \"Concords,\" \"Cements,\" \"Grapes,\" \"Infrareds\" and \"Breds\") while at the same time having different colorways, materials, textures and patterns as part of the rerelease.\"Apple is still 21 years and 18 iPhone models away from being where Jordan is with its signature sneaker.\"The business model set in place by Jordan Brand's practice of annually releasing \"something new\" and \"numbering it\" into a marketplace that stays connected to a singular item has always been revolutionary. Many other companies have tried to match this standard of excellence, but not many -- if any -- have been able to sustain it for a similar amount of time. Apple is still 21 years and 18 iPhone models from being where Jordan is with its signature sneaker.The ability to unapologetically stay true to its roots as one of the world's true \"urban\" brands (it has never distanced itself from the urban and city-driven consumer base) while also advancing technology and still making performance the principal focus of design might be the single greatest asset Jordan has as a brand. In a business and cultural sense, that has allowed the brand to, over the past decade, inundate two markets with one stone.Need another example?  isn't a Jordan Brand athlete, but Nike took advantage of the brief time when he was vacillating between shoe companies by releasing to the public -- in the middle of Kobe's retirement tour -- a \"Kobe pack\" of two of the Jordan sneakers Bryant wore in games when he was hoping to be signed by the brand.It was calculated, and it was the brand fully taking advantage of a market it has created. That's how they roll. It's how they've always rolled and how they will continue to roll out a business model built on the back of a single, signature sneaker that has been impossible for any other company to emulate.For those who wear Jordans, being part of an enduring brand is the culmination of a successful partnership.\"It makes me proud. Yeah, it does,\"  said. \"I remember getting there and seeing where the business was then. I remember sitting in the airport in 2006, coming from the world championship, and I remember when the brand had just hit a billion, and to see where it's at right now -- [nearly $3 billion in sales] -- that's a lot. That's a lot of growth to be a part of.\"It's hard to believe that something -- one thing -- can have a 30-year, ever-changing lifespan in this done-and-die, on-to-the-next-one cultural market we have created.Yet at the end of the day, when it's all said, done, written and dissected, as one Jordanologist said to me during the unveiling of the XXX, it all comes down to one simple thing: \"whether or not the sneaker is dope.\""},
{"url": "http://espn.go.com/nba/insider/story/_/id/14763292/trading-james-harden-not-dwight-howard-address-houston-rockets-problems-nba", "text": "Something is rotten with the .To read four James Harden trade proposals and Kevin Pelton's full analysis of the Houston Rockets' issues, become an Insider today.Magazine subscribers:"},
{"url": "http://espn.go.com/nba/story/_/id/14750602/how-golden-state-warriors-stephen-curry-got-best-worst-ankles-sports", "text": " know if he'd wake up owning a dead man's tendons.It was April 25, 2012, and inside the Southern California Orthopedic Institute in Van Nuys, a renowned surgeon hovered over a baby-faced, decreasingly conscious Curry. In the vast majority of the ankles operated on by Dr. Richard Ferkel, who's cut thousands of holes into hundreds of NBA players since 1983, he knew precisely what he'd find well before the anesthesia started pumping -- structural damage, scar tissue, etc. But here in this fourth-floor operating room, something wasn't adding up with his 185-pound patient. As the clock ticked and the Curry family prayed just down the hall, Steph went to sleep a mystery.Before the drugs hit, Ferkel had explained a range of potential outcomes. Less than a year before, in Curry's hometown of Charlotte, North Carolina, a specialist had already sliced open that same right ankle and rebuilt two ligaments that had stretched apart like a rotting sweater. The worst-case scenario now? Total re-reconstruction, meaning that everything rebuilt in Curry's  surgery would be reattempted. If that proved necessary, they'd use better parts -- specifically, tendons from a cadaver -- and the projected recovery time would be at least six months. But such an operation would also be extreme enough that no one would be sure how the new hinge would hold up on the court. One near certainty: With Curry's rookie deal expiring in six months, on Nov. 1, 2012, his future with Golden State would be that much hazier. His agent would likely need to negotiate an extension before the undead ankle could appear in a game.Understand: The four doctors and two nurses in the operating room didn't know they were endeavoring to save the future of the NBA. Nobody, anywhere, considered that a 24-year-old who was still getting carded at California Pizza Kitchen was the impending nightmare of both LeBron James and Kevin Durant. At this point, Curry's trajectory was just depressing: In his first NBA season after the original procedure, he suffered five ankle sprains while playing in a mere 26 games.\"He was turning his ankle in completely nontraditional, crazy ways,\" Warriors general manager Bob Myers says. One time, Curry turned it while hopping into a passing lane during a preseason game against the Lakers. Another time, he was dribbling upcourt against the Spurs, with no one around, only to have his right foot fishtail like an old tire on black ice. \"It was scary,\" Myers says. \"I'd never seen someone sprain his ankle like that prior to Steph. And I haven't seen it since.\"The league had once envisioned Curry as a sharpshooter with a close-up magician's gift of misdirection. But now, as the Warriors guard rested atop Ferkel's operating table, his career resembled a crossover in reverse: a case of ankles breaking a man. \"People started saying, 'Steph's got glass ankles. Steph's Grant Hill 2.0,'\" recalls Bryant Barr, Curry's best friend and college teammate at Davidson. \"He didn't hide his emotions, his frustration, for anyone.\" In college, somehow, Curry had no history of right ankle trouble. As a pro? The sight of the guy chucking his mouth guard, punching a padded chair or slapping the floor in existential agony became more memorable than any highlight.When Curry eventually blacked out on the operating table, however, a rather remarkable thing happened. A recent battery of strength tests, nerve tests, X-rays, MRIs and CAT scans had all failed to resolve why his ankle kept buckling. But a set of stress X-rays conducted midsleep, when pain can't impact motion, formally ruled out any structural damage to the ligaments. A 1-ounce HD camera snaked into Curry's subtalar and ankle joints produced images of thick, sticky bands of scar tissue -- \"like crab meat,\" Ferkel says -- as well as inflamed tissue, bone spurs and chips of cartilage. To anyone else, orthopedic seafood might be revolting. To Curry, \"it was good news,\" he says. \"The least intrusive outcome.\" A motorized device called a shaver scraped and vacuumed all of it away in less than 90 minutes. No zombie tendons necessary. Projected recovery time: three to four months.Easier said than done, of course. Three months later, in July 2012, Curry was rehabbing with his personal trainer, Brandon Payne, when he made a startling confession: \"I feel like I've been doing nothing but rehabbing for two years,\" Curry quietly told him. \"I feel like I'm never going to be able to play again.\"He looked exceptionally miserable. And everyone could see it.\"Steph was sick and tired of it,\" Myers recalls. \"He said, 'This ankle thing is not gonna be my life.'\" in downtown Atlanta, and inside the players' lounge at an eerily empty Philips Arena, Keke Lyles is rotating his hips while grabbing his butt with both hands. Lyles has 24-hour entree to this room as the Hawks' new executive director of player performance, overseeing all medical, rehab and strength and conditioning decisions. The bearded 31-year-old received such an imposing title, which came with the power to handpick his own staff, in order to lure him away from his previous employer, Golden State. Or, as LeBron James described the title-winning, scratch-resistant team in November, \"The most healthy team I've ever seen in NBA history.\"Before joining the Warriors as performance director in 2013, Lyles had been watching Curry from afar in Minnesota, where he was the Timberwolves' strength and conditioning coach. For all of the rehab hopelessness in July 2012, Curry would proceed to play a reassuring 78 games that season with a breakout 22.9/4.0/6.9 line. Ferkel's surgery, though, was no miracle cure. \"You could see when Steph didn't trust his ankle,\" says forward Brandon Rush, who was on that 2012-13 team. \"He didn't try to make the moves he usually makes. He didn't finish and take contact like he usually takes.\" Curry missed four games in January 2013 with right ankle sprains, exited one March game early for the same reason and -- worst of all -- rolled his left ankle during both Warriors playoff series, hobbling him against the Nuggets and then the Spurs.So Lyles arrived in Oakland with a new theory. At first blush, the Northeastern grad can seem like a bro-ish ex-athlete -- which, having grown up in Southern California, Lyles technically is. But in his junior year of high school, a life spent hooping was disrupted by a condition called femoroacetabular impingement, wherein extra bone growth causes excruciating pain in the hip. That part of the body is what turned his fascination inward, Lyles says, toward a career spent obsessing over how to fix athletes. And it is the same part of the body that would spring to mind, years later, when Lyles faced his first and foremost assignment with Golden State. Hence the pedagogical clutching of his derriere.Pablo Torre and Kevin Arnovitz discuss the social implications of Steph Curry's stardom and how the NBA is doing with issues of race and sexuality.Curry, Lyles believed, was already among the best in the world at changing direction. But the guard overwhelmingly relied on his ankles for speed and quickness. Those body parts appeared to be basketball's take on the mythical wings of Icarus: melting, as if made of wax, from overuse and ambition. But what if Curry could add another way to fly? \"Shiftiness is an ankle strategy,\" Lyles explains, \"but power comes from the hips. We wanted to teach Steph how to load his hips to help unload his ankles.\"Curry, haunted by what-ifs after those 2013 playoff sprains -- \"I had to do rehab in between games; it brought back memories,\" he recalls -- was immediately sold on the theory.The best marksman in NBA history, perhaps unsurprisingly, turned out to be a quick study at exercise technique. \"Steph's central nervous system is the best I've worked with,\" Lyles says. \"It's why he's a great golfer, a great bowler, a great shooter.\" Curry swiftly perfected a yoga pose called the single-leg hip airplane, designed to build balance and core strength. He conquered the hip hinge, the fundamental movement of explosive lower-body exercises, in 10 minutes. He even mastered textbook trap-bar dead lifts, which amplify glutes and hamstrings, during his introductory session with Lyles. Other players typically need a week.At first, a willowy Curry could deadlift a pitiable 200 to 225 pounds. But then the labor began: less a  training montage, heaving with theatrical workouts, than a time-lapse video, comically dense with, well, time. \"The man was always in the gym,\" teammate Klay Thompson says. \"Steph just stuck with the routine. He works on his body just as much as he works on his jump shot.\" By Curry's second year in the program, his dead lifts could touch 400 pounds -- more than twice his bodyweight and second most on the Warriors behind 6-foot-11, 265-pound center Festus Ezeli. \"Steph became more aware of how he needs to take care of his body,\" says his father, Dell Curry, a 16-year NBA vet. \"It helped him understand that his body is his career.\"The objective is never bulk; Steph prefers his weight at no more than a chiseled 190 pounds. Instead, both Lyles and Payne -- to whom Curry still entrusts his ankles in the summer -- harp on stability amid a storm of jumps, hard cuts and pick-and-rolls. For that same reason, some 90 percent of Curry's lower-body strength work with Payne is one-legged: single-leg reverse lunges, rear-foot elevated single-leg squats, single-leg dead lifts. A standard offseason warm-up involves standing like a flamingo on a squishy blue Airex pad as Payne obscures Curry's vision, sometimes with flashing strobe goggles, and whips basketballs his way. \"Steph's core strength,\" Payne declares, \"is second to none.\"In each of the past two seasons, Curry has careened into the paint -- a forest of lower-leg dangers -- and shot more often and at a better percentage than all but seven players, all of them bigger. No one is better than Curry at misdirection through hip gyration, as when he thrice juked Kawhi Leonard on Jan. 25 before hitting a corner 3, transfiguring the defensive player of the year into a viral chalk outline. And yet that play might not have been more impressive than one seven days earlier, when Curry found himself the meat in a Kyrie Irving-LeBron James sandwich in the lane. He judo-tossed the 250-pound James onto the floor, broke free of Irving's grip, sprinted past a screen and drained a 3 in the time it took for James to stand back up. \"The way Steph moves, 98 percent of the world would hurt themselves trying to run like that,\" says Warriors assistant GM Kirk Lacob, son of owner Joe. \"I think people would pay to watch Steph work out.\"Watching the 27-year-old stay on the court has been gift enough. Over the past two and a half seasons -- a run of three All-Star selections, a 2014 FIBA World Cup gold medal, 28 NBA playoff games and one title (so far) -- Curry has missed a measly two games due to ankle-related concerns. The first came in November 2013, as a precaution for a left ankle bone bruise. The second was in February 2015, after his right foot landed on Boris Diaw's left. And that's it.A theory appears to have paid off.But here in Atlanta's lounge, Lyles takes care to philosophize about the boundless constellation of factors that compose any injury equation. He brings up Curry's pair of Zamst ankle braces, worn every game. And Curry's pair of Under Armour sneakers, scientifically designed for his feet. And the insight into fatigue that the Warriors have gleaned from analyzing player-worn GPS accelerometers in practice and the overhead SportVU cameras in arenas. And coach Steve Kerr's sincere commitment to improving health by reducing personal stress. (On training days, Lyles would intermittently send Curry off to unwind with his family or play golf with swingman Andre Iguodala.)Then there's the Warriors' roster, which is so good and so deep that Curry, through 50 games, was averaging just 33.8 minutes a game (32nd in the NBA), shrinking risk exposure. Last year he averaged 32.7 (41st). \"All of that matters,\" Lyles says. \"I could argue that everything matters.\"Which means, logically, that any random thing can also be a threat. hour before Golden State hosts Miami in January, and Bob Myers and Kirk Lacob sit around a circular table in a small back room underneath Oracle Arena, mulling over Curry's ankles. As much as any front office in sports -- owing at least partly to its proximity to Silicon Valley -- Golden State's front office actively quantifies injury risk. Yes, Myers and Lacob agree, any random threat might matter. \"But the aspiration is to measure as much as we can,\" Myers says.The Warriors hired their new head of physical performance and sports medicine, Australian sports science expert Lachland Penfold, with this data-driven mission in mind. \"Eventually,\" Lacob says, \"we'll have, like, a video game fatigue meter. A guy like Lachland will be able to go up to Bob and Steve [Kerr] and say, 'Guys, he's at a 77, and our threshold is 75 for Safe to Play.'\" (The team declined to make Penfold available for an interview.)Obviously, when it came to re-signing Curry before Nov. 1, 2012, there was nothing close to such technology. Asked now about the thinking behind his approach, Myers chuckles like a trader who bought Google mid-recession. \"I wish we could've paid Steph more,\" he says with a grin. But the GM notes that at the time of the outlay -- a four-year, $44 million extension -- Curry had just sprained his right ankle in the preseason, labeling him rather emphatically Unsafe.\"So we decided to bet on a couple of things,\" Myers explains. \"We bet on who he is as a human being. We bet on his ability. We bet on the fact that he was the type of player who'd do everything within his power to come back and be smart and be diligent.\"Read more stories from TrueHoop's feature series.But to be perfectly clear: \"Nobody could imagine this happening,\" Curry says. It was unthinkable that the Warriors might one day offer the theory currently being advanced inside this back room: \"The ankle thing made him work smarter, to counteract him ever being put in that position again,\" Lacob says. \"If he hadn't had it, maybe he wouldn't have the same core strength.\" Adds Myers, nodding, \"It made Steph what he is now.\"This is not to suggest that the people in Curry's inner circle have stopped worrying about him. Five separate interviewees knock on wood in the middle of talking about his ankles. One of them, Warriors assistant coach Bruce Fraser, who oversees Curry's famed pregame shooting routine, frets about defenders challenging Curry's jumpers by getting underneath him, turning their feet into land mines. \"But I don't know if Steph's aware of that,\" Fraser says. \"And I don't know if I want to make him think about it.\" Ferkel, meanwhile, still pays periodic visits to the Bay Area, just to check in. And Payne still can't shake the feeling of watching Curry limp after hitting his banged-up left shin against Lakers center Roy Hibbert in January. \"It scared the hell out of me,\" the trainer says. \"It brought back immediate memories of Steph getting hurt.\" Payne sighs, then continues: \"Watching him isn't the enjoyable process you'd think. It's a lot of sitting on edge.\"Dell sometimes declines to sit altogether. This Christmas, in the middle of the second quarter of the Cavs game at Oracle, Steph had to go back to the locker room to attend to a right calf strain. It was exactly the type of scene that leads to naysayers crowing about injury luck regressing to the mean ... and friends texting Lyles in Atlanta, half joking,  ... and a terrified dad suddenly abandoning his chair to follow his son inside. \"Any time I'm at the game and Steph gets dinged up,\" Dell says, a tad sheepishly, \"I'm able to get around that building pretty good. Just to see what's going on.\" It is even more remarkable, then, that the player in question might be less anxious than them all.Back in the Warriors' locker room after trouncing the Heat by 15 -- Steph dropped a ho-hum 31 -- Curry ponders his front office's theory of his evolution. After all that agony and uncertainty, does he honestly believe that the absurdity of his ankle history has saved him from a worse career?\"I think so,\" Curry matter-of-factly replies. \"It definitely drove home my work ethic. Post-surgery, it's kept me driven about taking advantage of every day. There was a time when I was just worried about playing basketball, much less playing at a high level. Now I try to have as much fun out there as possible. You don't enjoy the surgery and the rehab process. But I enjoy how I came out of it, for sure.\"His answer carries the rosy whiff of cliché, admittedly. But when you remember all that must be waved aside to embrace this unfinished timeline of events, so much positivity sounds less like optimism and more like the real secret to Steph Curry's flying, higher than ever.He learned to forget, finally, that he still might fall."},
{"url": "http://espn.go.com/blog/truehoop/post/_/id/74103/no-contest-todays-best-shooters-are-better-than-ever", "text": "As we watch this year's loaded 3-point contest, you might be wondering: That's a tricky question.The NBA has evolved so drastically over the years that it makes raw 3-point percentages super difficult to compare across eras. Case in point: Larry Bird, who many consider one of the best shooters ever, doesn't even crack the top 100 in career 3-point percentage.Comparing Bird's numbers to, say, 's feels like apples to oranges because Bird faced different defenses, different rules, different bodies and different philosophies than Curry. Those are important factors that muddy up the picture.What we really need is an experiment that holds all those variables the same. Just Bird, Curry, a 3-point line and a basket.Funny thing: We already have that, and it's called the 3-point contest. Every year, the best shooters undergo the same controlled environment on All-Star Saturday and try their best to hit every shot.So we decided to break down the film of every 3-point contest since 1987 -- thanks to ESPN researcher extraordinaire Gus Elvin -- and cataloged over 8,000 shots to see if today's shooters are indeed better than yesterday's. (One note: We couldn't get our hands on the full reel of the inaugural 3-point contest in 1986, but we did crunch everything after that.)What we found is that, yes, the best of the best have gotten better over time. Much better, in fact.Back in 1987, Bird took home the second trophy of his 3-point three-peat, toppling a crew of Byron Scott, Craig Hodges, Dale Ellis, Danny Ainge, Detlef Schrempf, Kiki Vandeweghe and Michael Cooper. Collectively, they made 46 percent of their 3-point tries.Fast forward to last year's contest at Barclays Center. With Curry leading the way, the 2015 contestants made a whopping 58.6 percent of their attempts. A huge difference.And that's not an outlier hot performance. Over the past three decades, the best shooters have, on average, steadily gotten sharper in the contest over time.A few things to point out in the chart above:Notice the spike from 1995 to 1997. That's when the 3-point line was moved in for three seasons.The peak of 1996 was buoyed by ESPN's own Tim Legler, who won it that year with 69.3 percent shooting. (The best performance of all time was by Jason Kapono in 2008, who drained 38 of his 50 attempts for 76 percent. For more trivia, take the quiz at the bottom of the page.)As you can see, once the line got longer in 1997, the percentages dropped.What the heck happened in 2005? Maybe the contest-low 43.1 percent conversion rate had something to do with Denver's high altitude coupled with the weekend festivities. Or maybe it's just random.If you dive into the data further, you can find the trend over time rises upward from about 48 percent to 55 percent. So we can see that in this controlled environment with no defenses or schemes, 3-point shooting has improved over time in the contest.You might be asking: Well, did the recent selected contestants have better 3-point percentages during the season than the early ones? Maybe the early contestants weren't the cream of the crop?We checked that out, and that doesn't seem to be true. The contestants' 3-point percentages have stayed constant, right around 40 percent, throughout the 3-point contest, per ESPN Insider Kevin Pelton's research.So what does this all tell us? The evidence is pretty clear that the NBA's elite shooters have gotten better over time even though their 3-point percentages in actual games have stayed relatively flat. Which makes sense. This lends credence to the notion that shooters have gotten better over time, but defenses and sheer volume have compensated to bring the overall 3-point percentage down.It's also true that shooters in 1987 hadn't grown up with the line and hadn't practiced it nearly as much as today's players. Bird told ESPN last year that he didn't even practice 3s at all . Practice makes perfect.And you can see that in the data as well. In the study, the first ball on the rack went in only 43 percent of the time, but improved to 51 percent on the second ball and 56 percent on both the third and fourth balls. The moneyball? Interestingly enough, that dropped down to 52 percent, either because of rushing it at the buzzer or the pressure.Thinking about it, it's surprising that the 3-point percentages during the contests aren't generally higher. After attending NBA practices over the past few years, we've seen sharpshooters regularly shoot anywhere from 60 to 90 percent on 3s in practice. Of course, those sessions aren't being televised around the world.This might be as close as we can get to comparing Bird and Curry in their primes. Ultimately, once you control for defense and schemes, it's clear: The best shooters are better than they used to be. And if that's the case, Curry playing in 1987 would have been downright unfair."},
{"url": "http://espn.go.com/nba/story/_/page/allstar-14761850/grading-slam-dunk-contest", "text": "Here's how the dunkers fared during All-Star Saturday Night in Toronto:First round: 50, 49. Dunk-off scores: 50, 50. While LaVine went home with the trophy, he and Aaron Gordon share the best grade for the purposes of this exercise. With a second consecutive dunk title, which he presaged by coming out to Drake's \"Back to Back\" and embracing the singer courtside, LaVine firmly established his place as one of the greatest dunk contestants in NBA history.To beat Gordon, LaVine relied on his ability to dunk from the free throw line -- or close enough to round up -- in a variety of different fashions. Included were a dunk off a lob from teammate , a windmill from the free throw line and finally the between-the-legs dunk from that distance (never before seen in an NBA dunk contest) that earned him the victory.LaVine's other dunks were impressive in their own right. He went behind his back to fit the \"Back to Back\" theme, cuffed a dunk off a self-lob while completing a 180 and windmilled into a reverse off his own bounce. While Gordon's best dunks probably outpaced LaVine's best, LaVine delivered the stronger overall performance from start to finish. He earned 299 out of a possible 300 points on his six dunks, marred only by a nine from stingy scorer Shaquille O'Neal. First round: 45, 49. Dunk-off scores: 50, 47. Virtually any other year in dunk contest history, Gordon would have been an obvious winner. He brought innovation to go with his athleticism, pulling off dunks without NBA precedent using Magic mascot Stuff.The dunk in which Gordon took the ball from Stuff as he circled on a hoverboard required tremendous precision. Gordon also managed to soar over the mascot while finishing with a windmill and a dunk in which he went under his legs and seemed to hover in midair (with his eyes at rim level) to finish. The latter dunk was surely the night's best single effort, bringing down the house.Gordon finally ran out of dunks in the second tiebreaking dunk-off, and even his final dunk -- an exaggerated, double-pump reverse -- rightfully earned him a 47. First round: 36, 39. Kudos to Drummond for the idea of involving Canadian icon Steve Nash's soccer skills for passing purposes, but the number of tries required took some of the excitement out of Drummond's eventual windmill. He also missed his first two attempts of his opening dunk before transitioning to an easier version. Drummond's performance won't change the long-standing belief that 7-footers struggle in dunk competitions. First round: 44, 30. Barton, better known as \"Thrill,\" started strong after coming out with \"Thriller\" dancers. He went between the legs and finished with a reverse for a score of 44. However, Barton couldn't put down his second dunk in three tries and finished with the lowest score in the competition."},
{"url": "http://espn.go.com/nba/story/_/page/allstar-14776206/dunk-contest-reaches-new-heights-lavine-gordon", "text": "TORONTO--  and  taught us that the solution to the NBA's slam dunk contest was simply staging a true slam dunk contest, a spirited competition that highlights the sport's ultimate expression of athleticism.By testing their limits and pushing each other, drawing perfect score after perfect score from the judges, LaVine and Gordon took the dunk contest to unprecedented heights. This was better than 's virtuoso performance in 2000; that was more exhibition than competition. And yes, this was better than the revered duel between  and  in 1988 because LaVine and Gordon produced better dunks. Much better.In a slam dunk contest that needed two extra rounds, Minnesota's Zach LaVine outlasted Aaron Gordon to firmly establish his place as one of the greatest dunk contestants in NBA history.Timberwolves guard Zach LaVine unleashed a variety of dunks from the free throw line to edge an equally impressive Aaron Gordon to win the NBA's slam dunk contest.Did Aaron Gordon deserve to win the contest? You tell us.You can watch the 1988 dunk contest . When you see Jordan, Dominique and  do windmill dunks from inside the dotted circle or from the low blocks, remember that on Saturday night, LaVine did a windmill dunk from the free throw line.And of course, that dunk Gordon did when he grabbed the ball from  mascot Stuff, who was spinning around on a hoverboard, would have been impossible in 1988. Hoverboards didn't exist back then. And neither did the Orlando Magic, an expansion franchise founded in 1989.The reason the 1988 dunk contest has always been slightly overrated is that it lacked originality. Jordan and Wilkins essentially did a greatest hits collection, repeating most of the same dunks from when they squared off in . Jordan also brought back the \"Kiss The Rim\" dunk he .Gordon's goal was to break out four dunks that had never been seen in the contest before, and he succeeded. It took a LaVine slam that  never seen himself -- a between-the-legs dunk from the free throw line -- to finally finish off Gordon after their series of perfect scores forced two extra dunks in the final round to decide the winner. Gordon called it \"insane\" and the reason why LaVine was the worthy winner.LaVine's last dunk was an impromptu decision based on a suggestion from fellow contestant . (Unfortunately for Barton, his own best performance Saturday night was his entrance to the music of Michael Jackson's \"Thriller,\" complete with red leather jacket and zombie dancers.)While LaVine had the winning dunk, the most amazing, most discussed, most retweeted dunk came from Gordon when he jumped over Stuff, grabbed the ball off his head, jackknifed his legs like a diver in the tuck position, put the ball under both legs and slammed it home. Some day it will be the ultimate testament to the greatness of this contest. Pull up a clip of that dunk and say, \"See that? And that was from the guy who lost.\"Gordon sure didn't seem like a loser, though. He practically earned co-winner status, with a trip to the interview room and a photo session with LaVine and the trophy.The only area where Gordon failed was history. He referred to Dominique Wilkins as \"Chocolate Thunder,\" which was actually the nickname of the late Darryl Dawkins. Dominique was the \"Human Highlight Film,\" a moniker that seems so antiquated amid the streaming videos of today. And Gordon couldn't cite the '88 dunk contest, and really has no knowledge of it because, as he painfully reminded those of us who did watch the Jordan-Nique showdown, \"I was born in '95.\"So Gordon didn't realize he was paying homage to Wilkins when he went baseline, brought the ball down between his legs and reversed it home. It was a Wilkins staple, although Gordon remixed it by putting the ball behind his head first.\"I didn't really know that was one of his special dunks,\" Gordon said. \"That dunk is a really good way to show off how athletic I am. Some people go behind the head, some people put it between their legs. Not a lot of people do both.\"Wilkins saw the resemblance.Aaron Gordon () that pump dunk brought back memories! Well done =@ Dominique Wilkins (@DWilkins21) Wilkins also tweeted:The dunk contest is back!!! Dominique Wilkins (@DWilkins21) Wilkins had been one of the more vocal critics of the dunk contest, saying that it was hurting because the big stars were too afraid of failure to compete. And earlier in the day on Saturday, , who won the dunk contest as a rookie in 1997, expressed disdain for the props and gimmicks that had overtaken the event in recent years and said he longed for the days when the NBA's big names participated in the dunk contest.\"We haven't quite figured out what we want to do with it yet,\" Bryant said. \"Um, so hopefully it will get to a point where we start getting some more stars in the dunk contest.\"LaVine and Gordon showed it wasn't necessary. There might be bigger names out there, but there can't be better dunkers. LaVine said he came back to defend his 2015 dunk championship as a nod to the days when guys like Jordan and Wilkins competed multiple times. It was a nice shoutout to the old school. The contest itself was a salute to the new school. The 2016 dunk contest is now the standard against which the rest will be measured."},
{"url": "http://espn.go.com/espn/story/_/page/instantawesome-drakekobejacket-160213/drake-farewell-mamba-jacket-comes-familiar-source", "text": "Before Sunday's NBA All-Star Game, rapper and all-around Toronto ambassador Drake unveiled a custom leather jacket to commemorate Kobe Bryant's 18th and final appearance in the midseason showcase.Take a look: A photo posted by champagnepapi (@champagnepapi) on The caption thanks Jeff Hamilton, and whether you know it or not, you're likely familiar with  Hamilton is the brain behind some of the most iconic celebration attire in NBA history, from Michael Jordan to Kobe Bryant.According to his website, Hamilton considers his crowning achievement to be designing and providing the apparel  in 1997.More central to Sunday's prevailing Mamba theme, Hamilton also designed the now-legendary leather jackets the Lakers wore to celebrate each of the three championships Kobe and Shaquille O'Neal won together.Remember these?After Drake posted the photo above, Hamilton reposted it, thanking Drake for the opportunity. From the buzz the \"Farewell Mamba\" jacket has already created, Hamilton did his job."},
{"url": "http://espn.go.com/nba/story/_/id/14770510/carmelo-anthony-new-york-knicks-dismisses-trade-rumors-says-not-going-anywhere", "text": "With the NBA trade deadline five days away,  reiterated that he has no plans to exercise his no-trade clause and leave the .\"There's always some trade s--- going [on],\" Anthony said Saturday during an interview on Sirius XM NBA Radio. \"I'm not going anywhere.\"Anthony has a no-trade clause and repeatedly has said that he has no plans to waive that clause before the Feb. 18 deadline.Should the Knicks move Carmelo Anthony and build around Kristaps Porzingis? We break down New York's top targets as the NBA heads toward the trade deadline.The New York Daily News reported Friday that the  and  discussed a trade centered on  and that those talks involved \"very preliminary\" discussions with the Knicks about including Anthony in the deal. The Daily News reported that those talks did not progress.Anthony chalked up the most recent rumors as part of playing in New York, the biggest media market in the NBA.\"When you're in New York, you're always up for grabs, I'll tell you that. Trades are always up for grabs,\" Anthony said with a laugh. \"It's always, 'Who's next?' There's nothing guaranteed when you're in New York. But I don't pay attention to those rumors.\"Anthony, 31, has said several times in recent days that he is committed to staying in New York. He reiterated on Saturday that his goal is to play on a team that can contend for an NBA title.\"I want to win a championship. At this point in my career, that's the only thing that I really care about,\" he said. \"But I'm not, I mean, there's nothing out there for me right now. ... I'm not even entertaining no trade talk right now.\"Speaking on Saturday afternoon after practice with the Eastern Conference All-Star team, Anthony cited his decision to re-sign with the Knicks in free agency two summers ago as proof of his allegiance to the franchise.\"Doing it in New York is better than doing it any place in the world,\" said Anthony, who noted that he has had no conversations with management about a trade. \"One in New York is better than multiple somewhere else, so that was the reason I wanted to come to New York. That's the reason why I'm in New York, so it just bothers me when I started hearing all these trade rumors and trade talks.\"He added: \"I don't know where [trade rumors] comes from so sometimes it gets to you as a player. Just get tired of hearing something all the time. I'm not on the run. I could've ran somewhere when I was a free agent, you know what I'm saying? I came back for a reason. I came back because I wanted to do this.\"The Knicks (23-32) have lost 10 of 11 games heading into the All-Star break and appear headed to their third straight nonplayoff season.Anthony raised eyebrows Friday when he hinted that he might reassess his situation with the Knicks after the season while speaking with reporters in Toronto.\"That doesn't sit well with me -- kind of even to reflect a little bit on that and to think about that is tough,\" Anthony said when asked about missing the playoffs. \"That doesn't sit well with me -- to know that it can be three years if we don't pick it up right now.\"Anthony was then asked whether he's thought about spending his future playing for a losing organization.\"Not yet. I'm pretty sure I'll have that conversation with myself and my family and my team,\" he told reporters in Toronto. \"But it's not a conversation for right now.\"Anthony also said that he'd like to share the floor in New York with another star player, which is understandable. New York is unlikely to land a star in a trade this season but is expected to have at least $19 million in salary cap space to spend in free agency this summer.\"I think everybody kind of dreams and hopes that they can play with another great player, another star player. It's a star player's league,\" Anthony said. \"I think that's what we talk about when we all get together -- 'I want to play with you, I want to play with you.' Even here, different guys say, 'Come play with me, come play with me.' So that's always the mindset. Sometimes it happens, sometimes it don't.\"But I think everybody that's in my situation, that's in my position, they all want the load off especially the older they get. Because you realize you just can't do it all by yourself. Everybody knows that.\"Anthony also heaped praise on Knicks rookie , who has emerged as one of the top young players in the NBA.\"[Porzingis] brought a new energy I think that we were looking for as a city, as a team, as an organization, and I believe that he will be here for a very long time,\" Anthony said. \"He's 7-3, can shoot, can dribble, speaks multiple languages, loves music. So I'm a big fan of that. And just the way he plays the game -- I don't really think he understands how good he is, and how much better he's going to get.\""},
{"url": "http://espn.go.com/nba/story/_/id/14774152/klay-thompson-wins-3-point-contest-karl-anthony-towns-wins-skills-challenge-nba-all-star-saturday-night", "text": "TORONTO --  did what few teams have done this season.He beat .The 3-point contest title was passed along from one \"Splash Brother\" to another, as Thompson beat his  teammate and the defending champion with a dazzling display on NBA All-Star Saturday night. Thompson finished the final round with 27 points, four more than Curry managed as, once again, the title came down to the two Golden State sharpshooters.Klay Thompson edged fellow Splash Brother Stephen Curry to win the 3-point contest during All-Star Saturday Night.Enjoy the NBA's 3-point contest, because some of the best shooters  will be on display. We have evidence.The 3-point and dunk contests are pure fun for players, fans and celebrities alike.  See some of the best reactions to the show.\"We love to shoot against each other,\" Thompson said. \"You know, I've never been on a team with someone who shoots it better than me, so it's a privilege to work with him every day. He makes me that much better.\"'s  was third, with 16 points in the final round. He beat the '  and  of the  to get out of the first round, while the ' , '  and '  were eliminated early.As many had expected, it came down to Curry and Thompson.Curry shot before Thompson in the final round, making his first seven shots and putting up 23 points -- which, to that point, was the best score of the night. Shooters got one point for making a conventional 3-pointer and two points for using a multicolored \"money ball.\"\"At the end of the day, you've got to make shots,\" Curry said. \"Just like in a game.\"So the pressure was on Thompson, and he delivered.Klay Thompson's 27 points in the final round of this year's  Foot Locker Three-Point Contest tied Stephen Curry's final-round total last year for most points in any round*. Thompson and Curry are the first pair of teammates to win consecutive NBA 3-point contests.Here's how good Thompson was in the finals: He had two different streaks of eight consecutive makes. Thompson was 19-for-25 in the final round and 18-for-25 in the first, putting him at 74 percent on the night.That's what it took to beat Curry, who set the NBA single-season record with 286 3-pointers last season and is on pace to obliterate that mark this season. He's already at 245, and the Warriors have 30 games remaining.Really, the only title Curry probably wants to defend is his NBA championship anyway. He and Thompson have helped the Warriors get off to a 48-4 start this season, making them the heavy favorites to repeat.\"Back-to-back years for the 'Splash Brothers,'\" Thompson said. \"It's pretty cool.\"Curry, the reigning NBA MVP, put together the second-longest streak of made triples in 3-point contest history with 13, according to ESPN Stats & Information.Meanwhile,  proved that the big men are back at NBA All-Star Weekend. The  rookie center beat  point guard  to win the Skills Challenge, further validating the evolution of the big man from a plodding post player to a playmaking force.In the first year that frontcourt players were allowed to compete against the guards in the event that puts a premium on ballhandling, passing and perimeter shooting, Towns beat Golden State's  and Sacramento's  in the big men side of the bracket before edging Thomas in the finals.\"I'm glad I was able to help the bigs come out with this trophy,\" said Towns, the No. 1 overall pick in the June draft. \"This is bigger than me. This is for all the bigs out there, with the game changing the way it is, to show that bigs can stand up with guards and skill-wise.\"In the first year frontcourt players were eligible for the Skills Challenge, big man Karl-Anthony Towns matched Derrick Rose as the highest draft pick to win the contest.\nIt has been four years since the NBA decided to eliminate the center position on the All-Star ballot in response to the dearth of talent at the position and the evolution of the game from post-centric offenses to pace and space.With his ability to handle the ball, shoot the 3 and make the extra pass, Towns is the epitome of the improving big man. But heading into the competition, there were doubts that the big fellas could keep up with the small fries. Even Towns' teammate, point guard , joked last week that he had no chance.\"I like proving people wrong, so I'm glad I was able to make a lot of people wrong,\" Towns said. \"I was able to make critics wrong, Vegas wrong, Ricky Rubio wrong. So I'm just so ecstatic right now.\"The course required players to weave through some obstacles, throw a pass through a target, dribble the length of the court for a layup and then make a 3-pointer.After Towns hoisted the trophy, Green, Davis and Cousins joined him on the podium to celebrate.It has already been a banner weekend for the young Wolves.  won the Verizon Slam Dunk Contest in addition to MVP of the BBVA Compass Rising Stars Challenge on Friday night in a game that also featured Canadian star  scoring 29 points.Klay Thompson became the sixth player to win the Three-Point Contest as a member of the team with the best record at the All-Star break. That has coincided with winning the championship frequently in the past.Information from The Associated Press was used in this report."},
{"url": "http://espn.go.com/espn/story/_/page/instantawesome-dunkduel-160213/not-even-fellow-players-believe-lavine-gordon-dunk-duel", "text": "It will be a long time before people forget what  did in Saturday night's dunk contest.The  guard captured his second straight slam dunk contest by bettering  in an instant classic for the ages, a high-flying, acrobatic duel that left NBA players wondering if there had ever been a better one.LaVine's first dunk, an affront to the basic laws of physics, garnered a perfect score of 50 from the judges. Among NBA players on Twitter, it was an even bigger hit.Zach stop it... This is just ridiculous Ricky Rubio (@rickyrubio9) You are making that nobody will want to participate to the contest... They should just let you dunk 50 different times. Ricky Rubio (@rickyrubio9) MY GOD Festus Ezeli (@festus) Simulate straight to Zach like Live '06 dunk contest on ps2 Anthony Morrow (@MrAnthonyMorrow) Ovaaaaa boy #ZachLaVine Nick Young (@NickSwagyPYoung)  stop showing off lol   Norris Cole II (@pg30_Cole) But just when it looked like LaVine was going to run away with it,  forward Gordon stepped up with some huge dunks. He was assisted by Stuff the Magic Dragon, the Magic's mascot, who stood atop a hoverboard.As the two traded perfect scores and forced the contest to go into extra rounds, some NBA players wondered if it was the best dunk contest ever.Gotta be one the best dunk contests of all time. Hats off to   Blake Griffin (@blakegriffin32) Best since Dominique and Jordan  Paul Pierce (@paulpierce34) Best Dunk contest. Ever!!! DeMar DeRozan (@DeMar_DeRozan) Best dunk contest I've ever seen in my life ! CJ McCollum (@CJMcCollum) Might have been the best dunk contest ever... That was a tie Fasho ... Didn't think nobody could give Zach a run for his bread...I was wrong Damian Lillard (@Dame_Lillard) RT if you wanna see a rematch.  Tristan Thompson (@RealTristan13) Eventually, Gordon slipped up, needing a pair of attempts to hit a comparatively pedestrian reverse double-clutch dunk that earned him a 47. It wasn't a popular score with players watching from home.Make it a tie!  Manu Ginobili (@manuginobili) Just give  the  Nick Young (@NickSwagyPYoung) AG won that... Maurice Harkless (@moe_harkless) Come on... Aaron Gordon deserves it Joel Embiid (@JoelEmbiid) I'll concede there weren't really any losers here; they both infused the contest with an energy it has lacked for years. But with LaVine earning the nod, it's worth asking: Did Gordon get robbed?You decide:"},
{"url": "http://espn.go.com/blog/new-york/brooklyn-nets/post/_/id/23560/nets-decision-on-next-gm-wont-be-an-easy-one", "text": "The  have a difficult decision to make. that the Nets shortened their list of GM candidates to Bryan Colangelo, Arturas Karnisovas and Sean Marks and that a decision will likely come by the end of the week.Here's a quick look at the trio: A two-time NBA executive of the year (2005, 2007), Colangelo stands out due to his experience and accolades. He served as GM for several years in both Phoenix (1994-2006) and Toronto (2006-13), producing a couple drastic turnarounds (29 to 62 wins in 2005 and 27 to 47 wins in 2007).While Colangelo, 50, did make some mistakes -- like trading Jason Kidd for Stephon Marbury in Phoenix and drafting  No. 1 overall in Toronto -- he was also responsible for putting together the Amare Stoudemire-Shawn Marion-Steve Nash and --Jonas Valanciunas cores.The Suns may not have been able to get over the hump in the mid-2000s, but their high-octane, \"seven seconds or less\" offensive system under Mike D'Antoni revolutionized how the game is played.Colangelo's father, Jerry, also has a past history as a strong executive and is currently trying to turn things around in Philadelphia. Bryan would certainly bring instant credibility to Brooklyn. The 44-year-old Lithuanian, who current serves as the assistant GM for the , has amassed a strong resume -- especially on an international level.He played at Seton Hall under P.J. Carlesimo before having success overseas on several teams -- including Olympiacos and FC Barcelona.During his tenure in Denver, the Nuggets have been able to add international diamonds in the rough like ,  and . With Brooklyn lacking draft picks, this is an important skill.Karnisovas spoke Russian during part of his interview with the Nets, which is certainly a plus. However, he's never been a lead executive before. Marks, 40, is currently the assistant GM of the .He stands out because he's had experience in the NBA as a player, coach and executive. The 6-foot-11 native of New Zealand played in 230 career games with seven different teams (1998-2011), averaging 2.8 points and 2.8 rebounds.He also served as an assistant under Gregg Popovich before moving into the front office. Marks did briefly serve as GM of San Antonio's D-League team, the Austin Toros.The Spurs have obviously ascended to top status among NBA franchises, and the Nets (like others) would love to replicate what they've been able to accomplish."},
{"url": "http://espn.go.com/nba/story/_/id/14773815/all-stars-kobe-bryant-finale", "text": "All eyes will be on Kobe Bryant for his 18th and final All-Star Game on Sunday. For many of those who will share the stage with him, it will be an unforgettable moment. Here's what some of this year's All-Stars recently had to say about the Lakers star, who is retiring at the end of the season. He's going to go down as one of the best to ever play the game. He was just fearless. He's a champion. To get to where you want to get to, you have to put the work in. His work ethic is one thing that he has. That's the reason why he's so great. Basically the  of our era is what I see with all of his dedication to the game, his competitive drive. He's one of those guys that always wants the ball in a tough situation. No matter the circumstances, he believes in himself, no matter what.Complete coverage of All-Star Weekend in Toronto.Preparing a 37-year-old body for NBA play is not so simple. Baxter Holmes takes an in-depth look at what Kobe Bryant must do to get ready for a game.In Kobe Bryant's 20th season, an army of Lakers trainers and therapists knead and bend and pull him onto the court. They don't do it just for the obvious reasons. He's one of the greatest iconic players this league has ever had. He's had such an imprint on our childhood. I know he had an imprint on my childhood. Me growing up in Los Angeles and being able to see Kobe, obviously he's one of the greatest players to play the game. It was a true honor to be able to learn from him. It's a great experience to be able to learn different things from him, not just on the floor but off the floor as well. I grew up watching the Lakers. I grew up watching him his whole career and getting a chance to have a relationship with him and kind of, you know, patterned my game after him so to speak, so definitely speaks volumes. I was brainwashed to be a Lakers fan when I was young, so I grew up on  and he was my favorite player. He's been my idol growing up, my basketball idol. Just watching him play meant everything to me. So this is his last year and he's going to retire and there's going to be no more Kobe Bryant playing basketball, it's kind of sad. It's kind of sad about that, but at some point he had to go. He's meant so much to the game. Growing up in the era that I did, Kobe was that guy. So to play in an All-Star Game with him, I mean, that's special. I grew up a Kobe fan, so it's something that's really special. Just seeing the film he watched all the time, the players he was talking about, the Oscar Robertsons, Michael Jordans, the Magics, he knew from day one who he wanted to be like. He knew that to be the best, you had to work hard. That's what he did every single day. Not one day did I see him take off. Every time we got a new player who came to our team, like Glen Rice and J.R. Rider and those guys, he would always play them one-on-one and let them know like \"this is my territory.\" The first time he played J.R. Rider, he beat him 12-0, and J.R. Rider wanted to play every single day [after that]. It was just crazy. I think probably one of the moments that would stick out to me, we're playing in L.A. and I think he got 62 [Editor's note: It was 65 points], I don't know what it was, [when I was] in Portland. And we were just trapping him and he was taking shots over two or three guys and knocking them down. I think that's when I got to see firsthand how good he was. I always tell people the first time I played against him was probably the funnest. Coming off a back-to-back in Portland, when I was in Seattle. He came into Seattle, took 44 shots.That was before they had Pau, and all those guys. Kwame Brown was still on the team and they were trying to trade and get a championship-caliber team, so he had to take a lot of shots. He came in and took 44 of them on the second night of a back-to-back, had 48, hit the game-winner and it was just like, \"This guy's a machine.\" It's hard to do that. That's probably my fondest memory. I think my most fond moment is he gave me his shoes when I was in high school. I think I was playing in a tournament in Teaneck, New Jersey, and they were playing in the [2002] All-Star Game in Philly. And I had an opportunity to go meet him, and he gave me a pair of his shoes, and I actually wore them in a game against Oak Hill, against Melo [], actually. So, six degrees of separation right there. Just being able to hang out with him and see people's reactions to him. That was like the coolest thing when I was in the Olympics. People love Kobe Bryant. To see him walk down the hallway and see people's reactions, you can see it in their eyes how much they love him. It means a lot to be a part of that. We definitely want to send him off on a good note. We know he's going to be super-competitive. This is the last time he's going to be with all these elite players and on the court again. So it should be fun, man.  I think for him in the end it will be, first of all, very gratifying and a little emotional, a little tiring because of everybody wanting a piece of him as well. But I think it's great for our game to celebrate him at this time. So it's cool.I think everybody's going to want to go one-on-one and have their Kobe Bryant moment. So whenever he gets a guy one-on-one that the crowd is going to love, they're going to cheer and get up and yell. He's going to have that moment. And on the other end as well. He's a competitor. Still, at 37, he's picking up 94 feet sometimes when you watch the Lakers play. It's going to be big for me personally. Going out in something that's going to be in the history books and being a part of it in your hometown, it's definitely going to be big. It should be more of a celebration about what he's given to the game and all his accomplishments. That's why I wanted to be a part of it. It's going to be emotional for me to see him. I hope he enjoys it. It's always fun to see him and to share this moment with him, this last dance with him. Anytime I'm on the floor and Kobe's on the floor and he asks for the ball, I'm giving it to him."},
{"url": "http://espn.go.com/nba/story/_/id/14781281/nba-all-star-2016-all-star-weekend-always-more-just-game", "text": "TORONTO -- Long after the end of an All-Star Game that featured a record 369 points but little in the way of memorable moments, a boy on his way out of Air Canada Centre looked up at his father and asked, \"Is it very easy to be an All-Star two times in a row?\"I wanted to pull him aside and explain that nothing to do with All-Star Weekend is easy. Not the process of reaching the All-Star Game once, let alone in back-to-back years or 18 times. . That's why  had not one but two tribute videos playing on the scoreboard screens before the game.As cheers and accolades rained down upon him, Kobe Bryant was happy to share his last All-Star Game with the next generation of NBA stars and his family.Who needs \"big names\"? No one does when you have the NBA's two best dunkers putting on the greatest show in dunk contest history.Complete coverage of All-Star Weekend in Toronto.There's nothing easy about becoming an NBA city with a chance to host an All-Star Weekend, as those who were around for the formation of the  in 1994 can attest. There was nothing easy about getting to Toronto or being here throughout one of the coldest weekends in decades.But man, the payoffs. Only at All-Star Weekend can you share an elevator with Hall of Fame players, chit-chat with the power brokers of the NBA or bear witness to moments that will be talked about for years.The basketball itself is easy. Even among the abundant corporate sponsor signage at the NBA Centre Court fanfest, there was something pure about the enjoyment kids found in dribbling and shooting the ball.But All-Star Weekend really isn't about the game, and it feels that way more than ever.Let's begin the story on Friday morning at a photo exhibition called Hoop Shots on the 68th floor of the First Canadian building. There's an extraordinary view of Toronto and Lake Ontario beckoning through the windows. The exhibit contains reproductions of old photographs of basketball's founder, Dr. James Naismith, and his original rules of the game. There are pictures depicting legendary clashes, from  vs.  to Magic Johnson vs. Larry Bird.Curator Gail Buckland chose some photos based on their aesthetic quality -- the lighting and symmetry. Others she chose for historic significance. She leads a couple of visitors over to a picture of Kentucky coach Adolph Rupp and his players as they were about to lose the 1966 NCAA championship game to Texas Western, the first time an all-black starting lineup won the tournament. Buckland says that if you look at the expressions on the faces of the Kentucky coaches, players and even cheerleaders, it's apparent that this is more than just the result of a game. It's a moment that America is changing, and everyone in the shot realizes it.The people working their way through the gallery were gathered for the latest manifestation of that ongoing quest for integration: the drive to diversify NBA front offices. It's an informal breakfast gathering, a chance to network.Nzinga Shaw has held the newly created position of NBA chief diversity and inclusion officer -- the first of its kind in the NBA -- for a little more than a year. Even her business cards are diverse; she has versions in both the Hawks' home white and red colors and the \"Georgia granite gray\" of the road jerseys. Each has the \"volt green accent.\"Cory Nettles, who is one of five African-Americans who formed a group called Partners for Community Impact that bought a share of the Bucks, is there to make the point that the NBA can maintain diversity among its ownership groups among its soaring franchise valuations.\"At an early age, we didn't know much about the outside world ... the States, Hall of Fame, those things. We didn't know that until late '90s. Still, that was almost light years away from us. And here we are. Here I am today. I just feel that this is not an end, this is the beginning for a new generation.\"Yao Ming, on the growth of basketball in ChinaThose goals might seem to be in opposition. With the average team now worth $1.25 billion, according to Forbes, the pool of principal owner candidates has shrunk to members of the enormous wealth generated by the technology, hedge fund and private equity business sectors. It's rare to see prominent African-Americans in those fields.But teams still have the option to bring in minority (in more ways than one) partners, as the Bucks main ownership tandem of Wesley Edens and Marc Lasry did in Milwaukee.Edens and Lasry are from New York. Prior owner Herb Kohl would only sell to buyers who intended to keep the team in Milwaukee. But staying in the city would require a new arena to replace the aging Bradley Center. It would require local input to help navigate the political challenges of building a new, half-billion-dollar facility with half of the funding coming from public money.\"If they were going to be successful in Milwaukee, it needed significant community support and engagement, including in the ownership group,\" Nettles said. \"It's not about [diversity] being a secondary priority because they're trying to monetize their economics. They understand that to monetize their economics that diversity is a critical component of that. So it's really not a trade-off. They're not competing objectives anymore.\"Very few of these franchises are singularly owned. They're owned by a group of people. As long as in that ownership group you have a diversity of people and perspectives and experiences represented, I think that creates opportunity for other people to be involved.\"[Lasry and Edens] did not need our money to do the deal. Our money is an inconsequential aspect of the deal. But they understood the value. I agree, as the teams are changing hands and you're looking at the valuations of these teams, you're in real rarefied air and there are not a lot of diverse owners who can come in and buy the majority ownership of the franchise. But they certainly can become a part of the ownership group at whatever level is material to them and can have an outsized influence in the strategy, engagement and direction of the franchise.\"Later Friday, Hall of Famers Oscar Robertson and Wayne Embry made their way to the Sheraton Centre Toronto Hotel, where they participated in the announcement of the Hall finalists for 2016. The new group has some big names among the candidates, including Shaquille O'Neal,  and .At first glance, Yao might not seem worthy of being in the same class as O'Neal and Iverson. After all, O'Neal and Iverson are both among the top 25 scorers in NBA history, while Yao isn't even among the top 250. It's only when you take into consideration Yao's role in growing the game in his native China that you realize why he was on that stage Friday, or why he joined Robertson and Russell on the court during the All-Star Game on Sunday, or why NBA commissioner Adam Silver said Yao is \"going to end up probably having as great an impact on this game as anyone who has ever played.\"An estimated 300 million people are playing basketball in China. And do you know the primary programming involved in ESPN's mega-deal with Chinese tech company Tencent? NBA basketball. So much of the game's popularity there can be traced to the seven-plus seasons Yao played with the . And Yao's story in itself is a byproduct of the NBA's international reach under previous commissioner David Stern, starting with showcasing the Dream Team in the Olympics, and including the league's expansion into Canada in the 1990s. Eventually it made its way to Yao in China.\"At an early age, we didn't know much about the outside world ... the States, Hall of Fame, those things,\" Yao said after the Hall of Fame announcement. \"We didn't know that until late '90s. Still, that was almost light-years away from us. And here we are. Here I am today. I just feel that this is not an end, this is the beginning for a new generation.\"Of course, light-years was a figurative term. The literal distance was impressive enough: It's about 7,000 miles from Yao's birthplace in Shanghai to Toronto.\"All of the technology makes the world smaller, makes people closer,\" Yao said. \"I think that just happened, not only in sports area -- social culture, and all that stuff. People need to communicate. And the best way, I think, is sports.\"All that talk about distance and just a few steps away was Pistons Hall of Famer Isiah Thomas, a key component in the rise of Toronto basketball. It was only a few blocks away from this hotel ballroom that the Raptors went through their gestation period. They had offices in a building on 150 York Street, sharing the 11th floor with a travel agency and the Japanese and Malaysian consulates. They had no players or coaches. They had yet to pick a location or a permanent arena. And they faced a deadline to sell 12,500 season tickets by the end of 1994 or risk having their expansion franchise revoked. (A national drugstore chain bought the remaining tickets -- reportedly more than 4,000 -- to keep the Raptors viable.)Thomas, then 33, was a part-owner and the team's executive vice president, although his job required so much more than assembling a roster.\"My job was to sell basketball in this country and sell basketball to Toronto,\" Thomas recalled. \"I remember knocking on doors late at night, passing out fliers, talking about the Raptors.\"All he had to discuss at first was a logo, that dribbling dinosaur, a trademark Thomas envisioned being as enduring as Ronald McDonald. But he had reason to believe. Half of Toronto's population was born outside of Canada, so hockey wasn't as embedded in everyone's mind as as you might think. Why not make basketball their first love?\"You hoped,\" Thomas said. \"And all you really did was, you looked at the demographics. I knew what basketball was in America, but we didn't have the framework that America has in terms of the high school associations, then NCAA, so you have natural feeder systems in terms of coverage and information. So we really had to do all that here in terms of building the infrastructure. It was really a big haul. There were some nights you didn't know if you were going to make this work. You see where we are today.\"Now Toronto is a place where fans pack the streets outside the arena to watch playoff games on a giant screen. With the departure of the Grizzlies from Vancouver to Memphis, the Raptors now represent more than a city or even a region.\"We have all of Canada,\" Raptors All-Star guard  said. \"Everywhere we go in Canada, it's 'We the North. We the North.' You've got to appreciate that when you've got something like that going on.\"Raptors GM Masai Ujiri leaned against a wall on the second floor of a restaurant and expressed relief. It's Thursday night, the traditional soft launch into All-Star Weekend, and he just held a screening for the movie \"Giants of Africa,\" a documentary built around Ujiri's efforts to bring basketball camps to Nigeria, Ghana, Rwanda and Kenya. His passion and dedication to the project are so evident that it makes you wonder when he has time to run the Raptors. DeRozan went to the screening and thought the same thing. But here, at a post-screening reception, the Raptors occupy Ujiri's thoughts.He's relieved that they are relevant as the NBA comes to town. They have the second-best record in the Eastern Conference and DeRozan and  are the first guard tandem All-Stars from the host team since  and Gail Goodrich in Los Angeles in 1972. He would have hated for a subplot of the weekend to be \"What's wrong with the Raptors?\" stories. Those worries are gone.But the movie makes it clear that while the Raptors are his job, the African basketball camps are his calling. He has been inspired by Nelson Mandela himself, whom he met during an NBA trip to South Africa. Ujiri, who grew up in Nigeria, feels obligated to do whatever he can to elevate his home continent.The other thing that's evident? Ujiri, whose professional playing career consisted of stints with club teams in Europe, is an All-Star. Not in the participation-trophy-everyone-is-a-winner sense. In the grand scheme of things. He came from Africa to land one of only 30 general manager jobs in the NBA. It's the type of journey he wants to inspire other African children to duplicate.His advice to them could also serve as an answer the kid at the All-Star Game on Sunday night. It's not easy. Great accomplishments never are."},
{"url": "http://espn.go.com/espn/story/_/page/instantawesome-asgshoepoll-160213/wore-best-all-star-weekend-sneakers", "text": "The NBA's All-Star Weekend is more than just a showcase for the best talent the league has to offer; it's also a showcase of the best shoes on the market.While Nike and the Jordan Brand made their typical splash, brands with lesser clout such as China's Li-Ning and Under Armour also made an impact on the feet of the world's best players.After sorting through images of the weekend's best kicks, we've trimmed the list down to the top 10. Here's where you come in. Click the thumbs up or thumbs down icons next to each photo to help determine the best of the best.We've got a feeling Russell Westbrook's Air Jordan XXX's will be a popular pick, and not just because he won his second consecutive All-Star Game MVP wearing them.They just look cosmically cool."},
{"url": "http://espn.go.com/nba/story/_/page/allstar-14780161/nba-kobe-bryant-final-all-star-game-was-one-remember", "text": "TORONTO --  the crowd chanted as  stepped through the entryway onto a stage filled with smoke and dancing spotlights, the final player to be introduced Sunday night at the Air Canada Centre.\"An 18-time Western Conference All-Star!\" the announcer bellowed. \"A four-time All-Star Game MVP! The league's MVP in 2008! A two-time Finals MVP and a five-time NBA Champion! With the , Kobe Bryyyyyyyant!\"Bryant smiled as his accolades were rattled off, his hands remaining in the pockets of his warm-up suit. Not long after, Lakers legend Magic Johnson walked to half court, stood in the spotlight and spoke about Bryant's storied career. He also introduced a tribute video featuring Bryant's highlights, Bryant's voice and the voices of today's players too:\"Kobe, the road has come to the end,\" said  forward . \"You've been an unbelievable mentor to me.\"\"Thank you for everything you've done for this league,\" said  center . \"[You're] the reason I play so hard.\"\"There's not a lot of guys who come around like Kobe,\" said  guard . \"The game is going to miss you.\"\"I'm just proud to be your friend, be your brother,\" said  forward .\"Kobe, you did all you could for the game and being a champion forever, a walking legend, we appreciate you,\" said  star .\"Kobe Bean,\" said  forward , \"salute, my brother.\"When the video finished, the spotlight fell again on Johnson, who declared, \"There will never be another Kobe Bryant. Can all of us get on our feet and let him hear it one more time? Kobe Bryant!\"Bryant walked from the bench toward Johnson, gave him a hug and took the microphone as the crowd -- standing and cheering by this point -- began chanting,  He grinned as the adoration he has felt in every arena during this farewell tour again washed over him.\"Guys, I mean,\" Bryant began, searching for the right words, \"I, uh. I just want to, uh, want to thank you for all your support for all these years.\"The 37-year-old said he has been fortunate to play the game that he loves for more than half his life. He said it was a thrill to play in an All-Star Game alongside players who, during his very first one in 1998, were younger than his two daughters -- Gianna, 9, and Natalia, 13 -- are now. He said he has enjoyed passing on knowledge. He said he hoped today's players could play 20 seasons too.\"Thank you so much,\" Bryant told the crowd, \"and now I've got to go get loose.\"The Western Conference All-Stars' 196-173 win over their Eastern Conference counterparts amounted to a game-long tribute to Bryant, with touching moments throughout, such as Bryant playfully posting up Gasol, his ex-Lakers teammate, and Bryant dribbling against James on the right wing with James jokingly slapping both hands on the court as if a ferocious one-on-one battle was forthcoming.\"It was just bittersweet being out on the floor with him, knowing the matches between us two are coming to an end soon,\" James said. \"Man, I'm happy that I've been along for a small piece of the ride of his journey.\"It even seemed like the rim was working in Bryant's favor, as two early jumpers each danced around it for a bit before falling through. Bryant finished with 10 points on 4-of-11 shooting in 26 minutes. He shot 1-of-5 from 3-point range and 1-of-2 from the free throw line. He added seven assists and six rebounds. Then he checked out with 1:06 left in the fourth quarter to even more cheers.\"It was fun. I had a blast playing with those guys, laughing and joking with them on the bench,\" Bryant said. \"I had a great time. I had a great, great time.\"Bryant's 18 All-Star selections are second only to , and his 290 career points now stand as the second most in the history of the All-Star Game behind James (291).But all those numbers and records can't compare to an All-Star Weekend devoted to Bryant, with current and former players and coaches sharing memories and offering gifts, such as  giving Bryant a full set -- 30 pairs -- of custom Jordan sneakers, all in Bryant's size 14.\"He brought a lot of joy to the game, and I think the fans and the whole city have paid him a tribute, and he deserves it,\" Jordan said during an in-game interview with TNT's Craig Sager. \"He's been a big part to the game of basketball, and now his big task is what he's going to do next.\"I think he's got some plans, and I look forward to seeing where his life goes from this point forward; and him and his wife and the kids, they're going to be fine.\"Even more special for Bryant was having his daughters sitting behind the bench during the game.\"I was talking to them virtually the whole game,\" he said. \"They've enjoyed this as much as I have, coming to these arenas. You know, they've seen me throughout the years get up at 4 in the morning and work out and train and come home and work out again. So it's awesome, as a father, for them to be able to see all the hard work and how it pays off.\"Bryant also caught up with NBA legends Oscar Robertson and , who sat courtside. Soon, Bryant might find himself in their seats as an elder statesman, watching the league's younger generation carry on the game.\"You know, it's kind of bittersweet,\" said  coach Gregg Popovich, who coached the Western Conference All-Stars. \"You remember all the struggles against him and all the competitiveness and you respect him so much for bringing it night after night after night. You know, a lot of players don't understand that responsibility to be able to do that at that level, and he does it fiercely for all these years.\"So to see him now, it's like the passing of a generation. He's been such an iconic figure for so long, and he passes it on to that other group of young guys that you saw out there tonight. So I'm just thrilled that I was able to be here and see that, just like the other night when he came to San Antonio, I think he hit six 3s against us. I was actually thrilled. It was just great to watch him shooting and doing what he does. So he's a great one.\"And for as much as the experience was special for Bryant, it was just as memorable for his teammates.\"Oh, for sure. It will definitely be special,\" said Golden State Wariors guard . \"The entire night was very memorable, for sure, with his entrance during the starting lineups and the tribute video, Magic Johnson giving a speech about Kobe and his legacy to some highlight moments during the game where he had some nice plays.\"Add it all up, and Curry said he \"kind of got goose bumps out there.\"\"Kobe means something to everybody individually as a basketball fan and including us, as players,\" Curry added. \"So you kind of have a lot of different thoughts about what he means to the game and how he inspired you and myself growing up. I'll remember that for sure.\"Nearly every player mentioned something along those lines after the game -- how it was a moment they would cherish forever, how it was just an honor to play alongside him during his final All-Star Game appearance.All the while, Bryant wore a smile practically from start to finish. And when he left the game one final time to cheers and a standing ovation, he saluted the fans and clapped for them. Then the chants began again, one final time in this setting."},
{"url": "http://espn.go.com/nba/story/_/id/14764067/army-lakers-trainers-therapists-keep-kobe-healthy", "text": " well. Time always wins, all too quickly, and injuries and wear and tear expedite fate. Which is why, on a mid-November night after a win over Detroit, Kobe Bryant teeters on the edge of collapse. The Lakers icon stands before his Staples Center locker, swallowed by a media mob, shuffling his feet, shifting weight back and forth several times during a seven-and-a-half-minute session. His expression reveals nothing; no contortions or grimaces. But he seems uncomfortable. Often, before the media, he is as still as a statue. \"Right now, I'm barely standing up,\" he says, plain-faced, his voice low. \"My back and my legs, man -- it's killing me.\"The 37-year-old just added 36 more minutes to a career log that's north of 56,000, a total greater than all but two players in league history: Kareem Abdul-Jabbar and Karl Malone. And while that figure includes the postseason, it doesn't count the preseason or international competition -- FIBA in 2007, the Olympics in 2008 and 2012 -- nor does it factor in god knows how many practices, nor the offseason hours when Bryant forced himself to make up to 1,000 jumpers every day. If you tally everything up, Lakers coach Byron Scott guesses Bryant has played the equivalent of nearly three decades in the NBA. And if you consider that the average NBA career is 4.8 seasons, you begin to appreciate the outright pain Kobe now endures, 10 games into what is officially his 20th campaign.\"I'm not looking forward to walking to the car right now,\" Bryant says before the media mob breaks up. \"Seriously.\" to push Kobe Bryant to the court this season is done for reasons that are far more complicated than they first appear.It all begins with a dedicated army of physical therapists, massage therapists and trainers that battles daily to keep him upright with methods both high-tech and low-grade. A mini jackhammer known as the Raptor, which came on the market in December 2015, is used to blast through Bryant's scar tissue at 3,600 percussions per minute, to shake his muscles awake. A vibrating foam roller known as the Vyper, first available in 2014, helps his sore muscles relax. Before every game, a soup made from bone broth rebuilds his battered joint surfaces. After the final buzzer, a low-sugar chocolate milk aids his muscle and tissue recovery.Read more stories from TrueHoop's feature series.If there's time before a game or after, Bryant's Fusionetics therapist, Michael Oviedo, who blends preventative therapy with cutting-edge technology, completes a 10-point range-of-motion assessment, from big toe to shoulder. Using something called a goniometer, Oviedo measures whether Bryant's ankles bend at least 20 degrees, the optimal target; if they don't, Oviedo massages the soft tissue around the guard's ankles and into his calves, relaxing the muscles until he can move as desired. As Oviedo takes measurements, he punches his findings into the Fusionetics app on his iPad, which spits back suggestions on treatment.At every turn, Bryant is stretched, kneaded and evaluated, sometimes by his own neuromuscular therapist, or one of his two chiropractors, or his \"active-release\" therapist, or one of his several \"stretch professionals,\" or his personal strength and conditioning trainer.Longtime Lakers trainer Gary Vitti worries most about Bryant's Achilles tendon, but not the left one he ruptured in April 2013. That one, Vitti says, \"is probably stronger now than what he was born with, because they reinforced it and there's all that scar tissue in there now.\" But an Achilles injury changes one's biomechanics, one's gait, altering the workload on the other Achilles, which, in Bryant's case, is now strained. His right shoulder is also sore -- the same one on which he had surgery to repair a torn rotator cuff in January 2015. Bryant can't even feel that shoulder some nights. During his final game in Boston in late December, for instance, he daggers a 28-foot 3-pointer with 1:40 left and will later admit he actually leaped forward to help propel the ball toward the hoop. \"Thank god,\" he whispers to himself when it swooshes through, grateful that he made it and also that it reached the basket, unlike so many of his long-range shots these days.\"I lay down in bed sometimes, it just aches,\" Bryant says of his shoulder. He'll prop it up with a pillow, lie on his side. Sometimes, nothing works. \"Nights like that, it's pretty tough,\" he says. Only so much can be done, and at this stage of his career anything can go wrong.\"Every time he goes out there,\" Oviedo says, \"I'm always praying that he comes back off the court.\"In part because of this, Bryant never practices anymore. In fact, he completed his last full practice months ago, not long after the season began. He now spends his off-days in \"treatment,\" getting massages, or stretching, or plunging into tubs of ice-cold water, or lifting free weights, or pushing resistance bands or running on a treadmill to keep his legs limber. The level of care and scrutiny he receives ascends to the rafters, where, during games, SportVU cameras capture the movements of every player, the ball and the officials 25 frames per second. The data is then fed into a formula devised by the Lakers' training staff that charts player health/performance by rating them in zones: green (good), yellow (caution), red (danger). Even though Bryant has been among the team's minutes leaders, he has been in the red only a few times, according to Scott. However, Bryant hasn't been in the green much either. Instead, he lives in the yellow: not good, not bad, but always on the edge. dizzying routine his \"all-day process,\" and it is so much a part of his life that he has \"learned to love it.\" Those around him understand what's at stake, why they're doing all this -- for his season-long farewell tour. \"Every game, it's about Kobe,\" says Lakers GM Mitch Kupchak. \"Even when he doesn't play, it's about Kobe.\" The outcomes are largely irrelevant. His teammates are largely irrelevant too, even more so than usual. The focus is Bryant. He has even hired his own film crew -- up to a dozen travel to every game -- for a potential documentary and launched a \"HeroVillain\" marketing campaign with commercials that air on the JumboTron.It can be a painful spectacle to watch. Through the All-Star break, Bryant was shooting 35.0 percent from the field, last in the NBA. He was shooting 27.7 percent from 3-point range, second worst among league qualifiers. ESPN's real plus-minus had him 79th out of 80 qualified small forwards. As ESPN's Tom Haberstroh wrote in December, Bryant's decline from age 34 on -- after he ruptured his Achilles -- has been dramatically sharper than that of his peers. In fact, Bryant has actually contributed a negative number of win shares over the past three seasons: minus-0.7. That figure will likely worsen as his minutes pile up this spring.His ugly play shows itself on even the most celebratory of nights. In early December, in Bryant's hometown of Philadelphia, the hallways of the Wells Fargo Center swell with familiar faces, including ushers who baby-sat him years ago. The crowd teems with purple and yellow jerseys, Nos. 8 and 24, and plenty of maroon No. 33s, the jersey he wore at the tony Lower Merion High School just outside Philly. A thunderous ovation greets him during player introductions, followed by deafening chants of \"Ko-be!\" and \"M-V-P!\" It's a hero's welcome, and in the first 76 seconds against the 76ers, Bryant gives his hometown a show. He nails a 25-footer, then a 26-footer, then a 28-foot bomb, a defender in his airspace. The Wells Fargo Center turns into a madhouse: Kobe Bean Bryant has turned back time. He looks surgical, spry, good as new. In that moment, he can even sense, as he later recalls, the players guarding him wondering, \"Holy crap! Is this going to be an 81[-point] situation?\"Nope. It's a glimmer, gone as fast as it arrived. Bryant misses 18 of his final 22 shots, including 12 of 13 from beyond the arc. He ignores his teammates, firing whenever, wherever, desperate missed shots that become viral videos. He even laughs after a pair of second-quarter jumpers fail to draw iron. He shoots the Lakers into a loss against the 0 -- 18 76ers, sarcastically calling his performance \"beautiful basketball.\"Scott, Bryant's former teammate, says there will simply be nights when the Lakers have to \"live and die\" by Bryant's shooting. \"You just hope,\" Scott says, \"that you don't die too much.\"Why exactly do the Lakers enable this? It's not just about allowing one of the game's greatest to exit on his own terms, whatever they may be. Bryant's presence helps keep the Lakers' despair under the radar, helps justify sky-high ticket prices and helps buoy ratings, which is key because the team's 20-year, $3 billion deal with Time Warner Cable hinges on ratings, a source told ESPN in 2014. This season, with the Lakers on pace for their worst record ever, Kobe is the only reason to tune in.Even still, through the end of 2015, the Lakers held a 1.68 rating on Time Warner Cable SportsNet, the lowest in franchise history. Meanwhile, the Clippers pulled a 1.15 on Fox Sports' Prime Ticket, marking the closest the teams have ever been in local ratings, the  reported. The Lakers have long dominated their market, but it's slipping through their fingers. They can't afford for Bryant to sit.But the Lakers are playing a bigger game than stanching the ratings bleeding. At the top of the 2016 draft is LSU freshman phenom Ben Simmons, a once-in-a-decade player. To give themselves the best shot to land him on May 17, the night of the draft lottery, the Lakers have to lose. A lot -- as much as the very publicly tanking 76ers. Viewed in this light, Bryant's terrible play against the league-worst Sixers was, actually, excellent for business. That's the greatest irony of his daily ordeal. Bryant's desire to keep playing and keep shooting -- cast as the selfish acts of an egoist who can't let go -- ensures defeat, and thus helps the team.Which is all the more reason to knead and stretch and pull him, if necessary, onto the floor. Scott, perhaps saying more than he realizes, volunteers that no matter how much Bryant struggles this season, he will \"never, never, never\" bench him. \"That's not an option whatsoever.\"After all, every minute Bryant plays is its own little victory."},
{"url": "http://espn.go.com/sportsnation/story/_/id/14784187/netflix", "text": "Kobe Bryant has spent the past two decades notoriously consumed with perfecting his game. Needless to say, come April, he's going to have a lot more free time on his hands.So what do you get one of the greatest players of all-time when he is closing in on the end of his career? Cue Dwyane Wade, the ultimate gift-giver.Wade opted for a tasteful  Because Mamba is going to need a new hobby, and what better way to fill his days than a little binge watching.Just imagine Kobe once he gets into a series, No. 24 is going to commit and watch that show like it has never been watched before. this past weekend to show his affection for Kobe with a gift tailored to his looming post-basketball days.Chris Paul gave his fellow West All-Star a cane, reading glasses, dental adhesive and compression socks. Appropriate for a 37-year-old like Kobe (or someone closing in on their 90th birthday).Luckily for Mamba, Carmelo Anthony is a man with expensive taste -- and/or he didn't get the gag gift memo -- and decided to pay tribute to the Lakers legend's Italian roots with a magnum of 1996 vintage Gaja Barbaresco. This was also to insinuate that like a fine wine, the five-time NBA champion got better with age.So now Kobe can put on his compression socks, pour himself a glass of vino and watch \"Making a Murderer\" like the boss that he is."},
{"url": "http://espn.go.com/blog/boston/celtics/post/_/id/4722062/celtics-are-in-enviable-position-regardless-of-deadline-activity", "text": "In the immediate aftermath of the 2015 NBA trade deadline, the  huddled in Sacramento for an off-day practice. Boston had just swung a couple of buzzer-beating deals that delivered  and  -- two key players in Boston's impending second-half surge to the playoffs -- but coach Brad Stevens hardly looked like a man thrilled with another roster overhaul.Those deadline deals brought the Celtics to 11 trades involving 25 different players since the start of the league year. It also brought Boston to seven in-season trades and 40 total roster players. What's more, Stevens would divulge at that same practice that the Celtics were losing  for the rest of the season due to a foot injury.\"The constant change, it’s certainly a challenge,\" Stevens said.The second-year coach certainly knew that these moves had potential to help his team, though Stevens probably couldn't have known just how much of a jolt Thomas would provide. The more immediate challenge was integrating three new faces on the fly and replacing a key starting big man, all while trying to build off what Boston had done before the break in winning four of its final five games, including a thriller over the Eastern Conference-leading Hawks right before the recess.For a coach that craves stability and consistency, it was hard to stomach the idea of more change when his team  seemed to be headed in the right direction.Fast forward to this season. The Celtics find themselves at 32-23 overall -- 12 wins better than this time a year ago -- and owning the third best record in the Eastern Conference. After Boston closed out the first half with a thrilling overtime win over the , Stevens was asked about the looming trade deadline.\"I trust our front office to make the right recommendations and the right calls to help our team,\" he said. \"I think it would have to be something unique to continue to help our team. I think that we’ve got a lot of future flexibility and, at the same time, we've got a hard-playing group of guys. \u0085 There’s a lot of room to improve with the group that’s in there. My focus will be on that.\"The Celtics, armed with the war chest of assets built through all the change that Stevens has endured during the past 32 months, find themselves in a unique position at this year's deadline. Boston has enough desirable parts that it has cropped up in just about every trade rumble -- regardless of its veracity -- and yet you can easily make the case that Boston's best play this week is to sit things out.That's an unpopular option in Boston where some see a wide-open Eastern Conference and want Boston to splurge with its assets, even if that short-sighted philosophy runs counter to how the Celtics put themselves in this position to begin with.Should Boston, which hasn't made a trade since July and has the same 15-man roster it started the season with, mess with its chemistry? The simple answer is that the team ought to let last year be its guide. The Celtics should make a move only if the price is reasonable and it helps the team both now and into the future.The Celtics were fortunate to find that sort of deal last year. It doesn't happen often. And it might not happen this year. As hard as it is to remember amid the deadline hysteria, the Celtics have put themselves in great position now and in the future, regardless of whether they make a deal.Maybe it was just the afterglow of an overtime win over one of the best teams in the Western Conference, but there was an undeniable energy in the Celtics' locker room after Wednesday's win and it wasn't just the looming week's vacation the team was set to enjoy at the All-Star break.\"We're at a solid area right now,\" All-Star guard Isaiah Thomas said. \"The scary thing about it is we know we can do better. \u0085 I'm excited about what's going on here and we have to continue to put our foot on the pedal.\"Asked if he senses something big looming for the Celtics,  said, \"We see it’s happening.\" He later added about the deadline, \"Guys in the locker room, we’re sticking together and we’re fighting. Let the other stuff -- the talk and all that -- take care of itself. We have no control over that.\"Just because the players in the locker room like the chemistry and potential of this squad, doesn't mean that Boston shouldn't explore moves. Celtics president of basketball operations Danny Ainge has reaffirmed numerous times that, as currently constituted, the Celtics do not have the talent to compete for a title and it's unclear if they could even make a true charge at winning the East.So Ainge must be diligent in exploring ways to add another impact player, something that could also help the team recruit more free-agent talent this summer. But the cost at this time of season is typically high and Ainge shouldn't overpay just because Boston has so many assets.What Celtics brass is likely to keep in mind is that the team is in a pretty good spot with 27 games remaining in the regular season. The Celtics sit seventh overall in ESPN's Basketball Power Index and project at 48.8 wins and the third seed in the East (what's more, the nearby Hawks project at 2.5 fewer wins, giving Boston a bit of a cushion in its quest to land a top-three spot, and the opportunity to avoid the Cavaliers until the conference finals).BPI projects Boston with a 61.6 percent chance at a top-three seed, including a 55 percent at No. 3. Staying there would mean that Boston's path to the East finals would be: A home-court series versus a bottom-three seed in the East and a 2-3 matchup against the .That's still daunting for a young team low on star power, but, as former Celtics coach Doc Rivers said Wednesday, \"Listen, [these Celtics are] not scared of anybody.\"What's more, Boston would enter the summer with all of its assets preserved -- including that glitzy unprotected Brooklyn pick (currently 44.8 percent chance at top three and 91 percent top five) -- and could start the process of building a more surefire contender without disrupting this season's squad or sacrificing assets.Make no mistake: The Celtics should consider moves at the deadline. There's still too many big men and Boston should consider any move in which a team is willing to take on 's contract (as unlikely as that might be outside of a bigger deal). The Celtics could also use some wing depth as they got to the first-half finish line with Crowder being held together by rubber bands (and it's obvious their depth behind him is inexperienced at best).But these blockbusters for the likes of ,  and ? They're fun to fantasize about, though much harder to make a reality. There's little harm in waiting until the summer to explore the next step. Between now and then, the Celtics can enjoy seeing how far this scrappy team can go and find out exactly where that Brooklyn pick lands.The Celtics have been patient in getting this far in their rebuild and there's no deadline on taking the final leap to true contender status."},
{"url": "http://espn.go.com/blog/new-york/knicks/post/_/id/64133/sources-knicks-still-covet-jeff-teague", "text": "Members of the ' front office ran into a fundamental problem last month when they  to the  to gauge the club’s interest in trading .“They just didn’t have the pieces to make it happen,” one league source familiar with the dynamic said.That won’t stop the Knicks from trying. New York  from Atlanta at some point before Thursday’s trade deadline, according to a report by ESPN’s Marc Stein and Brian Windhorst.The club has made veteran point guard  and young forward  available, according to the report by Stein and Windhorst, who write that the Knicks are talking up Calderon’s leadership qualities to opposing teams and are offering the 25-year-old O'Quinn in some packages to \"sweeten proposals.\"Executives around the league believe the Knicks’ assets, or lack thereof, might prevent them from making a trade for Teague or another elite guard.New York was also monitoring Detroit Pistons guard  in recent weeks, so it would surprise no one if they discussed a potential deal for Jennings with the Pistons in the coming days.In addition to talking to Atlanta about Teague and monitoring Jennings' situation, the Knicks recently reached out to the Hawks about guard . They were unable to make traction on a deal, per league sources.Phil Jackson's club might need to get a third team -- such as the , with their large stock of draft picks -- involved if it hopes to obtain an elite player.The Knicks are unlikely to include their own draft pick in any deal. The next first-rounder they can offer in a trade is their pick in 2018.One last thing to note regarding the Knicks and the trade deadline: It wouldn’t be surprising if more rumors involving a trade of  surfaced. But Anthony, 31, has made it clear that he . So that appears to be a non-starter.\"There's always some trade s--- going [on],\" Anthony said Saturday during an interview on Sirius XM NBA Radio. \"I'm not going anywhere.\""},
{"url": "http://espn.go.com/nba/insider/story/_/id/14779309/kevin-love-boston-carmelo-anthony-cleveland-top-trades-see-nba", "text": "When the trade deadline (Thursday, 3 p.m. ET) forces teams to act, things start happening. And we have some ideas about what should happen.ESPN Insiders Tom Haberstroh, Chad Ford, David Thorpe, Bradford Doolittle and Kevin Pelton present 10 trades they would like to see, involving seven All-Stars and 15 teams, including five title contenders.To read all of our Insiders' potential trades, become an Insider today.Magazine subscribers:"},
{"url": "http://espn.go.com/nba/story/_/id/14746359/numbers-say-draft-picks-better-additions-players", "text": "Around the NBA trade deadline, fans often wish for their team to pull off a blockbuster deal that will help turn things around. This year, big names such as , ,  and  have been bandied about, and the  continue to shop around for a team willing to make a move for Howard.  he's not going anywhere. But the biggest deals from this week may appear less obvious: the acquisitions of future draft picks that pay off big time in the years to come.It's important to note that teams employ different game plans for in-season trades than they do for offseason roster moves. Teams make deals at the deadline mostly to create roster spots and dump unwanted salaries. One thing is certain: Recent championship-caliber teams do  make deadline deals because they already have properly built rosters. Can you name the only two players picked up at the deadline in the past five years by teams that reached the NBA Finals? They were decidedly non-factors:  to the  in 2014 and the rights of to the  in 2013. So recent history tells us that any team looking to shuffle its rotation with a new player this time of year likely won't claim an NBA title. Still, that doesn't mean teams can't find the next cornerstone to build around in the form of a future pick.So which is a better move, going for the short-term payoff of a rotation player or taking a chance on a first- or second-round pick? With a research assist by ESPN Insider , we reviewed data from the past five years on all transactions made during the week of the trade deadline and highlighted the players traded and players obtained from traded picks who are still with the teams that acquired them. They are sorted by their win shares per 48 minutes with that franchise. Here's what the numbers say:The deal that landed the  draft pick has been mutually beneficial for the Cavaliers and Clippers. Cleveland traded  and  for  ($13 million) and a 2011 first-rounder. Ultimately, the Clippers used the cap space created by dumping Davis to land  from New Orleans later that year, while the Cavs built around Irving once they got him with the first overall pick of the draft.Then-Clippers general manager Neil Olshey  that the team had weighed its options carefully: \"The drill is, as always, 'Is the player you're getting back more valuable than the potential you could get in the draft?' Our analysis at this point in February is that it was more valuable to get a 28-year-old All-Star point guard that we have for the next few years, cap flexibility to make sure we take care of business and re-sign  and have flexibility to take care of  as well, as opposed to speculating on another kid that's 19 years old with one year of college experience. And I'm not that high on the draft to begin with this year.\"The  deal is an example of a second-round pick paying dividends in a rare way. At the time, the Nets traded  ($11.9 million salary) and a 2012 second-round draft pick to the Warriors for Dan Gadzuric and . The Warriors wanted no part of Murphy and his oversized contract and  five days after the deal was completed. Wright was an intriguing talent who had been productive in limited minutes, but he played only 16 games in a Nets uniform. Gadzuric managed only 14 appearances. The Warriors were slogging through a 36-win season when they acquired the pick that landed them Green, and they have gone an astonishing 213-85 (.715 winning percentage) since drafting him in 2012. Green has developed into an elite forward, and on Sunday, he appeared in his first All-Star Game.The Nets traded ,  and a first-round draft pick that became  to get  from the Trail Blazers. Within two seasons, Portland was a 54-win team that reached the Western Conference semifinals with Lillard leading the way. Meanwhile, Wallace hardly proved to be worth a first-rounder for the Nets -- he averaged 15 points in a partial first season in New Jersey but became an afterthought the next season and was thrown into the Kevin Garnett/Paul Pierce trade after just 85 games in a Nets uniform. that they coveted only three players in the 2012 draft: Kentucky's Anthony Davis and Michael Kidd-Gilchrist and Kansas' Thomas Robinson. So giving up an unprotected pick wasn't a big concern. \"In meeting with our scouts, we felt the player that we may draft beyond the protection would be somebody that would probably take a couple years [to develop], and at this point, we're trying to speed the process up a bit and start winning [more],\" then-Nets GM Billy King said. \"I can understand the fan base [wanting the team to keep the pick], but I'd rather try to balance the roster, add a piece and still have cap flexibility.\"After two years of brisk player movement at the deadline, 2013 was fairly quiet for both players and picks. The four picks dealt were all second-rounders, ranging from 34th to 60th overall, and none proved to be game-changers. The player deals were nothing to write home about either.Another snoozer, 2014 saw more second-round picks traded, two of which were used on the likes of Arturas Gudaitis and Vasilije Micic -- internationals who haven't seen NBA action yet. Jerami Grant has shown flashes of potential while toiling for a dreadful 76ers team.It's still too early to evaluate how the picks that were traded at last season's deadline panned out, given that 11 of the 12 picks haven't been used yet. In terms of traded players, stars such as  and  changed teams and have made an impact. So if you want to find the next star player who might help turn around a franchise who arrives via a pick traded in 2015, keep an eye on the  and  -- they each hold three of the 11 future picks.The players acquired from traded picks have a better retention rate in three of the five years we examined. And when you average all the win-shares-per-48 totals, look below to see how it shakes out. Keep in mind, the average NBA player's WS/48 is about .100. Also take note of the rounds in which these traded picks fell -- it's not just lottery picks that are paying off; second-round selections such as Green and Grant are working out well, too:"},
{"url": "http://espn.go.com/nba/story/_/id/14771138/chris-bosh-miami-heat-says-more-exams-coming-injured-calf", "text": "TORONTO -- All-Star forward  will have more exams on his strained right calf when he gets back to Miami.It was not clear whether Bosh underwent any testing yet as of late Monday night.He has conferred regularly with Heat medical officials about the issue, which he has been dealing with and getting treatment for over the past several days. Bosh came to Toronto with hopes of participating in Saturday's 3-point contest and Sunday's All-Star Game, but dropped out Friday out of concern of making the calf worse.\"It just lingered and I didn't feel it was wise to continue to push it, especially with this elongated week that we have off,\" Bosh said. \"I just wanted to make sure that I was taking the necessary precautions and being a good professional.\"Bosh leads the Heat in scoring this season, averaging 19.1 points per game. Miami next plays in Atlanta on Friday, and Bosh's status for that game almost certainly won't be determined until the additional tests are performed.Bosh said he's \"pretty optimistic\" that the issue is not more serious. His season ended prematurely last year because of a blood clot on his lung, a problem that he believes originated from a calf injury.\"When we get back to Miami we'll do everything we need to do to make sure it's right,\" Bosh said.Heat star  told ESPN's Jackie MacMullan after Sunday's All-Star Game that he also is \"trying to stay positive.\"\"It's scary,\" he said. \"We'll see when we get back there, but I'm going to think positively about it.\""},
{"url": "http://espn.go.com/nba/story/_/id/14773973/nba-commissioner-adam-silver-there-unintended-consequences-upcoming-salary-cap-increase", "text": "TORONTO -- As the NBA prepares for the largest salary-cap jump in league history this summer when its , commissioner Adam Silver said \"there will be unintended consequences,\" which could include the possibility of star players joining forces on teams already loaded with multiple max-contract players.Such an outcome would run directly counter to one of the NBA's key objectives in its most recent collective bargaining agreement -- ratified in late 2011 -- to create more balance throughout the league by forcing teams to pay a harsher tax and other penalties for spending above their salary cap.The coming avalanche of money means teams that had been frugal with their payroll will be competing against teams armed with both established players and room to bring in max-contract stars.Yet this summer's upcoming increase -- the salary cap will leap to about $90 million in 2016-17, up from roughly $67 million this season -- will allow some teams, such as the defending champion and star-laden , the financial flexibility to chase after max-contract-level players.\"That is not something that we modeled for,\" Silver said Saturday night during his annual All-Star news conference in advance of Sunday's game at the Air Canada Centre. \"The intention wasn't that in this system that teams could sign without going above the tax that many max player contracts and that many All-Stars.\"So if you ask me from a league standpoint, we would prefer that our All-Stars be distributed around the league rather than having so many All-Stars in one market. But we'll see what happens this summer. I mean, as I've said, there will be unintended consequences from all this additional cap room this summer. I just don't know what those consequences will be.\"Silver said that the current CBA is \"absolutely not\" a perfect system.\"But we feel it's a fair compromise, and we feel it's working pretty well,\" he said.Silver said that under the current CBA, \"what that system is about is player distribution. So if you look now at the league, we see the way our stars are distributed throughout the league. You see seemingly no correlation between market size and where the stars are located.\"Ultimately our goal from the league standpoint is to have truly a 30-team league where teams are competing based on management, based on either market size or an owner's willingness to lose substantial amounts of money.\""},
{"url": "http://espn.go.com/nba/story/_/id/14774906/zach-lavine-minnesota-timberwolves-edges-orlando-magic-aaron-gordon-slam-dunk-contest", "text": "TORONTO --  was fresh out of dunks, having been pushed to the limit by  in an epic final round in the NBA's slam dunk contest on Saturday night.In need of some magic, he reached deep down into his repertoire and found just enough left for one more go.In a slam dunk contest that needed two extra rounds, Minnesota's Zach LaVine outlasted Aaron Gordon to firmly establish his place as one of the greatest dunk contestants in NBA history.Sharpshooter Klay Thompson topped teammate and defending champ Stephen Curry to win the 3-point contest, and Karl-Anthony Towns won the Skills Challenge to kick off NBA All-Star Saturday night.The 3-point and dunk contests are pure fun for players, fans and celebrities alike.  See some of the best reactions to the show.\"We were looking in our bag of tricks. Ain't nothing left,\" LaVine said. \"I just found a little piece of dust.\"LaVine pulled off a between-the-legs dunk from the free throw line on the second tiebreaker to take home his second straight dunk contest trophy, becoming just the fourth player -- after , Jason Richardson and Nate Robinson -- to pull off that feat.The  guard had never tried the dunk before. Not in practice. Not at the playgrounds back home in Seattle. But he had already used all four of the dunks he planned to do when fellow contestant  told him to try it.He pulled it off, putting an emphatic punctuation on a contest that instantly drew comparisons to the showdown between  and  in 1988.\"I just think that was the best contest,\" LaVine said. \"There was some stuff that's never been done before. I don't want to get into the greats -- Mike, they're in a different breath. If you really look at it as a whole, we were doing dunks that professional dunkers take four or five tries to do and we were doing it on the first try. It was ridiculous, man.\"Lavine dedicated his win to his late coach Flip Saunders, who died of Hodgkin's lymphoma in October. A photo posted by Zach LaVine (@zachlavine8) on Two former slam dunk champions, Wilkins (1985, 1990) and  (2011), tweeted their excitement over the contest.The dunk contest is back!!! Dominique Wilkins (@DWilkins21) Gotta be one the best dunk contests of all time. Hats off to   Blake Griffin (@blakegriffin32) The night started as a coronation when, on his first dunk, LaVine grabbed the ball off the bounce, wrapped the ball around his back before cupping it with his right hand and throwing it down. But once the contest was whittled to two contestants, Gordon put on a show and was every bit LaVine's equal.\"I'm so happy I prepared some extras because usually you don't need them,\" LaVine said. \"People usually aren't that prepared to go up against you. But he deserved the title just as much as I did. He ... did some crazy, ridiculous dunks. I'm just glad I got the last laugh.\"Gordon jumped over Magic mascot Stuff, who was standing on a hoverboard, for three of his dunks, including one in which he grabbed the ball and passed it underneath both legs before throwing it down. He also grabbed the ball out of a spinning Stuff's hand and threw down a huge 360 to open the final round.\"If I knew it was going to be like that, I would have prepared better and we would have been here dunking all night, going back 50 after 50 after 50 after 50,\" Gordon said. \"We would have been here all night. I didn't know it was going to be like that.\"The door finally opened for LaVine when Gordon was awarded a 47 on his fourth dunk of the second round, a -style jackknife.Then LaVine shut it down, scoring a 50 on his final dunk.\"Zach's an incredible dunker,\" Gordon said. \"He went through the legs from the free-throw line. That is insane. So off that dunk, you've got to give it to him. That's why the trophy's with him and not with me.\""},
{"url": "http://espn.go.com/nba/story/_/id/14779977/2016-nba-all-star-game-russell-westbrook-oklahoma-city-thunder-wins-mvp-award", "text": "For the second straight year,  took home NBA All-Star Game MVP honors as the Western Conference logged a record-setting  over the East on Sunday.Kevin Pelton hands out his grades for a record-setting All-Star Game, which included another MVP performance from Russell Westbrook.The NBA celebrated Kobe Bryant's last All-Star Game with a point-scoring bonanza. Stats & Info takes a look at the highlights.In an edition that toppled last year's mark for total points, the  guard poured in a team-high 31 points and filled the rest of the stat sheet with eight rebounds, five assists and five steals in 22 minutes.Westbrook told ESPN's Sage Steele after the game that he was surprised to win the award.\"I was honestly surprised I won it again,\" Westbrook said. \"I was very surprised to have my name called. I'm happy and blessed to be in the game again and for the opportunity.\"Westbrook garnered six of a possible 12 MVP votes, with  forward  and  forward  -- playing in his 18th and final All-Star Game -- each taking two.  guard  and  guard  each earned one. All Westbrook's votes came from media voters, while both of Bryant's votes originated from the Twitter fan vote, of which there were three.George scored a game-high 41 points, including burying nine 3-pointers, and fell two points shy of Wilt Chamberlain's All-Star record of 42 points.In last year's 163-158 West win in New York, Westbrook registered 41 points as a reserve and set an All-Star Game record for points in a half by scoring 27 in the first half.Westbrook is the first player in All-Star Game history to win outright back-to-back MVP awards. He joins Bob Pettit as the only players in All-Star Game history to win twice in a row. Pettit won the award in 1958 and shared it with  in 1959."},
{"url": "http://espn.go.com/nba/story/_/id/14780127/paul-george-indiana-pacers-scores-41-points-all-star-game-falls-1-point-shy-wilt-chamberlain-record", "text": " forward  scored 41 points Sunday in the NBA All-Star Game, falling one point shy of tying 's All-Star record.George could have broken Chamberlain's record, set in 1962, but he missed a 3-pointer with just under a minute remaining in the fourth quarter of the Western Conference's .The 25-year-old George said he was \"unaware\" that he was one point short of the record, though he noted that  forward  defended him more tightly down the stretch.Russell Westbrook led the Western Conference All-Stars with 31 points in 22 minutes and took home All-Star Game MVP honors for the second straight year in a 196-173 win over the East All-Stars.Kevin Pelton hands out his grades for a record-setting All-Star Game, which included another MVP performance from Russell Westbrook.\"They weren't trying to let me break that record,\" George said during a postgame interview with TNT. \"I was unaware, though. I shot the 3 when I could have got a layup. If I had known that [I was close to the record], I would have dunked.\"Green got right in George's face during the game's final minute, hounding him all over the court in the only possession of competitive, NBA-level defense played the entire game.\"We don't want any records like that broken on us,\" Green said with a chuckle. \"Just trying to contest the shot.\"George, who made his first All-Star appearance since he suffered a serious leg injury in August 2014, shot 16-of-26 from the floor and made nine 3-pointers, which tied  for the second-highest scoring in All-Star Game history.Westbrook scored 41 points last year in Brooklyn en route to being named All-Star Game MVP. The  guard , too, after leading the Western Conference with 31 points Sunday.\"I had every intention of trying to walk away with some hardware, trying to win that MVP,\" George said. \"Granted, I didn't, but I had a helluva night. I had fun.\"George told TNT that he considered himself \"blessed\" to be able to perform so well less than two years after his injury. He suffered a compound fracture on Aug. 1, 2014, during a scrimmage at Team USA training camp and played in just six games last season. George has appeared in all 53 of Indiana's games this season and is averaging a career-high 23.3 points per game.\"I had a hard-fought summer, hard-fought rehab year,\" George said. \"It was just a very upward climb. It took every day and, really, every moment of rehab to get through it. There were a lot of days where I felt like I was down and out but just stayed with it.\"While he was injured, George worked on two of his game's weaknesses: ballhandling and perimeter shooting. He returned this season a more well-rounded player and averaged 29.5 points, 8.2 rebounds and 4.3 assists the first month of the season. Those numbers have dipped as the season has worn on, but George has his swagger back.\"He's back,\"  star  said. \"The way he shoots the ball, the way he attacks the rim, his game is very unique. Basically, he was showing guys tonight that he's back to rare form.\""},
{"url": "http://espn.go.com/nba/recap?gameId=400829482", "text": "TORONTO --  exited the All-Star Game for the final time to watch  and  wrap things up with 3-pointers.Russell Westbrook led the Western Conference All-Stars with 31 points in 22 minutes and took home All-Star Game MVP honors for the second straight year in a 196-173 win over the East All-Stars.Kevin Pelton hands out his grades for a record-setting All-Star Game, which included another MVP performance from Russell Westbrook.The NBA celebrated Kobe Bryant's last All-Star Game with a point-scoring bonanza. Stats & Info takes a look at the highlights.Bryant's gone, and these young guys are good.Bryant said his All-Star Game goodbye and the next generation of the West's best sent him off a winner, rolling to a record-setting 196-173 victory over the East on Sunday night.\"It was fun,\" Bryant said. \"I had a blast playing with those guys, laughing and joking with them on the bench.\"The first All-Star Game outside the U.S. was the highest-scoring ever. Bryant didn't provide much of the offense but many of the memories.\"To see him now, it's like the passing of a generation,\" West coach Gregg Popovich said. \"He's been such an iconic figure for so long, and he passes it on to that other group of young guys that you saw out there tonight.\"Bryant finished with 10 points, so few that he lost his career lead in All-Star scoring to .But Westbrook scored 31 points in his second straight All-Star MVP performance and Curry added 26 -- the final three on a 42-footer.  had 24 on 12-for-13 shooting and  chipped in 23. finished with 41 for the East, tying Westbrook's total from last year in New York that was one off 's record.  added 22 points.James finished with 13 points, just enough to move ahead of Bryant for most ever in the All-Star Game. James has 291, while Bryant, who is retiring after this season, leaves with 290.He checked out with 1:06 left to cheers and hugs from his fellow All-Stars who now put up points in bunches the way Bryant did for so long.Bryant had seven assists and six rebounds, but shot 4 for 11 in a game where there isn't really much defense and had never been less. The 369 combined points were 48 more than last year's record, and both clubs blew away the previous individual team record of 163.But people just wanted to see Bryant play, not necessarily play well.\"We all at one point in our life wanted to be Kobe in our driveways somewhere,\" the East's  said. \"We watched him growing up and we wanted to pay respect to him.\"The pregame was a celebration first of Canada, then of Bryant.A video message from Dr. James Naismith, the Canadian who invented basketball in the early 1890s, was followed by player introductions by two-time NBA MVP Steve Nash and Grammy winner Drake. Canadian Nelly Furtado sang her country's national anthem.Then it was time for two video tributes for Bryant, whose 18 All-Star selections are second only to . Bryant thanked his millions of fans as the other All-Stars lined up in the background to salute him.\"I know it's been overwhelming for him over this year, but our fans across the world and here in the States and here in Toronto, as well, has just been paying so much respect,\" James said. \"It's all well-deserved.\"Toronto hosted the very first NBA game on Nov. 1, 1946. Neither Naismith nor anyone who saw that game would recognize the way it looked Sunday.Curry and Durant launched shots from spots where only buzzer-beating heaves were once attempted, and Westbrook put together another combination of speed and force that turned it into a rare All-Star blowout in the second half.The West has won five of the last six even without longtime mainstay Bryant, who hadn't played since 2013 because of injuries. But players like Westbrook, Durant and Curry are more than ready to shoulder the load.At 37, Bryant has trouble keeping up with the youngsters -- especially the real young ones. 's son stole the ball from him as Bryant warmed up for the second half.But he was the star without playing a starring a role. He had said he didn't want players forcing him the ball in an effort to make him the MVP -- he's already got four of them in this game -- but he was never far from the center of attention.The West led 92-90 at the break, both teams surpassing the previous record of 89 points in a half.The game goes back to the U.S. next year, and for the first time since 1997 won't have Bryant. He made his All-Star debut in New York in 1998, a game also remembered for 's last with the .Jordan, now chairman of the Hornets, was on hand Sunday for a ceremonial passing of the All-Star torch from Toronto to Charlotte, the 2017 host.Paul finished with 14 points and 16 assists and is the leader in All-Star assists per game.  scored 18 points for the East and  had 14 points and 10 assists as both Raptors played well in front of their home crowd.\"I think everybody got the feel of the energy that we witness every single night when we play as Raptors players,\" DeRozan said. \"I think all the guys really got insight on how in tune the city of Toronto and all of Canada is to basketball.\""}]