[{"url": "http://espn.go.com/nba/story/_/page/nbarank1/all-nbarank-1", "text": "Michael Jordan is the greatest of all time, topping our All-Time #NBArank list of the 100 best players ever.To create All-Time #NBArank, we put together a ballot with the 150 greatest players ever. Then our ESPN expert panel voted on thousands of head-to-head matchups, . The result is our .\n\n\n\n\n\n\nIn the 11 seasons in which he played at least 20 games with the Bulls, Jordan finished in the top five of MVP voting 10 times. The exception? His rookie season, when he finished sixth. And in the playoffs, going strictly by seeding, MJ's teams were never upset. Against teams seeded the same or lower, Jordan's teams had a perfect 24-0 series record. -- Here's the thing: Bird's famous statement about Michael Jordan is not the one that defines him or his career. MJ's \"love of the game\" clause does.Jordan had the provision written into his first contract, allowing him at any time, any place -- playground, rec center, backyard, arenas, stadiums -- to pick up a basketball and just ball. Those words speak more to his game than the 63 points he put on Bird and the Celtics in '86 that became his warning to the world of what we were all about to witness during the next 13 seasons.And that love ran . Unconditional. Often parallel to his addiction to competition, his need to win and his almost inhuman (or inhumane) ability to use losing to make himself -- and others around him -- greater.Be like Mike? He left room for others to come close. But could you be like him ? All due respect to Wilt, Kobe, LeBron, Steph, Magic and all other players who fall below Jordan's No. 1 position on this list, but what set Jordan apart was his ability to follow up his own \"God-like\" performances with something greater the next game, the next series, the next season. And  more than anything -- more than his talent, more than his desire, more than his will, his insane 30.1 PPG scoring average and 27.9 PER, his overall winning percentage, his six rings and the fact he has become the true measure of greatness in sports -- is the Sum of Jordan.That, and the fact that he balled so large that Bird's \"God\" comment actually became an afterthought.-- "},
{"url": "http://espn.go.com/nba/story/_/id/14750370/bar-fights-court-troubles-jahlil-okafor-opens-up", "text": "on a leather chair in the darkened media room of his Center City penthouse. In his black T-shirt and gray shorts, he looks drawn, tired. The Duke basketball game is playing on his oversized television on this Saturday afternoon in February, the sound cranked to a near-deafening level. A Styrofoam container, with remnants of an omelet, sits on a table. His 3-year-old niece pirouettes across an Oriental rug while his rottweiler, Natty, drops a bone on the floor. His agent's representative, a woman named Alyson Furch, gives him a to-do list for the coming week. For starters, Okafor needs to pick out what he's going to wear in Toronto, during the NBA's All-Star Weekend.He notices none of it.\"Hey!\" Furch says.Nothing.\"Hey!\"Okafor gives a slight jolt, like he has been awakened from a trance.\"Huh?\" he asks. \"What'd you say?\"Last night's nine-point, four-rebound, five-foul game is behind him. A Philadelphia 76ers loss to the Washington Wizards. Two nights earlier, it was a 38-point blowout to the Atlanta Hawks. Okafor's team is riding a four-game losing streak, which is spectacular in itself. It's Feb. 6, which means the 76ers have finally won a game. Seven, actually, leading into Saturday against the 13-win Brooklyn Nets. It will be another chance for Okafor to redeem himself. If not on the court, then with the fans, with the City of Brotherly Love, which hasn't always been so lovely to him. Some of that is his own doing; some of it is life as a professional athlete in a city that expects so much, that is desperate for a winner.Okafor is averaging 17 points and seven rebounds per game this season. Leading into Saturday, he has racked up 18 20-or-more-point games -- the most of any rookie -- and will play in the BBVA Rising Stars Challenge on Friday as part of the NBA's All-Star festivities. But despite these successes, there's a sense this has hardly been a season of dreams for the Sixers' rookie. Forget the seven wins. Forget the 43 losses. His first year in the NBA has been about doubt and adjustment. He is 20 now, two years out of high school. He has had to grow up since going No. 3 overall to Philly in June. It hasn't been an easy transition.In early October, there was the argument outside a Philadelphia nightclub where a gun was pulled and the cops showed up. There was the ticket for speeding 108 miles per hour across the Benjamin Franklin Bridge. And there were the fights outside a Boston nightclub in November, moments captured on video and posted online for everyone to see.Okafor tried to keep the episodes quiet, off newspaper pages and Twitter feeds. It worked until it didn't. A two-game suspension. A hurried apology. A flood of bad PR for a young man who'd wanted nothing more than to call himself an NBA player. As a kid growing up in Chicago, he thought about it almost every day. Now here he was. Jahlil Okafor, NBA player, appearing intoxicated, brawling on a darkened Boston street, a fool for everyone to see. Still a kid. And now he was being called other things: immature, selfish, a punk.If the rest of the world seems like a battlefield, this penthouse is his bunker. But now, for the first time, he has agreed to talk about this season, on the court and off. Still, he looks uncomfortable.\"It's not right,\" he finally begins. \"That's not who I am.\"we met in Philadelphia, it was October, and Okafor was on a mission to prove his doubters wrong. He'd spent hundreds of hours in gymnasiums and weight rooms across the country last summer, sweat dripping off his body, honing his game, getting tougher, stronger. Coming out of Duke, he was seen as a poor defender who was a little out of shape. He was the 6-foot-11, 275-pound big man who didn't rebound like a 6-foot-11, 275-pound big man. He was a liability at the free throw line.But now, in the NBA, he was beginning to show what he could do. In his first game, a 17-point loss in Boston, he produced 26 points and seven boards. He went 6-for-6 from the line. Five days later, at home against Cleveland: 24 points. In Chicago a week later, in front of family and friends: 21 points, 15 rebounds, the first double-double of his pro career. All losses. The third double-double came in mid-November against Dallas. After that game, the Sixers' 11th consecutive loss to begin the season, Okafor trudged into a hallway, his right shoulder bumping against a wall like a pouty kid who'd been sent to his room without dinner, the poster child for an organization perpetually mired in defeat.A week later, the 76ers drop a tight 84-80 game in Boston during which Philadelphia blew a late, five-point lead and ran the team's losing streak to 16 games. Afterward, Okafor went to a club with at least one teammate. As he left in the early morning hours, he was videoed arguing with a group of men. Okafor looked intoxicated. He was slurring his words. \"We got money, you broke-ass n-----,\" he yells as someone tries to diffuse the situation by directing him to a vehicle. Later, he shoves another man and then begins swinging. Someone appears to land a punch into Okafor's upper back. In a second video, the crowd has traveled farther down the street and someone is trying to lead Okafor back to the vehicle: \"Yo, Jahlil! ... You don't need that!\" Okafor later shouts: \"You broke-ass b----!\" He rubs his fingers together: \"Munn-eeeey! Munn-eeeey!\" There's another fight. Okafor appears to land a punch. Glass seems to break. \"Stop it! Stop it!\" a woman screams in the background.\"It was Thanksgiving eve. Me and one of my teammates went out,\" he says from his penthouse, declining to name the teammate. \"As we were leaving the club, there were these guys pretty much heckling us, just normal stuff, saying, `You suck.' I was already frustrated that we were losing. At the time, we were 0-16, and we'd just lost a close game we should have won. I can't really talk about details [of the fight]. Pretty much what you see in the video. I was upset. I made a mistake. I let them get under my skin. I reacted.\"When the video came out, it was definitely embarrassing. It was hard to watch. I've watched the video once pretty much because I was disgusted looking at myself in the video.\"But that was just the first incident to be made public. There had been another altercation, around 2 a.m. in early October, outside an Old City club. A witness reported that Okafor and another person were arguing with two men in a parked car. Okafor tried to punch the driver through an open window, the witness told police. Both the driver and the passenger jumped out of their vehicle, and the passenger pointed a weapon at both Okafor and the other person before U.S. Park Rangers, who patrol nearby Independence Hall, arrived at the scene. The gunman fled on foot and appeared to toss his gun. The driver sped off, and the car was not stopped.Okafor doesn't deny he was drinking that night but says the police reports didn't give an accurate picture. The gun, he says, wasn't pulled on him but on a friend's girlfriend. \"It was really fast,\" he says, declining to elaborate because he says the incident is still being investigated. \"It wasn't just me,\" he later adds. \"I was with other people, but just being who I am, my name was the name that got brought up. I wouldn't say I regret that the incident happened. You never want that to happen, but it was something I was able to learn from and become a better person because of it. It was frightening, to be sure. It just happened so quickly. I don't remember what I was thinking. It was just like a quick flash. I was lucky the police were there right away.\"Has he stopped drinking?Okafor laughs.\"It's still the real world,\" Furch interrupts. \"But we all know he can't go out and do that. He can go to the house and do whatever he wants. It's like when New Year's happens and you're crazy and wild, and people get that on camera. They think that's you on Tuesday.\"And there was the ticket; 108 miles per hour in his Maybach, 63 miles per hour over the posted speed limit. \"It was after the Eagles game,\" he says. \"A friend and I were leaving, and I was on the bridge. It was open. Oh, man. My car just goes really fast without kinda knowing. I was obviously speeding. It wasn't a super-bad situation. I got pulled over by the police officer. He gave me a ticket. It's obviously not the safest thing.\"The suspension came quickly. Okafor was in New York -- in his hotel room before a game against the Knicks -- when he got word from Sixers general manager Sam Hinkie. \"It was a much-needed conversation,\" Okafor says. \"He pretty much said [the suspension] was something that needed to be done. I'd talked to him prior about the situation. I apologized to him. There were consequences that would be coming eventually. That was a consequence. He informed me what was going to happen and that it will blow over and be in the past.\"\"He had all this noise happening around him,\" says Furch, who was with Okafor in New York. \"We just sat around in the hotel and ate donuts.\"\"Donuts,\" Okafor repeats.\"All this crap was around,\" Furch says. \"But we just said, 'Don't be stressed.' \"\"We watched the Duke game, ate donuts and watched the Sixers game,\" Okafor says. \"I was frustrated. But I don't care what people on the outside are saying.\"Except, of course, he does. There was another report stating Okafor used a fake ID to get into a bar. \"That wasn't true,\" he says. \"It was like people were making stuff up. A fake ID? That's a place I go to all the time to get food. What I was going through, to have that out? I was upset about it. It was fuel to the fire. Now it was like anyone could say anything about me and people would believe it because of what I'd done in the past. I've never been in the spotlight. I've never been the guy who was, like, look at me.\"Now, though, it seems everyone's watching to see if he'll fall apart.against Brooklyn, Okafor piles into a black Land Rover with Furch. It's 4:42 p.m., and he has to be at the Wells Fargo Center in 18 minutes. Okafor presses the gas, but he doesn't get far. Traffic. Stoplight. More traffic. This will not be a 108-mile-per-hour drive. He checks the time, pulls up Adele on his phone, and the first strains of \"Remedy\" blow through the speakers.The Land Rover doesn't belong to him. It's Elton Brand's. The former first-overall pick -- a 17-year NBA veteran and former Duke standout -- is Okafor's new teammate. He's letting Okafor borrow the vehicle to get around the city during the winter. \"He wants me to be smart about my money,\" Okafor says.\"That's a  veteran move,\" Furch adds.At 4:58, Okafor pulls into a space just a few yards from the arena. As he's exiting the vehicle, a piece of plastic between the Land Rover's door and the windshield pops off. Okafor holds it in place with his left hand and tries to reattach it, but he has to get inside. He leaves the piece dangling.Near the court two hours later, dozens of children wait for him in a section behind one of the baskets. They're Okafor's guests, low-income kids from the area. Some are from group homes. Okafor's father, Chukwudi, is sitting in the second row, watching his son.\"I'm not even disappointed in him,\" Chucky Okafor says of the past few months. \"I have a clear understanding that Jahlil is a child. I don't look at it through the media's eyes. I look at him as a grown boy who's going to make mistakes. He's going to do different things to become a man. That's what's going to help define him, as far as character. The situations happened; it was unfortunate. It doesn't do good to be upset. My son was safe. That's the most important thing to me. I was 19. There's nothing he has done, or anyone else has done, that an ordinary 19- or 20-year-old hasn't done. Who hasn't sped? You worry about your child, but these are isolated situations. I've known Jahlil for 20 years on this earth. And in 20 years, he might have given me three issues. He's been 99 percent the perfect son. Everything else is life experiences. You're going to go through things. You're going to make mistakes. That's life.\"Much, too, has been made of Chucky, who has been known for his boisterous support of his son. His Twitter handle is @DaddyofaPro. On this night, a necklace with a hoop made out of small, faux diamonds hangs from his neck. He wears a championship ring from his son's high school team on his right hand.On Jan. 2, he was heard heckling Philadelphia coach Brett Brown during a game against the Clippers. At the end of the first half, Jahlil reportedly told his father to stop. It was a momentary step back after everything that had happened. \"I don't want anyone to be tanking,\" Chucky says. \"I want him to win. I want my son to get everything he deserves. He should be in the conversation for rookie of the year or rookie of the month. It comes with winning.\"I don't think it's the losing that's hard on Jahlil,\" he continues. \"I think it's the fact there are certain things he can't control. You can't control playing time, you can't control who's on your team. You just have to go with it and continue to do what you came here to do. That's for him to be great. It was never said where he would be great.\"A couple of people stop and say hello. Chucky takes a photo with a Sixers fan. Someone hands Chucky an envelope. Thank you letters from the kids to his son.Chucky beams., after the Sixers' 103-98 win against Brooklyn, Okafor emerges from his bedroom around 2 p.m. and ambles down a hallway. He was up until 4 a.m., one of his friends says. A few of them went out to dinner, then came back to the penthouse and talked.It was a big game. Okafor scored 22 points and grabbed 17 rebounds, including two important boards late in the fourth quarter. This was the Jahlil Okafor everyone expected in Philly. \"I think he wants to be [a role model], and he can be,\" Brown says privately after the game. \"He's just young. You want to live life, you want to be remembered. To say that situation was an eye-opening experience is a gross understatement. But it seems like a long time ago to me, and I hope it feels that way to him.\"The episodes, Okafor admits, \"definitely took a toll\" on the court. \"I thought I was playing pretty decently before it happened. I think the next two or three games, I wasn't just really focused.\"He's in a black shirt and pants, sitting in his family room. It's a spacious place, with pop-a-shot hoops, a chair from the 2015 Final Four and views of the city. The fireplace is on. His fake Christmas tree, still aglow, is standing in the far corner, next to two remote control trucks.\"I felt like I didn't want to be out on the court in front of so many people,\" he continues. \"I was embarrassed about it at the time. It was something I had to talk to my family about.\" He called his private trainer, who has been working with him since middle school. \"We had conversations all night,\" Okafor says. \"He showed me different people of high power who messed up, who have overcome. That really helped me out.\"At this time next year, his second season in the NBA, he says he doesn't want to be planning for the rookie-sophomore game on All-Star Weekend. He wants to be in the main event. He wants to be considered among the game's elite. He wants to put Philadelphia back on the basketball map, a difficult task. Perhaps even more difficult, he wants those months from 2015 to be well in his past.\"I can learn from this,\" he says. \"Don't let it happen again.\""},
{"url": "http://espn.go.com/nba/story/_/id/14752456/truehoop-presents-sources-reveal-2007-kobe-lebron-trade-talk", "text": " and  play each other Wednesday night, Bryant's final game in Cleveland.Their matchup over the years has been one of cross-conference shadow boxing; injury and circumstance have prevented them from having an epic playoff showdown. One or the other played in every NBA Finals from 2007 to 2015, but never against each other.There is another piece of history the two share, one mostly hidden until now. According to multiple sources with direct knowledge of the event, the Lakers once contacted the Cavs to investigate whether Cleveland would make James available in a possible Bryant trade.In the summer of 2007, Bryant was 28 years old and coming off a season in which he averaged 32 points per game and shot 46 percent from the field. He had three rings and would win his first Most Valuable Player award the following season.Bryant was under contract for two more seasons, but he was frustrated with the Lakers after three consecutive subpar seasons following the Shaquille O'Neal trade.\"At that time, the Lakers had to do something. I was just losing faith in what they were trying to do. It was like I was a meal ticket,\" Bryant told ESPN's Baxter Holmes this week. \"You come out and score 40, 50 points, fill the seats, we're going to keep the payroll at a minimum, generate revenue. It's like, look, listen, I am not with that, dude. I have to win without Shaq. I've got to do it. We've got to do something.\"Bryant famously agitated for change, and as the rhetoric reached a fever pitch in the media, some kind of blockbuster trade seemed almost likely.James was 22 years old at that time. He'd just led a team with limited talent to the Finals before losing to the Spurs. He'd averaged 25 points, 8 rebounds and 8 assists during the Cavs' playoff run, including a 48-point game in Detroit in the conference finals when he scored 29 of his team's final 30 points. He'd win his first MVP award two years later. James was under contract for three more seasons, determined to be better the next time he made the Finals.This was the moment in time. One was the best player in the league, and one was the next-best player in the league. If Bryant was ever going to be traded, it would have to be for a player of James' caliber.According to multiple sources, as the Lakers went through their options, a call was placed to the Cavs. The intent of the call, sources said, was clear: Would the Cavs make James available in a potential deal for Bryant?Those who worked in Cleveland's front office remember it for one reason: It was the only time a team ever called to make an offer for James. He was considered the ultimate untouchable. Frankly, until that time, so was Bryant.Even in 2003, when the Cavs won the draft lottery, the team's front office figured it would get a \"Godfather\" offer or two to give up the No. 1 pick they planned to use on James. But the phone never rang.\"I believe it,\" James told ESPN.com's Dave McMenamin this week about the 2007 offer. \"If you give up one big fish, you got to get a big fish, too.\"The Cavs said that James, indeed, was untouchable, sources said. Then they attempted to make the Lakers a different offer for Bryant, offering anyone else on their team in a package for him. The Lakers had no interest.Lakers general manager Mitch Kupchak declined comment on the matter this week.For Bryant, who had a no-trade clause in his contract, the answer was simple.\"I never would've approved it. Never. The trade to go to Cleveland? Never,\" Bryant told Holmes. \"That wasn't one of the teams that was on my list. It was Chicago, San Antonio [or] Phoenix.\"The Lakers attempted to find a deal with the Bulls and neared completion that summer, but it ultimately was voided when Bryant didn't approve of  being included.So Kupchak had to go off of Bryant's list and look elsewhere, which is likely what led him to a due diligence call to the Cavs just to see if they'd be willing to consider a swap for James. Though a deal was always a long shot, Kupchak wouldn't have been doing his job if he didn't check.Eventually, Kupchak and  general manager Joe Dumars agreed to terms on a possible trade. It was believed to have included  and Richard Hamilton, among other pieces. Late team owner Dr. Jerry Buss presented that deal to Bryant, who rejected it because the Pistons were not on his list either.That meeting started a thaw between the sides. Patience prevailed, and the following season the Lakers traded for  and started a run of three straight Finals appearances, two of which the Lakers won. The Cavs also made a series of trades, won 60 games in 2008-09 and 2009-10, but they didn't return to the Finals at a time when James could have faced off against Bryant.Barring a shocking Lakers run in the second half, Bryant will retire never having faced James in the postseason, leaving only two regular-season games -- Wednesday, and another in March -- as the final chapters in a rivalry built largely on asking, \"What if?\""},
{"url": "http://espn.go.com/sportsnation/story/_/id/14734617/ranking-every-air-jordan-sneaker-1-xx9", "text": "On Feb. 12, Jordan Brand will release the Air Jordan XXX, the 30th signature model in the Air Jordan line. The first Air Jordan came out more than 30 years ago and its legacy endures to this day. But which Jordan sneaker is the best of the best? To help with that, we brought in an expert: Chad Jones, aka \"Sneaker Galactus.\" Jones has a collection of more than 1,000 pairs of sneakers, has been featured in the BATA Shoe Museum, and had part of his collection exhibited in Brooklyn during 2015's NBA All-Star Weekend.Now, on to the rankings. If you disagree, you can rank them yourself .Still haven't gotten your fill of sneakers? Check out \"Friedman's Shoes\", an ESPN Films short about the shoe store all the NBA players loved, on the 6 p.m. ET SportsCenter on Friday, February 12 or online !: The saddest thing about this shoe is realizing Mike might've actually worn these on court if he'd played one more season with the Bulls. And going out in these would've been worse than going out in a Wizards jersey.: Not even design cues taken from the X-15 fighter jet and woven Kevlar materials can save this shoe.: Two different sleeves, three different midsoles. Plain and simple, this shoe was just too complicated. As our friends at \"His & Hers\" would say, it's doin' too much.: At least Jordan Brand made the decision to go back to numbered models after this. That's about the only good thing to come of this.: Something about this shoe -- and I can't pinpoint whether it's the mesh shroud, the thick heel strap or the oversized outsole on the heel -- always made it feel more like a boot to me. Also, the no-laces thing was weird.: This shoe might not have been the most aesthetically pleasing pair of Jordans, but was a decent pair of basketball kicks. Super supportive and very comfortable. Made you feel confidently locked down. Box design was also unique and pretty cool.: There's a hole in the side of the sneaker. Need I say more?: Dwyane Wade was NBA top-five in points and rebounds wearing this shoe. Also MVP of the ASG. Nuff said. Give this shoe a few years and I think this shoe will be a classic.: I always thought this looked like an Air Jordan 2 that had a different shoe zippered to the back and bottom of it. And I was never a fan of the titanium midplate.: Best thing I can remember about the shoe was the commercial. Merp. :-|: The first Jordans that were numbered by year, rather than sequence, were a departure from the line in more ways than one. The split heel was a daring piece of shoe tech that never quite caught on.: UNC won the national championship with some of the team rocking a player exclusive colorway of this shoe. Danny Green of the Spurs was a member of that team. Been following his career since his high school days at St. Mary's of Manhasset, New York, which happens to be my alma mater.: These were MJ's last on-court edition of Jordans, and they look like a combination of ideas that came before (the cover on the 15s) and after (the seamless suede of the XX1s). The racing-inspired tread outsole was a strange look too.: Air Jordan race car driving shoe inspired basketball kicks? How cool is that!: All anyone ever remembers about these is they cost $200 (which was a high price point at the time) and came in a metal briefcase. There was also a CD-ROM included, which was high-tech at the time, but seems silly now: Who didn't want the Jordan briefcase? Oh and MJ actually playing in them was cool too.: These eschewed the drop-in heels of the XX1 for full interchangeable insoles. That made for a nice fit, but from a looks perspective, these always reminded me of a Team Jordan shoe more than a flagship model.: Didn't Dwyane Wade win an NBA championship in this shoe? #neverforget: If we were judging these solely on the shroud-less SE version, I'd imagine they'd be a few spots higher (especially as a performance sneaker). But the shroud wasn't really a consumer-friendly look.: Who wouldn't want a Jordan Flightposite?: These are really comfortable and the leather models (unlike the suede pictured here) tend to look pretty good as well. But the whole drop-in interchangeable heel thing never really caught on.: I really wanted a Bentley Continental GT coupe. I guess this was the next best thing.: The Jordan that introduced laser-etching to the line looks really nice, but for me that ankle-strap is a deal breaker. It gives the shoe a weird silhouette and I've never liked how it fits.: This is a shoe that I would have loved to see MJ play in. The XX looked great on court. My most memorable visions were of Ray Allen playing for the Sonics while wearing these as a Team Jordan member.: Unlike the full shroud on the XX8, the cover on the 16s was removable, and they looked a lot better as an on-court shoe without them.: The shroud or gaiter was different, but not in a good way. Best part about the shoe was all the exclusives made for players: These definitely suffer in comparison to the 9s that came before and, on a larger scale, the 11s that came after. Much like MJ in the 45 jersey suffers in comparison to MJ rocking the 23.: 55 at The Mecca after coming back from retirement? Had to have a pair!: There tends to be a love/hate relationship with the bold styling of these, particularly when it comes to the oversized logo. But there's no denying that this is one of the most comfortable on-foot Jordans ever.: The possibilities on a shoe like this are endless. I can only imagine what Jordan Brand will be able to do with this shoe's upper in the future. The exclusives were awesome. The public got only a small taste with the \"Photo Reel\" version.: These tend to get a bad rap among sneakerheads, partly because Michael didn't wear them that long and partly because they look so different from what came before and after. But they're a very solid on-foot sneaker with a clean look.: The direction this shoe went from its predecessor was the right direction. It was unique without the swoosh and produced in Italy to provide a luxurious feel to it.: The double straps always felt out of place on a pair of Jordans -- like they belonged on a pair of Charles Barkley's sneakers. Ironic, then, that these were the kicks MJ wore when he beat Barkley in the '93 Finals.: I absolutely loved the commercials for the Air Jordan VIII. MJ teaming up with Bugs Bunny = win every time.: The Ferrari-inspired styling on this shoe had the benefit of looking really good on MJ -- especially as he was crossing up (or pushing off of) Bryon Russell. It didn't look quite as good on everyone else, but few buyers cared.: MJ rocked these on his way to winning a sixth NBA championship in the Finals. C'mon, didn't you practice doing the same thing to Bryon Russell at the end of a game?: The 23rd edition of the Air Jordan had to bring something special to the table, and this shoe certainly did that. While it may not have hit the mark 100 percent, it was good enough to not feel like a disappointment to MJ's jersey number.: First environmentally considered design and IMO the best design post-Jordan's playing days with the Bulls. I could easily see MJ playing in this shoe.: This shoe deserves a lot of credit for proving the line could be viable even if Michael wasn't playing basketball. Plus, you have to admit, it looked pretty good as a baseball cleat.: Some of the best player-exclusive colorways were made for other players. Why? MJ wasn't wearing them. By the way, who is Johnny Kilroy?: These could easily get lost when compared to the shoe that came before and after, but the striking tongue design really helps this model stand out. Plus, it was the first shoe MJ wore while winning a ring.: MJ wins his first championship and Finals MVP in style. The tongue, heel tab and toe were unlike anything seen before .: It's not often a pair of Jordans -- particularly one worn during MJ's run with the Bulls -- gets elevated by someone other than MJ, but that's the case with these, thanks to what was essentially a commercial starring Denzel Washington slid deftly into the movie \"He Got Game.\": Holograms and design inspiration from a Panther? Yeah I'll take two pairs!: These were the shoes on Michael's feet when he played with the Dream Team in the 1992 Olympics. That itself would be worthy of a high ranking, but they also look and feel really good.: Design hints taken from the Huarache line made this shoe a love-it-or-hate-it model. MJ was featured on the Team USA Dream Team that literally destroyed every other country's team in the 1992 Olympics. Also you had to love the Hare Jordan!: As a kid growing up, I remember these more for Will Smith wearing them on \"The Fresh Prince of Bel-Air\" than for Michael wearing them on the court. Either way, they looked damn good.: Clear rubber soles, reflective tongues and inspiration taken from the WW II P-51 Mustang fighter made this shoe a cut above the rest.: The sneaker that took the Jordan line from a Nike product to its own brand has held up remarkably well through the years, thanks in large part to its association with Michael's epic \"Flu Game.\": The Japanese flag inspiration and remarkable durability made this shoe a favorite. And who can forget the \"Flu Game,\" arguably one of the most dramatic moments in NBA Finals history?: \"Do the Right Thing\" featured this shoe on the character of Buggin Out. I felt for him when his brand-new Air Jordans got stepped on. It was a sign of the times and tensions going on in Brooklyn at the time. I can still hear \"Fight the Power\" every time I look at this shoe.: There's a reason this is the retro edition Nike puts out every year at Christmas. This is the shoe everyone wants on their feet, and it's been that way since the moment Boyz II Men rocked them at the 1996 Grammys.: I don't think there was a more appealing pair of sneakers ever made than the Concord XI. It was super stylish and supportive. It also helped that the best player in the world grabbed another ring after coming back from retirement."},
{"url": "http://espn.go.com/nba/story/_/id/14744714/how-2015-point-guard-trades-went-down", "text": "It was one of the craziest few hours in recent NBA history. In the moments leading up to last year's trading deadline, a flurry of frontline point guards rapidly switched teams in a dizzying array of deals.Though other point guards were dealt in separate moves, the day was defined by what essentially was a five-team swap of interconnected moves:  went from Phoenix to Miami;  went from Milwaukee to Phoenix;  went from Philadelphia to Milwaukee; and  went from Phoenix to Boston.Nearly a year after this giant trade, the results have been mixed. Most of the teams involved aren't better, some are waiting on draft picks coming later to define the success and only the Celtics really can claim victory.Thomas has been the smash hit of the great point guard swap; he's about to play in his first All-Star Game. Tuesday is an interesting time to ponder the fallout from it all since Thomas' Celtics play the Carter-Williams' Bucks, who have struggled this year as Carter-Williams hasn't made the impact that the Bucks had planned.Knight got a $70 million deal and Dragic got $85 million, making them winners for sure, but their teams haven't really gotten the production they were seeking.As time has passed, the thinking and motivation of each team has become clear and allows for a more reasoned judging of just what the heck happened.The genesis of the huge deal hinged on two moments. The first was a decision by the Bucks, who were facing both Knight and  heading to free agency. The team decided it wasn't prudent long term to pay both the huge contracts they would likely demand. They preferred to pay one of them and use the leftover cap space to chase a big man. So they began looking at options several weeks before the deadline.Coach Jason Kidd had a target in mind as a replacement, former NBA Rookie of the Year Carter-Williams. Both are represented by the same agency, Excel Sports. Another factor was that Carter-Williams, who Kidd felt he could mold and improve his shaky shooting, was under contract for two more seasons at a total of $5.5 million.\"When we made the decision to trade Brandon, it gave us the opportunity to not only look at [Carter-Williams] but also flexibility going into the summer,\" Kidd said earlier this season. \"At that point, we had to figure out which one we could move and had the opportunity to get something in return.\"The problem was, when the Bucks probed, the 76ers weren't interested in doing a deal straight up for Knight, sources said.A stalemate ensued. It only broke when the second important event happened, which was Dragic publicly demanding a trade away from the Suns just a few days before the deadline. The Suns, fearing they would lose Dragic for nothing in free agency, became motivated to deal.That engaged the 76ers, who were highly interested in the ' future first-round pick the Suns owned. It was top-five protected last year and top-three protected this year. The 76ers' front office believed the Lakers were going to have a several-year rebuild and that pick would retain value.Over the 24 hours leading up to the deadline, many various pitches where thrown Philadelphia's way, but it only had eyes for the Lakers' pick. The Bucks only had eyes for Carter-Williams. That made the Suns the crux of the deal.\"When Goran said he wanted to be traded, that kind of started it,\" said Jeff Hornacek, the Suns coach at the time. \"So the decision was made that we should try to get Brandon.\"The Suns shopped Dragic hard in the hours leading up to the deadline, but only a few teams were interested, concerned about re-signing him in the summer. A few hours before the deadline, they agreed to send Dragic to Miami, essentially for two future first-round picks and a bunch of players they didn't intend to keep. With those Heat picks in hand, the Suns became more open to send the Lakers pick they owned.That got the 76ers willing to part with Williams, and the three parties agreed to the trade with less than an hour to go before the 3 p.m. deadline.But the Suns had an issue: The problem of playing time that upset Dragic sharing the job and the ball with Thomas would have remained with Knight. So the Suns quickly looked to see what their options were.\"The thinking was, well, do we finish the season out with Isaiah, who is a great player? But really, he wanted to start, also,\" Hornacek said. \"So do you start the 6-foot guy () and a 5-7 guy in the lineup? It would be awfully tough.\"Just minutes before the deadline, the Suns called Boston and expressed interest in sending Thomas there for one of the numerous future first-round picks Boston owned.\"I got a call from [Celtics GM] Danny [Ainge], probably 10 minutes before the deadline, and he said, 'It doesn't look like we're going to do anything,'\" Celtics coach Brad Stevens said. \"I got a call eight minutes later that said, 'We've talked about [trading for Isaiah] real briefly, but what do you think?' It was, obviously, a unique, quick, last-minute thing.\"The Celtics offered the Cavaliers' 2016 first-round pick, arguably the least valuable future first-round pick they owned. The Suns, pressed for time without better options, agreed. Though some minor other pieces were involved, they had turned Dragic, Thomas and the Lakers' pick into three future first-round picks and Knight.How did it all work out?Knight only played 11 games after the trade because of a severe ankle injury. The Suns were 29-25 at the time of the deal but went 10-18 down the stretch and missed the playoffs. Knight is averaging nearly 20 points and five assists per game after re-signing in the offseason, but the Suns failed to land  in free agency after signing  to a deal in trying to attract Aldridge. The Suns have been one of the most disappointing teams this season, and Hornacek was fired two weeks ago.Carter-Williams averaged 14 points and six assists and shot 43 percent with the Bucks after the deal. But after going 30-23 with Knight as their starter and best 3-point shooter, the Bucks went 11-18 after the deal. They made the playoffs -- a significant accomplishment after having the league's worst record the season before -- and were eliminated in the first round.Over the summer, Middleton agreed to a $70 million deal, and the Bucks used their extra cap space to sign center . Carter-Williams has been in and out of the starting lineup this season and is averaging a career-low 11.5 points and a career-low 5.1 assists, though his shooting numbers have improved. The Bucks have been one of the most disappointing teams in the league.The Heat went 15-15 after trading for Dragic, better than the 23-30 they were before. But their season was derailed immediately after the trade when  was lost for the season with a blood clot in his lung. Dragic is averaging just 12.2 points -- his lowest in four seasons -- for Miami this season, as he has had to share the ball with . But the Heat have rebounded and are currently in playoff position.The 76ers made a separate trade to acquire  to replace Carter-Williams last season. They were 12-41 at the time of the deal and finished the year 6-23, as Canaan averaged 12.6 points and 3.1 assists. He was the primary starter this season as they started 1-30. But the 76ers have improved dramatically since trading for  and implementing offensive changes under new assistant coach Mike D'Antoni. Current models give them a  of getting the Lakers' pick this year.The Celtics were 20-33 before Thomas arrived last season. His offensive infusion helped them to a 20-9 finish and get into the playoffs, as he averaged 19 points off the bench. He is averaging career highs in points and assists as a starter this season, earning him a selection as an All-Star reserve.Under a team-friendly contract that will pay Thomas' $6.2 million next season, the Celtics will be able to retain him while having cap space to improve the team this summer. The pick they gave up for him currently is projected to be the 28th in the June draft.\"The trade definitely turned my career around,\" Thomas said in January before he faced his former team. \"It hurt at first, because I've never been traded, never been in that situation. But it's a better situation for myself here. I'm loved it here and people like what I do, and I appreciate that.\""},
{"url": "http://espn.go.com/nba/story/_/id/14743788/who-nba-players-found-suddenly-relevant", "text": "Luke Walton was just a number -- injured salary cap fodder the Los Angeles Lakers sent to the Cleveland Cavaliers in 2012 to snag Ramon Sessions. Walton had logged just 65 minutes that season in L.A., and back injuries had sidelined him for most of the two prior seasons.He was done.Then out of nowhere, he found magic on the Cavaliers' second unit with Shaun Livingston, another broken body Cleveland scooped up after Washington waived him. In practices, they discovered such potent give-and-go synergy that Byron Scott, the coach of those sad-sack post-LeBron Cavs, started calling plays for them.\"I have such fond memories of that time,\" said Walton, who now coaches Livingston and Marreese Speights -- another member of that Cavs bench mob -- in Golden State. \"It was a great way to end my career after all the back injuries. We all still laugh about it. The game was fun again.\"And thus was born the Luke Walton All-Stars, our annual roster of journeymen and role players thriving in unexpected ways. One or two players have bristled at earning Walton status, but it is meant to be an honor. Not everyone can be a star. A Walton is a shape-shifter who tailors his game to fit the context of a particular team, and revels in the grunt work. He makes everyone's life easier.\"When someone first sent me the column, I assumed it was an insult: Why would there be a Luke Walton All-Stars?\" Walton remembered. \"But when it was explained to me, I liked it. I took pride in being a glue guy. I love this game. I feel like when it's played a certain way, it can be fun for everyone, and teams have more success.\"With those wise words from our captain emeritus, here are the fifth annual Luke Walton All-Stars. When Pat Delaney, a Hornets assistant, walked into the team's practice gym on Sunday after a grueling back-to-back, he was surprised to see Williams dripping with sweat. Williams explained he had run on the treadmill, and drained 100 free throws.\"If there's one negative about Marvin,\" said Hornets head coach Steve Clifford, \"it's that you have to tell him, 'Don't do anything tomorrow. Just rest.' That is literally the worst thing I can say about him.\"Williams improvised when Charlotte transformed him into a stretch power forward last season, but when it was over, he vowed to become more dynamic in that role -- to do more than drop wide-open 3-pointers. He and Delaney spent the summer speeding up Williams' shot, and once that was done, honing a floater Williams could use after pump-faking defenders who would rush to close out on him.They had a motto: \"Everything at game speed.\" No jogs or walk-throughs. They would go all out on every rep, until Williams was exhausted. It was the only way to master a tricky in-between shot. Williams was game for all of it. He always is. Every team that has Williams ends up loving him.He learned a new position, and happily slides back to his old one when Charlotte plays him at small forward alongside Frank Kaminsky and Spencer Hawes. When Michael Kidd-Gilchrist was out, Williams often guarded the top enemy wing scorer -- Carmelo Anthony, Kevin Durant and others. \"It's never, 'Woe is me,'\" Delaney said. \"It's always, 'Yessir.' There aren't many guys like that in the league.\"Williams has hit 38 percent from deep, and he's shooting nearly that well on longer 3s outside the corners. He can spot up around Kemba Walker and Nicolas Batum pick-and-rolls, or set the screens himself. If defenses drop away from Williams, they concede open pop 3s:Defenses that show him more respect by hedging hard make it easier for Walker to turn the corner:With that floater in the bag, Williams can keep Charlotte's drive-and-kick attack humming when a defender snuffs his 3-pointer:Hesitation from a role player is death in the NBA. It costs the offense whatever advantage it has built up, and gives a scrambled defense the chance to settle itself. It's not enough to be a stretch power forward anymore. You have to be a playmaking 4. Williams has made that transition, and developed a nice screening chemistry with Batum.Smart teams will switch those kinds of actions, just as Williams, Batum and Kidd-Gilchrist toggle between assignments on defense. Williams' offseason training has brought unexpected dividends on that end, too: He's in better shape, with more bounce, and he has morphed into a shockingly good rim protector. Williams is swatting almost 1.5 shots per game, by far a career high, and he's an alert help defender who relishes airborne contact.\"He didn't make those kinds of plays for us last year,\" Delaney said. Opponents are shooting just 43.8 percent at the rim when Williams is nearby, a stingier number than most shot-blocking centers yield. To a man, the Hornets say Williams is their loudest talker -- their organizing force on both ends of the floor, yelling out coverages and opponent plays.Charlotte's decision to ink Williams to a two-year, $14 million deal turned out to be a great move, and if Williams finishes this season strong, he should get a raise. For most teams, there are segments of every game that are just about surviving -- scrounging for points until the star is ready to come back in, and manufacturing stops when mismatches shove you onto your heels. It's the NBA equivalent of plugging holes in a leaky dam.Turner has done that as Boston's de facto backup point guard, keeping the offense afloat while Isaiah Thomas, the Celtics' only other reliable source of dribble penetration, takes his breathers.  That is a demotion after Turner started most of last season, but if he's disappointed to be a backup, he hasn't shown it.\"We never heard one word,\" Boston coach Brad Stevens said. \"He just wants to help the team. That's the most underrated thing about him: He loves basketball. He talks about it all the time. He watches high school games. Everyone likes basketball, but he lives and breathes it, and you never lose sleep over a guy like that.\"Turner bricks a lot of pull-up jumpers, but he's slithering to the rim more often, and he can create a decent shot from scratch when the shot clock winds down. He's a good passer, though a bit turnover prone when he gets too cute threading no-chance fancy passes through tight quarters.He loves to mosey around a pick, \"snake\" back in the other direction, and rise for a jumper -- or pull the ball out and exploit a bigger defender if the opponent switches. Turner has canned a tidy 44 percent of his long 2-point jumpers, a career best.Turner has allowed Boston to ease Avery Bradley and Marcus Smart into more ballhandling duties without overextending them. Thomas can spot up for 3s, a less taxing job, when the Celtics pair him with Turner.Turner has nearly abandoned the 3-pointer, and defenses ignore him when he doesn't have the ball. Boston schemes around that by pairing Turner with its spaciest big man combination -- Kelly Olynyk and Jonas Jerebko -- and inverting the floor for Turner bully-ball post-ups.Turner settles for too many tough baseline turnarounds, but he can score over smaller defenders, and if opponents send help, he picks out open cutters.Turner has worked his butt off to become a solid defender, and his ability to guard all three perimeter positions -- including big wings like Anthony -- gives Boston a handy versatility. The Celtics can hide Thomas in the most convenient spot, and everyone else can find their most comfortable matchup; Turner eats the leftovers. In transition, players can pick up the closest opponent without fretting about matchups.Being pretty good at lots of skills is a skill in itself. It makes you a chameleon. When key players get hurt, teams don't have ready-made replacements who can mimic what those players do. You need guys who can fake it just enough, and Turner can fake it in lots of roles. Speaking of malleability as a skill: Part of Thomas' value is that he can defend wings and power forwards, so that Anthony can rest on the least threatening opposing player. Against Golden State, Thomas spent time on both Klay Thompson and Draymond Green. Against Toronto, he flipped between DeMar DeRozan and Patrick Patterson.When Melo wanted to catch his breath against P.J. Tucker, Thomas chased Mirza Teletovic around the perimeter. He's alert tracking both his man and the ball, he slides his feet well, and he studies opposing personnel; Thomas pays extra attention to snipers, and drifts away from bricky outside shooters.He'll gamble for steals now and then, and he provides zippo rim protection; Thomas has blocked just seven shots all season. But he has been solid, and shockingly competent on offense. When Phil Jackson  upon acquiring him in the Iman Shumpert/J.R. Smith dump, I almost short-circuited my laptop with a spit take. Was Phil delusional?Welp, Thomas is 37-of-88 from deep after making just seven 3-pointers  over his first four seasons, and he's even launching contested 3s from the corner -- a key spot in the triangle. Defenders are actually starting to run out at Thomas, and when they do, he bolts by them for wackadoo floaters and midrangers:Those blow-bys come easier when the Knicks pair Thomas and Anthony at the forward spots; opponents usually hide their power forward on Thomas so that they can keep their best wing defender on Anthony, and that gives Thomas a big speed advantage. He can fill any station in the triangle, and he's a willing passer. Before he signed a nice long-term deal in Portland, it seemed like Davis was doomed to wander the NBA landscape, shoot 60 percent, pluck offensive rebounds, provide some rim protection, be \"too skinny,\" and wait for someone to figure out he was pretty damn good.Oh, hey: Davis is shooting 61 percent, and he's third in the whole stinking league in offensive rebounding rate, behind only Andre Drummond and Enes Kanter's mustache. He screens for Damian Lillard and C.J. McCollum, waits for his man to help on their drives, and jets into the void to tip in their missed bunnies.About 31 percent of his scoring chances come via putbacks, the highest such share among all players, per Synergy Sports. He skirts around slower big men who box him out, or just reaches a long arm over their heads to flick at the ball. He's a dangerous, gliding finisher on the pick-and-roll.He's a mooch, basically, in part because he can't shoot. The Blazers have minimized that weakness by pairing Davis with Meyers Leonard, who chills around the 3-point arc, and Davis in turn has streamlined Leonard's addled thought process on defense. Blazers coach Terry Stotts started the season with Davis defending centers and Leonard on power forwards -- an intuitive division of labor. But Leonard struggles to keep up in open space, and about a month ago, Stotts flip-flopped assignments, thinking it might be simpler for Leonard to bang with low-post brutes.Davis embraced the adjustment, even though he has to chase shooters who operate way outside his comfort zone. That required rewiring his brain to override his big man instincts, and Davis will sometimes catch himself straying from gunners to patrol the rim. \"He's getting better at it,\" Stotts says. \"And it has made things easier for Meyers. The more you are around Ed, the more you appreciate him.\"When he guards centers, Davis looks comfortable in Portland's conservative drop-back scheme; the happy feet that plagued him elsewhere have calmed. He's bothering post behemoths with fronts and other long-armed tactics, and generally playing the best defense of his career. When Temple is averaging 26 minutes per game, it's a bad sign for your team, and if he plays that much in the postseason, the Wiz -- should they even get there -- will be toast. But Temple has held steady in a bigger role than anyone anticipated, and he provides John Wall at least one running mate who can keep up; nearly one-third of Temple's scoring chances have come in transition, the largest such share among all rotation players, per Synergy Sports research.And those aren't all Wall-generated triples, either. Temple jets to the rim against backpedaling defenders, and has some nifty finishes in his arsenal:Temple is shooting just 32 percent from deep, and isn't much of an off-the-bounce threat. Opponents stash their weakest defender on him, and ignore him away from the ball:But 32 percent on a lot of attempts is better than nothing, and Temple manufactured a bunch of 20-point games when the Wizards badly needed someone other than Wall to put the ball into the basket.Temple is a physical, smart defender who checks all three perimeter positions, and the Wiz have used him against everyone from James Harden to Steph Curry -- sparing the overburdened Wall some heavy lifting on defense. We've  about Dallas' screen-setting, rebound-munching, bounce-passing baritone cinder block -- a consolation prize many within the Mavs credit for saving their season. During the heights of Zaza mania, Pachulia would smile, roll his eyes, and wonder whether anyone had ever watched him with the Bucks and Hawks.He wasn't wrong. \"I hadn't seen him play much,\" Dirk Nowitzki said, laughing. \"I don't watch a lot of East Coast ball, and he was out there in Milwaukee and Atlanta.\" Pachulia even sent Nowitzki a YouTube montage of his drives after Nowitzki was stunned to see him swoop to the rim in practice.Playing in Milwaukee for Jason Kidd, an ex-Mav, eased Pachulia's transition, since Kidd incorporated a lot of Dallas principles into his offense -- including using Pachulia as a facilitator at the elbows. \"Kidd just stole our offense,\" Nowitzki said. Pachulia is a serious sort who will snap at someone for missing a box out, but he can also hold his own in Dallas' ballbusting culture. The Mavs want him back, but the price will be high. Smith has drilled 54 percent of his midrange jumpers, the third-best mark in the league among players who have tried at least 50 such shots -- behind only Kyrie Irving and Mo Williams. When you scorch the pick-and-pop at a Nowitzkian level, you can jack as many long 2-pointers as you'd like.After lazing through a lost season in New York, Smith is trying again on defense. Guess what? Effort helps. Smith has learned \"verticality,\" and he's meeting drivers at the rim with some oomph.Opponents are shooting just 47 percent at the cup when Smith is nearby, per SportVU data. The mismatched Magic have cycled Smith through a bunch of frontcourt partners, including the mothballed Andrew Nicholson, and they've tried him lately in crunch time with Nikola Vucevic. He's also a laughably bad rebounder. But Orlando has found a rotation player, and Smith has outplayed the departed Kyle O'Quinn. We know Dudley checks off the \"3\" and \"D\" parts of being a modern small-ball power forward, but he doesn't get enough credit for his playmaking. He is proof that high-IQ, decisiveness and killer vision can get you almost as far as hops and speed.Dudley  holds the ball in place. When he catches it, he goes right into his next move with such immediacy that the catch and move blur into one smooth motion. He does not give a compromised defense even a moment to reset itself. He knows where his teammates are, and where they will be, and he can make the next pass in the chain almost without thinking.He enjoys keeping the offense moving so much that he sometimes passes up open 3s. Fire away, buddy. Dudley is shooting 46 percent from deep, and holy hell, would it be nice to see the Wall-Bradley Beal-Otto Porter-Dudley-Marcin Gortat lineup get some more extended run. Boogie's li'l buddy being available for less than $3 million per season represents a collective failure for the league -- and a rare savvy move for the perpetually dysfunctional Kings. Casspi has hit 42 percent from deep after cracking the 40 percent barrier last season, and he delights in the challenge of insane, ultra-long chucks; .He can space the floor around pick-and-rolls and DeMarcus Cousins post-ups, and when opponents chase him off the line, he busts out a glorious herky-jerky floater game -- complete with a Eurostep to fool help defenders.That ain't easy. Skill development is a block-by-block process, and the Eurostep is the last block for lots of spot-up players -- including Williams in Charlotte, according to the Hornets' coaches.Casspi makes the right pass, and he has a knack for cutting into open seams. He defends hard, and sprints back in transition. That makes him a unicorn in Sacramento. Casspi probably fits best as a small-ball power forward, but the Kings have been much better with him on the court this season in all sorts of lineups. An oasis of lunch-pail professionalism at the carnival. Bass just plays hard, mostly as an undersized center, and he's dishing assists at a career-best rate in some of Scott's Princeton-style sets. The Lakers have been better with Bass on the floor, and they've been competitive -- for real, like a regular NBA team -- when Bass and Julius Randle play together, per NBA.com tracking.Bass' midrange jumper, once his bread and butter, has fallen off, and he's almost an NBA relic: A big man who can't shoot 3s or protect the rim. But he moves the ball, busts it, and stands as a stabilizing presence in any locker room. The Pacers have outscored opponents by a gargantuan 14 points per 100 possessions when Hill and ex-Walton All-Star Lavoy Allen man the front line, and they're bench partners again now that the Pacers are starting Myles Turner with Ian Mahinmi. (By the way: That starting lineup has the potential to be one of the most exciting in the league.)Hill is an unwanted tweener: a center-ish player who doesn't protect the rim, one of the most important center-ish skills. He's too slow to guard stretchy power forwards, and he doesn't have the range to play that role on offense alongside a rim-runner like Mahimi; Indy has played them just 74 minutes together, and the offense has cratered. Allen is a similar player with a bit more punch at the basket, and together, he and Hill have enough midrange craft to make it work -- especially against opposing backups.Hill is shooting a robust 51 percent on post-ups with flip shots and jump hooks; he can get buckets when a dead possession is winding down. He and Allen have a natural instinct for offensive rebounding, and when they play together, the Pacers retrieve 32 percent of their own misses -- a mark that would lead the league at the team level. Hill is a minus defender, but at least he's trying after mailing it in with the Lakers last season. When Mike Conley got hurt, Chalmers filled in with some off-the-bounce zip, oodles of free throws and a few ridiculous clutch shots. He's back to manning hodgepodge small-ball bench units now, and those lineups have mostly struggled during Memphis' recent uptick. He hasn't earned much crunch-time run next to Conley, though Dave Joerger tried that look in Monday's overtime loss to the spirited Blazers.Chalmers is a stubborn personality, and he drives coaches batty with two or three boneheaded decisions every game. That turned off several potential suitors, including the Jazz, who could have snared him for nothing in the season's most predictable tax dump.It was jarring to watch Morris jostle for post position and dunk  over Jonas Valanciunas in Earl Watson's first game as the Suns' head coach. Where in the hell was that all season? Morris has cooled since dropping a season-high 30 on the Drakes, but his motor magically shifted into high gear once Phoenix canned Jeff Hornacek.Morris should be embarrassed at the transparency of his switch-flipping.  It's an insult to Hornacek, his teammates and Phoenix fans. Hornacek isn't blameless here. He couldn't mend the team's relationship with Morris, and he clashed with both twins at times. Guess what? We all get paid money to work for bosses we might not like during phases of our careers. Real pros put in their best effort regardless, because they take pride in their job and care about their co-workers.I'd still take a chance on Morris; , provided he can find a better balance between ball-stopping and playmaking. But the past year has been discouraging.I will never give up my quest to eradicate the under-9:00 TV timeout that disrupts the rhythm of every second and fourth quarter.The specter of a stoppage even nags at your brain during blissful stretches of uninterrupted ball. If we get beyond the 7:00 mark without a break, you know a dreaded rapid-fire double-timeout is coming: a stoppage at the next opportunity, perhaps around the 6:30 mark, and then another commercial break at the first whistle below the 6:00 barrier.This honestly bothers me more than Hack-a-Shaq. I might have a problem.This looks like a standard Boston set, but there is something funny about the timing.It's Bradley, and the speed with which he pings the rock to Jae Crowder. Most players who take a handoff  like to bounce the ball a couple of times in search of a jumper or a line of attack toward the rim. Bradley doesn't even dribble before passing, and the speed of that decision helps create Crowder's driving score; Crowder's man, Anthony, is still rotating away from Crowder when Bradley passes. Anthony's momentum is going the wrong way, and he has no shot at pivoting back to wall off Crowder.If Bradley hesitates, Anthony could come to a stop, regain his balance, and lunge back toward Crowder with full power.All the overblown hubbub over Whiteside's alleged defensive limitations has masked one of the real and irritating weaknesses in his game: The dude never passes. He has 21 career assists, and just 15 this season. Do you know how hard it is to record so few dimes? Friendly hometown scorers dole out that many fake assists to some guys over a normal month or two.Whiteside could be just the seventh player ever to log at least 2,000 minutes . His role doesn't require elite passing; he's a post scorer with an underrated soft touch, and a dunk machine picking-and-rolling with shooters around him. But on a few possessions every night, the opposing defense will smother those shots, and leave capable shooters open all over the floor. Whiteside ignores those players. He needs to feed them.See how fun hoops can be when you let the fogies rest, Sam Mitchell? Minny is pouring in 108 points per 100 possessions with their new starting duo on the floor, and they've been even better better on both ends when they play with Ricky Rubio instead of Zach LaVine.Dieng and Towns can both guard either frontcourt position, they pass well, and they're skilled enough to experiment with big-big pick-and-rolls -- always a favorite here.Now: Can we please see the Rubio/LaVine/Andrew Wiggins/Nemanja Bjelica/Towns lineup? Do I have to kidnap Crunch the wolf mascot to make this happen?The Twitterati who mocked Parsons as a handsome sunk cost have been pretty, prettaaaaayyyy quiet lately. Parsons has scored at least 19 points in seven of the Mavs' past 11 games, and he has nailed 30-of-59 from deep during that stretch while logging heavy minutes. He is starting to look like his pre-injury self, with a tad less air time.That has freed Rick Carlisle to use Parsons more at power forward -- probably the Mavs' best option when Nowitzki rests.The Knicks are at their best when they veer away from the usual pathways of the triangle, and wrong-foot defenses expecting the same old cuts and screens. Derrick Williams has crammed a preposterous number of alley-oops by jogging toward the elbow for the normal triangle weakside two-man action, and suddenly whirling back toward the hoop.The triangle hovers in the netherworld between scripted and unscripted, and the Knicks create anxiety for defenses when they use counters the triangle naturally burps up. These might be like trick plays in football: overuse them, and they lose the power of surprise. But the Knicks should sprinkle this spice liberally, and they've finished a few games over the past two weeks by scrapping the triangle altogether in favor of a more NBA-standard spread pick-and-roll attack -- a look that may have offended Phil Jackson.The Pelicans might consider making these bad boys their standard uniforms. Their regular unis are nondescript, minus some subtle touches that are hard to see from a distance. These are instantly recognizable as local to New Orleans. They nail the Mardi Gras color scheme, and any team from New Orleans, perhaps the country's most vibrant and gleefully wild city, should amp up the flair factor.There are a lot of \"mouse in the house\" stock phrases to highlight a size mismatch in the post, but I don't think I had heard this one until Marc Zumoff, the Sixers' quippy play-by-play guy, declared that Okafor was taking some mismatched wing player \"down to the weight room.\" I love it. Zumoff is a highlight of Philly broadcasts, with a deep reserve of catchy lines.Jerebko has the multipositional, fill-the-gaps look of a Walton All-Star, but Brad Stevens should probably stop running him out there as a small forward alongside two big men -- even when one of them is Olynyk, a good 3-point shooter. Only two such lineups have logged 20 minutes, and both have been awful on offense, per NBA.com stats tracking.The speed edge Jerebko has at power forward vanishes when Boston shifts him down a position, and his 3-point shooting -- a scorching 43 percent this season -- doesn't have as much of an impact when he's not dragging an opposing big man away from the rim. The lane gets crowded when Jerebko, a canny cutter, slices into the paint."},
{"url": "http://espn.go.com/nba/story/_/id/14753270/nba-james-harden-frustration-inconsistent-houston-rockets-nearing-boiling-point", "text": "The season just isn't the same for .He has his numbers, another All-Star appearance, but it's different. Frustration is a key word when describing Harden's fourth season with the , who take on the  Wednesday night (ESPN, 10:30 ET).\"Yeah, because my first year was different,\" Harden said. \"We weren't as talented and we still made playoffs, which was a big step for us. We have a lot of talent in this locker room, of course, coming off the Western Conference finals and being in the seventh spot right now. It's frustrating, but we still have opportunities.\"Last season Harden was mentioned with  in a two-man race for the MVP award. Curry ended up winning the award, but Harden was the clear winner in a player vote. This season?It seems Curry is the undisputed champ when it comes to the MVP award from the media and most likely from the players. Harden is second in the league in scoring, first in free throw attempts and makes, the leader in minutes played, the leader in assists on corner 3-pointers.\"We're not winning, so those numbers don't mean anything,\" Harden said.Harden's frustration started over the summer when he suffered an ankle injury that delayed his ability to play basketball and get in shape. The previous summer, Harden played with Team USA, so he came into camp in terrific condition. He went on to lead the league in minutes, finished second to Curry in scoring and led the league in free throws.In the postseason, however, Harden tired toward the end and despite a wonderful season, one in which he had finally arrived as one of the league's superstars, his team lost to the  in Game 5 of the Western Conference finals.Harden thought another offensive creator would help him, so GM Daryl Morey obliged him and acquired  in an attempt to take the ballhandling pressure off Harden.It hasn't gone well. Lawson played tentatively early, and Harden shot 22 percent from the field and 10.6 percent from 3-point range in the first three games of the season. Understandably, the Rockets started the season 0-3, losing by an average of 20 points. After 11 games, the Rockets were 4-7, and Morey along with owner Leslie Alexander decided to fire coach Kevin McHale. Rumors surfaced that Harden played a role in the firing but sources told me that wasn't the case.But McHale said he was blindsided by the firing.\"We had a rough camp, a lot of guys were injured,\" McHale said on TNT this week.  couldn't do back-to-back practices and was not going to be able to do back-to-back games until December. James had sprained his ankle in the summer, came in overweight. And we just weren't playing very well. I told our guys at the end of training camp, 'Hey, we're a month, six weeks away from our team kind of gelling and playing well.'\"But then McHale was gone and it left Harden to fix things. He did earn Western Conference Player of the Week honors for the week of Nov. 2-8, and there was a hope things would get better. Harden refused to blame the injury, though. And that cohesion is something the team is still searching for.\"Nah, I was affected by an ankle injury, so that threw me off my natural training late in the summer or whatnot. That's no excuse, just trying to find it, brother.\"With McHale gone, J.B. Bickerstaff took over and asked more of his players, including Harden. To that end, Harden has been the Rockets' power pack. On the season, Harden has scored at least 20 points in 45 games, 30 points 22 times and 40 points seven times. After he shot 39.8 percent from the floor in the first 22 games of the season, he's shot 44.6 percent over the next 31.Harden has also distributed the ball. He's eighth in the league in assists at seven per game, and he's produced 10-plus assists 10 times this season. He's assisted on 50 percent of his team's points at least eight games. When the Rockets used smaller lineups, Harden produced solid rebounding games. He's averaging a career-high 6.3 rebounds a game and 7.3 defensive rebounds per 100 possessions.\"One thing, his turnovers are down dramatically,\" Bickerstaff said. \"If his turnovers are down, then his assists are up. That's one of the things he said he wanted to improve on, and obviously he's done it, the decision-making ... the creativity has been there. It's been outstanding the last month. It's not surprisingly; we knew he could do it.\"But despite all of Harden's efforts, the Rockets remain near the bottom of the playoff seedings and haven't shown an ability to move up. Consequently, deserved or not, Harden and  have received most of the blame for the struggles of a team many thought would be elite.\"I think all of us have been frustrated with how the season has gone,\" Howard said. \"Not just James, all of us are frustrated. We could be better.\"After Wednesday's game at Portland, the Rockets will have just 27 games to solve their issues. To that end, when Bickerstaff demanded more of his players, he was specifically asking for more effort on defense. This is where the Rockets -- and Harden -- at times fall short.It's a major issue, and Harden is at the forefront. He noted the number of minutes he plays and says that makes it difficult for him to play at a high level on both ends. Still, fatigued or not, his ability to get through screens is poor. Harden has a minus-0.4 defensive box plus/minus this season.After some losses, Harden sits at his locker looking at the box score, sometimes in a daze trying to come up with the answers to reporters' questions about what went wrong.Harden says if he had the answers he would provide them. On Saturday, the Rockets lost at home by 17 to Portland.\"Those are games we're supposed to win,\" he said. \"Last year we won [those games], and that's the difference between the seventh and eighth seed and second, third and fourth seed. We still got our opportunities to take advantage of them, but you got to do them.\""},
{"url": "http://espn.go.com/blog/new-york/knicks/post/_/id/64120/will-phil-jackson-expand-his-search-beyond-triangle-candidates", "text": "NEW YORK -- Kurt Rambis did all he could to stop the ' spiral on Tuesday night. But a new voice on the sideline ultimately yielded a familiar result.New York fell behind by double digits early and couldn't complete a late comeback, falling short against Washington in a . It was the first loss for Rambis in his new role as interim head coach and the sixth straight defeat for the Knicks.New York (23-32) has dropped 10 of 11 games and has less than a 0.7 chance of making the postseason, according to the ESPN playoff odds tracker.Still, Rambis hopes to beat the odds.\"We've got to figure out a way to get in the playoffs,\" Rambis said Tuesday. \"It's so valuable for the growth of the team and the growth of the players to be in that sort of intense environment and they've got to experience that.\"Rambis will have every opportunity to lead the Knicks on an improbable run to the postseason. He'll coach the team through the remainder of the season. And if he can can turn things around, don't be surprised if Jackson hires him as the Knicks' next head coach.But if the Knicks continue to struggle under Rambis, Jackson is going to have to find a new voice for the team. That probably means he'll look for a coach willing to run the triangle offense.He revealed as much on Monday when he said finding a coach who runs the triangle is \"not paramount, but it's important.\"He also said: \"Someone has to match the style of the way we do things, and there's a certain style that I have that I think works.\"Most interpreted these comments as further evidence that Jackson is dead-set on hiring another coach with direct ties to him, such as Luke Walton or Brian Shaw.But Jackson hinted in  on Tuesday that he'd be open to considering offenses other than the triangle.The most telling section is the following: \"...there should be a system of play that includes the group. How that is done can include the (triangle) system of basketball, but doesn't exclude other systems that include group play.\"If Jackson is willing to hire a coach who lacks experience running the triangle, his list of potential candidates will expand.Coaches such as Tom Thibodeau, , Jeff Van Gundy, Jeff Hornacek, David Blatt and Scott Brooks are available. None of these coaches are triangle disciples, but they've all had success in the NBA. And each would present an interesting candidacy for the Knicks' opening.Brooks is a name to think about, for one reason: The Knicks have been informed that their chances of landing  this summer would be influenced by hiring Brooks, according to league sources.New York faces long odds to land Durant to begin with. And their chances took a hit after Derek Fisher was fired, league sources say. As  previously, Fisher was going to be a factor in Durant's free agency this summer. But hiring Brooks could get Durant's attention.Of course, it seems unlikely that Jackson would choose a coach based on the idea that Durant might want to play in New York. Also, it's important to note that Jackson has no prior relationship with Brooks and that the ex-Oklahoma City coach doesn't run the triangle offense.Rambis, of course, checks off both of those boxes.That's why, at this point, the Knicks' head coaching gig is his to lose. But if Jackson is willing to look outside of his list of triangle disciples, he'd have a few intriguing options."},
{"url": "http://espn.go.com/nba/insider/story/_/id/14740619/next-phil-jackson-new-york-knicks-firing-coach-derek-fisher-nba", "text": "We're not quite two years into the ' Phil Jackson tenure. His decision Monday to fire hand-picked head coach Derek Fisher makes this a good time to check in on the team's progress.Jackson, who was introduced as president on March 18, 2014, took over a Knicks team that had a .411 winning percentage (27-40) during a disappointing follow-up to their unexpected 54-win campaign the previous year. At 23-31 (.425) after losing nine of the past 10 games, an almost identical record cost Fisher his job.As an executive, Jackson has gotten some things right. But for that to really matter, he will have to improve in one major area."},
{"url": "http://espn.go.com/nba/insider/story/_/id/14746920/the-best-trades-atlanta-hawks-make-al-horford-jeff-teague-kyle-korver-nba", "text": "With the  ,  and  before the trade deadline, our NBA Insiders -- Chad Ford, Kevin Pelton and Bradford Doolittle -- have several potential blockbuster trades in mind.Would Boston make a move for Horford? How about the Clippers? Are  and  in play?Here are the deals."},
{"url": "http://espn.go.com/blog/new-york/brooklyn-nets/post/_/id/23536/source-dont-count-out-knicks-or-nets-for-mike-conleys-services-this-summer", "text": "NEW YORK -- Will  find his way to the Big Apple this summer?The  and  might seem to be in disarray now, but don't count out the possibility that one of those two teams lands Conley in free agency. A source close to Conley believes the  point guard will be more receptive to playing for the Knicks and Nets than most think.Conley, who should be able to command a max contract wherever he goes -- or if he decides to stay in Memphis -- essentially backed that assertion prior to his team's game against the Nets on Wednesday at Barclays Center.When asked if the Knicks' firing of Derek Fisher as coach would impact his thought process, Conley said, \"I don't think it will. At the end of the day, I'll give everybody the same attention, regardless of the situation, and just hear everything out.\"Even so, Conley came into his own under Lionel Hollins, whom the Nets fired Jan. 11 in Memphis.\"It's tough,\" Conley said. \"But at the same time, like I said, I'll give everybody their fair shot. With Lionel being here, obviously, it was a big reason to look [at the Nets]. But still, at the same time, with him gone, I'll give everybody the same look.\"Conley, 28, is averaging 14.8 points and 6.1 assists per game for the Grizzlies (30-22). He is going to have to step up with  out indefinitely due to a broken foot.\"I want to win,\" Conley said when asked about the most important going into free agency. \"That's what I want to do at the end of the day, wherever that may be. So hopefully, when that time comes, I'll have a better vision on what I want and what I want going forward in the summer, but right now, I'm all about winning, and I want to be somewhere that's committed to doing that.\"The Nets got off to a 10-27 start this season before firing Hollins and replacing him on an interim basis with Tony Brown. Part of the reasoning behind Brooklyn's coaching change was that players often clashed with Hollins, whose tough, no-nonsense style did not have the same impact that it had in Memphis.\"I'm not going to say I liked him when we first picked him up,\" Conley said of Hollins. \"He's a very hard coach [to play for]. He definitely gets on each and every person, and I think what our team took away more so than anything was he kept everybody accountable. It didn't matter if you were a star or the last guy on the bench, he treated everybody the same, and that's why he earned the respect from us.\"Like Conley,  improved under Hollins with the Grizzlies, who advanced to the Western Conference finals in 2013 before electing to in another direction at coach.\"It was all his groundwork. It was all his guys just buying into his system,\" Allen said. \"Not only that, he was one of those guys that was tough-nosed and wouldn't mind calling you out in practice. He wouldn't mind getting in my face, Mike's face, Marc's face, Zach [Randolph]'s face, and they can all vouch for that. Guys didn't take it as offensive, guys took it as, ‘You know what, I'm gonna respond and show him,' and that's why we were able to get better each and every day.\"He came here and tried those same tactics, and I don't think those guys [in Brooklyn] bought into that. I don't think they were tough-minded enough to understand where he was coming from. No knock to those guys, but you can't coach like that with everybody because everybody doesn't embrace that the same way, so I thought that's what happened here.\"Allen also see that perspective.\"I know he didn't change, and I know he could rub off on people a certain way because at one point it did [with] me,\" he said. \"But I didn't take it as he was trying to play me. I took it as he was trying to get the best out of me. A lot of players can't take that, a lot of players might shut down, a lot of players might do things or try to act like they aren't happy because of him.\"But in reality, he's a tough-nosed coach, and he stands for something, and he's not going to fall for anything. He didn't re-sign back with Memphis, and that spoke a lot of volumes too. And then the next year, he sat out and got a lucrative deal with the Nets, and it just shows he's a tough-minded guy.\""},
{"url": "http://espn.go.com/los-angeles/nba/story/_/id/14756524/paul-pierce-los-angeles-clippers-says-returns-boston-garden-always-special", "text": "BOSTON --  forward  said Wednesday's game against the  could be his final visit to TD Garden, hinting that he is pondering retirement after the 2015-16 season.\"It could be,\" Pierce, 38, said when asked if the game would be his last in Boston. \"I'm not 100 percent sure, but, like I've been saying the last two years, I'm taking it year by year, but this could possibly be.\"Pierce, now in his 18th season, signed a three-year, $10.5 million contract with the Clippers in July. He is averaging a career-low 5.7 points on 34.3 percent shooting this season, playing 17.6 minutes per game in 47 appearances, including 21 starts.Pierce spent the first 15 years of his career with the Celtics and won NBA title with them in 2008.\"It's always special to step in the Garden,\" Pierce said. \"This is the bulk of my career. You spend 15 years here, make so many memories, win a championship here. It's a special feeling, special fans, special building. I'll always savor the moments when I can step on this court.\"When  forward , Pierce's teammate on Boston's 2008 title team and the player he was traded with to Brooklyn in July 2013, visited TD Garden in December, he was similarly noncommittal when asked if this would be his final season.Pierce said he talks to Garnett often, but even he can't get any hints on Garnett's plans.\"Usually we talk about family,\" Pierce said. \"Kevin's doing good. I always ask him if this it is for him. He's still undecided. But Kevin said he's going to retire the last five years in a row, and he's come back. I don't know what he's planning.\"There was some buzz in Boston that Pierce might have been considering a homecoming this summer before electing to join coach Doc Rivers with the Clippers. Pierce threw some cold water on that notion Wednesday.\"I did run into [Celtics president of basketball operations] Danny [Ainge] this summer, and you know he always welcomes me back with open arms,\" Pierce said. \"But I think, for the most part, my family wanted to be around the other family members -- everybody knows I'm from Los Angeles -- where my kids can just be around their grandmas and uncles and stuff. And also the familiarity of being with Doc, and also to have a chance to play with a team that's a contender. You factor all those things in, and that all went to my decision.\"Pierce said talks never got serious with Boston.\"Not so much,\" Pierce said. \"The Celtics were a rebuilding team, young and up-and-coming. I think my career here ran its course. I had a great career here -- 15 long years. What more could you ask for? And to win a championship here, I've had my time here.\""},
{"url": "http://espn.go.com/blog/boston/celtics/post/_/id/4722034/doc-rivers-on-the-celtics-theyre-not-scared-of-anybody", "text": "BOSTON --  guard  had spent most of the fourth quarter wandering into the trees, so he wasn't about to stop now.The Celtics were down two in the final seconds of the fourth quarter when the  switched 6-foot-11  onto the 5-foot-9 Thomas. Thomas passed the ball to teammate  with the full understanding that it was coming right back.With a bit of momentum charging from above the arc, Thomas used a little stop-and-go move to get inside Jordan. Recognizing the big man's ability to recover with his length, Thomas stepped back outside the paint and, falling away, somehow arced a rainbow over Jordan's outstretched arm and splashed through an overtime-forcing jumper.Fearless.That's the way Thomas operated for much of Wednesday night, but especially in a fourth quarter in which he brilliantly dueled with fellow All-Star point guard . Thomas (36 points, 11 assists) scored six points in the final 56 seconds of the regulation as Boston improbably forced overtime. While the Celtics certainly didn't make it easy on themselves, this scrappy bunch found a way to emerge with a gutsy  over the Clippers, which sends them soaring into the All-Star break.The Celtics have won 10 of their past 12 games while surging to a 32-23 record and sole possession of the third seed in the Eastern Conference. Over the first 55 games of the season, Boston has stood toe-to-toe with some of the league's tallest giants -- taking both the Clippers and  to overtime in Boston -- and have forced the rest of the league to take notice of their potential.\"They could make a run,\" former Celtics and current Clippers coach Doc Rivers said. \"Listen, they're not scared of anybody. They've got a bunch of junkyard dogs who can play. \u0085 You better be ready when you play them or you're going to lose to them.\"The Celtics should have been sulking into the All-Star break, having let possible wins slip away against the Bucks and Clippers. Thomas wouldn't let that happen on Wednesday. Even as every whistle and bounce seemed to go against the Celtics, Thomas and his teammates kept fighting as if they never believed they'd lose.So when Boston committed some head-shaking fouls -- , fresh off an ill-timed foul in Milwaukee 24 hours earlier, committed a pair of fouls that helped Los Angeles score the first six points in overtime and an over-aggressive  inadvertently steamrolled Paul trying to Hack-a-Jordan a short time later -- the Celtics never gave up. Even as two key players fouled out in  and , the Celtics hopped on Turner's back in overtime and pulled away from the incredulous Clippers.Asked if the Celtics can sense that this might be the start of something big, Crowder did not hesitate in responding.\"We see it’s happening,\" he said. \"It was big for us. We want to take this momentum and go to the second half with it. For sure, we didn't want to drop two going into the All-Star break. We just wanted to focus on this one and get this one, so we’re gonna ride this momentum into the second half.\"Could this team look different then in the aftermath of next Thursday's trade deadline? Absolutely. Celtics president of basketball operations Danny Ainge is armed with the assets to make a big-splash move. Maybe it was just the afterglow of a captivating win, but coach Brad Stevens sounded like a man content to see what this team is capable of.\"I trust our front office to make the right recommendations and the right calls to help our team,\" Stevens said. \"I think it would have to be something unique to continue to help our team. I think that we’ve got a lot of future flexibility and we know that and at the same time we got a hard-playing group of guys. We can get better, we have to get better defensively, get back to guarding the way we want to. We have to limit the turnovers and continue to search for good shots when things are going poorly or well. There’s a lot of room to improve with the group that’s in there. My focus will be on that.\"I will respond anytime [the front office] wants to talk about anything that’s going through their minds, but we haven’t had any of those conversations, nothing of substance. I’m sure that will pick up a little bit as the trade deadline gets closer, but I’m not anticipating my phone ringing off the hook.\"You can tell Stevens has an attachment to this team. How could he not with the way it plays? Boston rallied from 19 down in the fourth quarter against Milwaukee on Tuesday and, if not for Bradley's miscue, might have stolen that one. The Celtics had every reason to return home and get steamrolled by one of the best in the West, but they never stopped fighting.Boston has yet to win over its home market, and most fans in these parts are more fascinated by a big moving truck carrying bats and balls to Fort Myers, Florida, than a hoops team looking for anyone to jump on its pretty bare bandwagon.They should have no trouble adding passengers to this hype train after Wednesday's win. Even Rivers is swept up in what they're doing.\"I love these guys. I want them to do well,\" Rivers said. \"Not tonight, but any other time I want them to do well.\"There's an energy in the Celtics' locker room these days, a desire to find out exactly what this team can achieve. This young roster isn't afraid of dreaming big. As they confirmed again on Wednesday, they're fearless.\"We're at a solid area right now,\" Thomas said. \"The scary thing about it is we know we can do better. We need this rest during the All-Star break to get away from each other and enjoy the time off and get back to it when we play Utah next week.\"I'm excited about what's going on here and we have to continue to put our foot on the pedal.\""},
{"url": "http://espn.go.com/nba/story/_/id/14754221/sacramento-kings-coach-george-karl-says-meeting-gm-vlade-divac-positive", "text": "PHILADELPHIA --  coach George Karl said Wednesday he has a positive outlook after meeting with team general manager Vlade Divac amid a losing streak and speculation about his job.Karl said before the Kings-76ers game in Philadelphia that he and Divac are on the same page .\"I've always felt good about Vlade. I don't think Vlade and I have a disconnect other than we want to win more games than we're winning right now,\" Karl said. \"And that's fine with me. Everyone should want to win more games.\"Sacramento is 21-31 -- five games behind Houston for the eighth and final postseason spot in the Western Conference -- and has lost eight of its last 10 games. After the game against Philadelphia, Karl said the team would go home for the All-Star break to \"regroup and recuperate.\"Said Divac in a statement: \"He is our coach and we're collectively working through our issues.\"Karl declined to offer more specifics about their meeting.Kings star  and Karl have struggled to work together. The All-Star center has not hid his emotions or frustrations.Karl says he thinks the team's current funk is temporary.Meanwhile, he says he won't be bothered by the criticism and speculation that comes with losing.\"When you're younger, you're always a little more into what people are saying and what people think of you,\" said the 64-year-old Karl, who's coaching his sixth NBA team after stints in Cleveland, Golden State, Seattle, Milwaukee and Denver.\"As you get older, I think you learn you have no control over that. You can do your job perfectly in this league and if you don't fulfill expectations, you're going to be criticized,\" he said.Last year, Karl became the Kings' third coach in one season. He took over following the 2015 All-Star break, succeeding Tyrone Corbin. Corbin had been promoted from top assistant to replace the fired Michael Malone. Karl coached Sacramento to an 11-19 record for the rest of the season.The Kings, who are currently in 10th place in the Western Conference, haven't made the playoffs in 10 years."},
{"url": "http://espn.go.com/blog/new-york/brooklyn-nets/post/_/id/23544/mikhail-prokhorov-nets-readying-short-list-for-gm-vacancy", "text": "NEW YORK --  owner Mikhail Prokhorov left early Wednesday night.The man had a flight to catch.OK, so he's a powerful multibillionaire with a private jet who could take off for Moscow at a moment's notice, but really, who could blame him?His 14-40 Nets were being routed by the -less  in their final game before the All-Star break, and Prokhorov has a lot more important things on his mind in the big picture -- namely who he's going to hire as general manager to right his team’s sinking ship.Before leaving, Prokhorov told ESPN.com that his search committee's first round of interviews is over, and they are currently in the process of compiling a short list of candidates who could fill the GM vacancy.\"We've finished our first round of homework, now we're onto our second -- the short list,\" Prokhorov said.The Nets conducted interviews from Monday to Wednesday -- and it is believed their list included the following: two-time executive of the year Bryan Colangelo,  assistant GM Arturas Karnisovas,  vice president of basketball operations Gersson Rosas, former  GM Danny Ferry,  assistant GM Sean Marks,  GM Kevin Pritchard, former  GM Chris Grant and Brooklyn assistant GM Frank Zanin.The Nets have spoken to about over a dozen candidates during the process. Thursday will mark exactly a month since they demoted Billy King and reassigned him within the organization.Simply put, the search committee -- which includes Prokhorov, Nets chairman of the board of directors Dmitry Razumov, trusted Russian basketball confidant Sergey Kushchenko, CEO of Brooklyn Sports & Entertainment Brett Yormark and president of ONEXIM Sports & Entertainment Irina Pavlova -- is being very thorough because it needs to get this hire right.Candidates were left under the impression that the search would commence with the new GM taking over before next Thursday's trade deadline, sources told ESPN.com.Prokhorov will attend the opening news conference for the team's new $50-million, Brooklyn-based practice facility next Wednesday.Perhaps his new GM will be in attendance as well."},
{"url": "http://espn.go.com/blog/los-angeles/lakers/post/_/id/42777/lakers-scott-says-dangelo-russell-not-as-mature-as-kyrie-irving-chris-paul-were-as-rookies", "text": "CLEVELAND – After shootaround Wednesday,  coach Byron Scott once again discussed his relationship with rookie point guard , a hot-button issue throughout the season, as Scott has continually criticized the 2015 No. 2 draft pick with backhanded remarks on a near-daily basis.“I haven't been the easiest man on him in the world,” Scott said hours before his Lakers fell to the   at Quicken Loans Arena. “But I always seem to go back to thinking -- after I've been so hard on him on certain occasions -- that he's 19 years old, and he's just a kid playing in a man's world. I know the potential is there. He's just got to keep working at it. I'm going to stay on him because I think he has a chance to be a very good basketball player.”Later Wednesday, Scott further critiqued Russell by saying the former Ohio State standout is not as mature as other top-flight rookie point guards Scott coached, such as  in Cleveland and  in New Orleans.“[Irving] was just a little bit more mature,” Scott said. “At 19, he was a little bit more businesslike at practice and games. D’Angelo still has a playfulness about him. Sometimes in practice he’s joking around and losing a little bit of focus. But he’s 19. I understand that. Chris Paul was probably like 23 years old by the time he came into the league in his mental capacity. But like I said, each point guard, each guy I have, is different.”Scott was then asked if he meant Russell’s “playfulness” was a negative trait.“I didn’t say it was a bad thing, but it is a bad thing at times,” Scott said. “There’s always a time to be serious, and there’s always a time to joke around. So I’m not saying it’s a bad thing -- I’m saying he’s 19. I understand it. I’m not saying it’s bad or good, but Chris Paul wasn’t like that, and Kyrie was a little bit, but not that much. But like I said, again, they’re all different, and I accept that.”Scott reiterated that Russell isn't as developed as Irving at that age.“Kyrie was a lot farther along,” Scott said. “Kyrie, offensively, there was no weaknesses, and I haven’t seen that in a 19-year-old since. And he’s probably the first. He was more prepared from an offensive standpoint than Chris Paul was his rookie year, and I think I said that as well. Kyrie was just so much more advanced -- on the defensive end was a different story -- but offensively, he’s just gifted. Very mature, very smart, so it was a lot easier. This is a totally different situation.\"Each point guard that I’ve had is a totally different situation. D’Angelo is in a situation that is totally different from Kyrie and Chris Paul and Jason Kidd and other guys I’ve had. I treat them according to what they bring to the table. Like I said with D’Angelo, I know he’s going to get there.”"},
{"url": "http://espn.go.com/blog/los-angeles/lakers/post/_/id/42786/dangelo-russell-says-hes-ok-after-getting-hit-in-the-groin-by-lebron-james-pass", "text": "CLEVELAND -- Late in the third quarter of Wednesday’s 120-111  win over the  at Quicken Loans Arena, Cavaliers star  threw a two-handed bullet pass toward a teammate in the right corner, and Lakers rookie point guard  jumped up to deflect it.Video clips of what happened next went viral immediately.James’ pass nailed Russell, the No. 2 overall draft pick in 2015, square in the groin, and the crowd immediately gasped as Russell quickly collapsed, lying face-down on the court, where he remained for a few minutes.Russell’s teammates and the Lakers’ training staff encircled the former Ohio State standout while three replays of the incident were shown on the arena videoboard, each one drawing a pained groan from the fans.“The way the crowd sounded, it seemed pretty obvious that it hit him right in the spot,” Lakers coach Byron Scott said. “I felt for him.”Russell rose to his feet and was helped off the court while several of his teammates couldn’t help but laugh. He later returned to the game and said he was all right.\"It was tough. Every guy knows the feeling,” said Russell, who finished with 15 points on 5-of-11 shooting in 28 minutes. “Laugh about it now and then two months from now, somebody else will have something else to laugh about.”Said Russell’s teammate, , “It was hilarious. It was so funny. Once I knew he was OK, the jokes write themselves. That was a good time.”"},
{"url": "http://espn.go.com/nba/story/_/id/14757529/detroit-pistons-retire-chauncey-billups-no-1-half-vs-denver-nuggets", "text": "AUBURN HIILS, Mich. -- Moments before his jersey went up to the rafters, Chauncey Billups spoke to the crowd about the night the  wrapped up the 2004 NBA title by routing the  in Game 5 of the Finals.\"We had one motivation,\" he said. \"We wanted to win it here at home.\"Billups was the most valuable player in the Finals that year, and his No. 1 jersey was retired by the Pistons on Wednesday night at halftime of their  to Denver.He was the second player from that 2004 team honored by the Pistons this year. The Pistons retired 's jersey last month at a similar ceremony, in front of a packed house on a night Detroit beat Golden State.There were some empty seats in the upper level Wednesday, but Billups wanted to be honored while the Pistons were playing the Nuggets. Billups is a Denver native and played for the Nuggets for two stints during his career.\"This was by design, only because there's a lot of people that contributed to my success as a player and as a man, in Denver, my hometown,\" Billups said before the game. \"There were several dates that I could have chosen. This one obviously stuck out.\"Billups said he does have a mild regret about his run of success with the Pistons. He figures they could have won more titles.\"I felt like, two and maybe three championships,\" he said. \" We were that good.\"Ben Wallace was on hand Wednesday, and so were Richard Hamilton, Rasheed Wallace and  from the 2004 championship team. Pistons great Isiah Thomas was also at the Palace for the ceremony.\"This is what tradition looks like,\" Thomas told the crowd. \"This is what it feels like.\""},
{"url": "http://espn.go.com/blog/chicago/bulls/post/_/id/22963/changes-are-needed-for-bulls-team-with-broken-spirit", "text": "CHICAGO -- On the laundry list of injuries the  have been dealing with this season, the most important one that has been missing on the injury report is heart. The Bulls haven't played with much of it lately, and it has added one more item to a growing list in what continues to look like a lost season.As respected veteran  hobbled around the locker room on an aching ankle after Wednesday's  to the , the veteran of seven NBA seasons, all with the Bulls, acknowledged that it wasn't his foot that hurts most.\"It's frustrating,\" Gibson said. \"It's very frustrating because we have more than enough to win. We used to win games with less than this. I think it's our mental [approach]. It's extremely frustrating and it hurts my heart.\"Like the rest of his teammates, Gibson can't pinpoint why the Bulls continue to play as poorly as they have lately, heading into the All-Star break having lost 13 of their past 18 games and sliding to seventh in the East with a 27-25 record.\"I don't think it's quit,\" Gibson said. \"I just think at times we have a little doubt. That's where the talking and leadership -- we're out there, we're talking a lot, but I can't seem to put a finger on it. It's frustrating. I try and tell guys, we've got to get back to playing for each other. Just got to go out there and play, leave your heart out there and just lay it on the line. We got more than enough to win games. It's just frustrating.\"At this point, the realization has to come from the front office that this group does not have enough to win with. Changes are in order. Moves have to be made with the trade deadline approaching Feb. 18.In the short term, that means that  should be dealt by next week. Gasol is too talented an offensive player to continue languishing on a roster that does not have enough to win a title. Bulls general manager Gar Forman and executive vice president John Paxson should get the best return they can for the 35-year-old big man. The argument for keeping Gasol to win and go for a first-round series victory in the playoffs doesn't hold much water these days given the Bulls aren't winning games with him.Aside from the injuries, the biggest problem for the Bulls is that they don't have a lot of other assets.  isn't coming back for a while after an appendectomy and a hematoma removal.  is probably out for another month because of a knee strain.  is out for the season after shoulder surgery. And Gibson, a valuable asset because of his modest $8 million salary next season, appears to be hampered by the same ankle injury that slowed him last season.What is the point of keeping the same team intact when that team has proved it isn't consistent enough or mentally tough enough to overcome adversity more than halfway through the season?\"We got to find ourselves,\" Bulls coach Fred Hoiberg said. \"I challenged them, whatever they got to do over the break, look themselves in the mirror, find a way to get committed to this team where we can come out and go on a run. And that's all we can do right now is look forward. It's been a bad, bad stretch of basketball. Hopefully we'll get healthy and move forward.\"But even when they've been healthy, the Bulls have been inconsistent and don't seem to enjoy playing with one another. To keep that same roster together moving forward seems the wrong way to approach the issues this team has created.That's why Paxson and Forman need to look in the mirror more than anyone else and give an honest assessment of the roster they have built.\"When we come back, hopefully this break gives us a little time to get away from it,\"  said. \"Come back, got 30 games left and we got to decide whether we want to play or not.\"Paxson and Forman have to figure out why the chemistry continues to be so bad on a team full of so many good, character players. And it's very evident in watching Hoiberg's team that those players are not absorbing his message on a nightly basis. The Bulls aren't going to jettison Hoiberg in the first year of a five-year, $25 million deal, especially when they are still paying former coach Tom Thibodeau $9 million over the next two years, so the only recourse Paxson and Forman have is to try to fix the DNA of this team on the fly.When asked what had to change, Gibson had an answer weighing on his mind.\"The accountability,\" Gibson said. \"And we got to play a lot harder. We got to do what the coach wants us to do. We have to understand when he writes something on the board we have to do it. At the same time, we have to execute and have the heart to just go out there and play. Just get back to having fun.\"The truth is the Bulls look miserable out on the floor together. Their games are joyless. They have splintered apart even more than they did at the end of Thibdoeau's last season. If Bulls owner Jerry Reinsdorf is confident with Paxson and Forman still leading the way, and all indications are that he is, then it's up to the two basketball lifers to change a roster that is badly in need of a makeover.\"It's confusing and frustrating at the same time because we have way more talent than we did the year we went to the Eastern Conference finals, I think.\" Gibson said. \"We just had guys back then that played for each other and willing to do whatever it takes and have fun playing the game. And we got good guys. The thing about it [is] we all get along with each other. Sometimes it just takes ... you need a lot more than just having a like for each other. You got to just really deep down love each other and play hard knowing that that guy's going to battle for you.\""},
{"url": "http://espn.go.com/nba/story/_/id/14750602/how-golden-state-warriors-stephen-curry-got-best-worst-ankles-sports", "text": " know if he'd wake up owning a dead man's tendons.It was April 25, 2012, and inside the Southern California Orthopedic Institute in Van Nuys, a renowned surgeon hovered over a baby-faced, decreasingly conscious Curry. In the vast majority of the ankles operated on by Dr. Richard Ferkel, who's cut thousands of holes into hundreds of NBA players since 1983, he knew precisely what he'd find well before the anesthesia started pumping -- structural damage, scar tissue, etc. But here in this fourth-floor operating room, something wasn't adding up with his 185-pound patient. As the clock ticked and the Curry family prayed just down the hall, Steph went to sleep a mystery.Before the drugs hit, Ferkel had explained a range of potential outcomes. Less than a year before, in Curry's hometown of Charlotte, North Carolina, a specialist had already sliced open that same right ankle and rebuilt two ligaments that had stretched apart like a rotting sweater. The worst-case scenario now? Total re-reconstruction, meaning that everything rebuilt in Curry's  surgery would be reattempted. If that proved necessary, they'd use better parts -- specifically, tendons from a cadaver -- and the projected recovery time would be at least six months. But such an operation would also be extreme enough that no one would be sure how the new hinge would hold up on the court. One near certainty: With Curry's rookie deal expiring in six months, on Nov. 1, 2012, his future with Golden State would be that much hazier. His agent would likely need to negotiate an extension before the undead ankle could appear in a game.Understand: The four doctors and two nurses in the operating room didn't know they were endeavoring to save the future of the NBA. Nobody, anywhere, considered that a 24-year-old who was still getting carded at California Pizza Kitchen was the impending nightmare of both LeBron James and Kevin Durant. At this point, Curry's trajectory was just depressing: In his first NBA season after the original procedure, he suffered five ankle sprains while playing in a mere 26 games.\"He was turning his ankle in completely nontraditional, crazy ways,\" Warriors general manager Bob Myers says. One time, Curry turned it while hopping into a passing lane during a preseason game against the Lakers. Another time, he was dribbling upcourt against the Spurs, with no one around, only to have his right foot fishtail like an old tire on black ice. \"It was scary,\" Myers says. \"I'd never seen someone sprain his ankle like that prior to Steph. And I haven't seen it since.\"The league had once envisioned Curry as a sharpshooter with a close-up magician's gift of misdirection. But now, as the Warriors guard rested atop Ferkel's operating table, his career resembled a crossover in reverse: a case of ankles breaking a man. \"People started saying, 'Steph's got glass ankles. Steph's Grant Hill 2.0,'\" recalls Bryant Barr, Curry's best friend and college teammate at Davidson. \"He didn't hide his emotions, his frustration, for anyone.\" In college, somehow, Curry had no history of right ankle trouble. As a pro? The sight of the guy chucking his mouth guard, punching a padded chair or slapping the floor in existential agony became more memorable than any highlight.When Curry eventually blacked out on the operating table, however, a rather remarkable thing happened. A recent battery of strength tests, nerve tests, X-rays, MRIs and CAT scans had all failed to resolve why his ankle kept buckling. But a set of stress X-rays conducted midsleep, when pain can't impact motion, formally ruled out any structural damage to the ligaments. A 1-ounce HD camera snaked into Curry's subtalar and ankle joints produced images of thick, sticky bands of scar tissue -- \"like crab meat,\" Ferkel says -- as well as inflamed tissue, bone spurs and chips of cartilage. To anyone else, orthopedic seafood might be revolting. To Curry, \"it was good news,\" he says. \"The least intrusive outcome.\" A motorized device called a shaver scraped and vacuumed all of it away in less than 90 minutes. No zombie tendons necessary. Projected recovery time: three to four months.Easier said than done, of course. Three months later, in July 2012, Curry was rehabbing with his personal trainer, Brandon Payne, when he made a startling confession: \"I feel like I've been doing nothing but rehabbing for two years,\" Curry quietly told him. \"I feel like I'm never going to be able to play again.\"He looked exceptionally miserable. And everyone could see it.\"Steph was sick and tired of it,\" Myers recalls. \"He said, 'This ankle thing is not gonna be my life.'\" in downtown Atlanta, and inside the players' lounge at an eerily empty Philips Arena, Keke Lyles is rotating his hips while grabbing his butt with both hands. Lyles has 24-hour entree to this room as the Hawks' new executive director of player performance, overseeing all medical, rehab and strength and conditioning decisions. The bearded 31-year-old received such an imposing title, which came with the power to handpick his own staff, in order to lure him away from his previous employer, Golden State. Or, as LeBron James described the title-winning, scratch-resistant team in November, \"The most healthy team I've ever seen in NBA history.\"Before joining the Warriors as performance director in 2013, Lyles had been watching Curry from afar in Minnesota, where he was the Timberwolves' strength and conditioning coach. For all of the rehab hopelessness in July 2012, Curry would proceed to play a reassuring 78 games that season with a breakout 22.9/4.0/6.9 line. Ferkel's surgery, though, was no miracle cure. \"You could see when Steph didn't trust his ankle,\" says forward Brandon Rush, who was on that 2012-13 team. \"He didn't try to make the moves he usually makes. He didn't finish and take contact like he usually takes.\" Curry missed four games in January 2013 with right ankle sprains, exited one March game early for the same reason and -- worst of all -- rolled his left ankle during both Warriors playoff series, hobbling him against the Nuggets and then the Spurs.So Lyles arrived in Oakland with a new theory. At first blush, the Northeastern grad can seem like a bro-ish ex-athlete -- which, having grown up in Southern California, Lyles technically is. But in his junior year of high school, a life spent hooping was disrupted by a condition called femoroacetabular impingement, wherein extra bone growth causes excruciating pain in the hip. That part of the body is what turned his fascination inward, Lyles says, toward a career spent obsessing over how to fix athletes. And it is the same part of the body that would spring to mind, years later, when Lyles faced his first and foremost assignment with Golden State. Hence the pedagogical clutching of his derriere.Curry, Lyles believed, was already among the best in the world at changing direction. But the guard overwhelmingly relied on his ankles for speed and quickness. Those body parts appeared to be basketball's take on the mythical wings of Icarus: melting, as if made of wax, from overuse and ambition. But what if Curry could add another way to fly? \"Shiftiness is an ankle strategy,\" Lyles explains, \"but power comes from the hips. We wanted to teach Steph how to load his hips to help unload his ankles.\"Curry, haunted by what-ifs after those 2013 playoff sprains -- \"I had to do rehab in between games; it brought back memories,\" he recalls -- was immediately sold on the theory.The best marksman in NBA history, perhaps unsurprisingly, turned out to be a quick study at exercise technique. \"Steph's central nervous system is the best I've worked with,\" Lyles says. \"It's why he's a great golfer, a great bowler, a great shooter.\" Curry swiftly perfected a yoga pose called the single-leg hip airplane, designed to build balance and core strength. He conquered the hip hinge, the fundamental movement of explosive lower-body exercises, in 10 minutes. He even mastered textbook trap-bar dead lifts, which amplify glutes and hamstrings, during his introductory session with Lyles. Other players typically need a week.At first, a willowy Curry could deadlift a pitiable 200 to 225 pounds. But then the labor began: less a  training montage, heaving with theatrical workouts, than a time-lapse video, comically dense with, well, time. \"The man was always in the gym,\" teammate Klay Thompson says. \"Steph just stuck with the routine. He works on his body just as much as he works on his jump shot.\" By Curry's second year in the program, his dead lifts could touch 400 pounds -- more than twice his bodyweight and second most on the Warriors behind 6-foot-11, 265-pound center Festus Ezeli. \"Steph became more aware of how he needs to take care of his body,\" says his father, Dell Curry, a 16-year NBA vet. \"It helped him understand that his body is his career.\"The objective is never bulk; Steph prefers his weight at no more than a chiseled 190 pounds. Instead, both Lyles and Payne -- to whom Curry still entrusts his ankles in the summer -- harp on stability amid a storm of jumps, hard cuts and pick-and-rolls. For that same reason, some 90 percent of Curry's lower-body strength work with Payne is one-legged: single-leg reverse lunges, rear-foot elevated single-leg squats, single-leg dead lifts. A standard offseason warm-up involves standing like a flamingo on a squishy blue Airex pad as Payne obscures Curry's vision, sometimes with flashing strobe goggles, and whips basketballs his way. \"Steph's core strength,\" Payne declares, \"is second to none.\"In each of the past two seasons, Curry has careened into the paint -- a forest of lower-leg dangers -- and shot more often and at a better percentage than all but seven players, all of them bigger. No one is better than Curry at misdirection through hip gyration, as when he thrice juked Kawhi Leonard on Jan. 25 before hitting a corner 3, transfiguring the defensive player of the year into a viral chalk outline. And yet that play might not have been more impressive than one seven days earlier, when Curry found himself the meat in a Kyrie Irving-LeBron James sandwich in the lane. He judo-tossed the 250-pound James onto the floor, broke free of Irving's grip, sprinted past a screen and drained a 3 in the time it took for James to stand back up. \"The way Steph moves, 98 percent of the world would hurt themselves trying to run like that,\" says Warriors assistant GM Kirk Lacob, son of owner Joe. \"I think people would pay to watch Steph work out.\"Watching the 27-year-old stay on the court has been gift enough. Over the past two and a half seasons -- a run of three All-Star selections, a 2014 FIBA World Cup gold medal, 28 NBA playoff games and one title (so far) -- Curry has missed a measly two games due to ankle-related concerns. The first came in November 2013, as a precaution for a left ankle bone bruise. The second was in February 2015, after his right foot landed on Boris Diaw's left. And that's it.A theory appears to have paid off.But here in Atlanta's lounge, Lyles takes care to philosophize about the boundless constellation of factors that compose any injury equation. He brings up Curry's pair of Zamst ankle braces, worn every game. And Curry's pair of Under Armour sneakers, scientifically designed for his feet. And the insight into fatigue that the Warriors have gleaned from analyzing player-worn GPS accelerometers in practice and the overhead SportVU cameras in arenas. And coach Steve Kerr's sincere commitment to improving health by reducing personal stress. (On training days, Lyles would intermittently send Curry off to unwind with his family or play golf with swingman Andre Iguodala.)Then there's the Warriors' roster, which is so good and so deep that Curry, through 50 games, was averaging just 33.8 minutes a game (32nd in the NBA), shrinking risk exposure. Last year he averaged 32.7 (41st). \"All of that matters,\" Lyles says. \"I could argue that everything matters.\"Which means, logically, that any random thing can also be a threat. hour before Golden State hosts Miami in January, and Bob Myers and Kirk Lacob sit around a circular table in a small back room underneath Oracle Arena, mulling over Curry's ankles. As much as any front office in sports -- owing at least partly to its proximity to Silicon Valley -- Golden State's front office actively quantifies injury risk. Yes, Myers and Lacob agree, any random threat might matter. \"But the aspiration is to measure as much as we can,\" Myers says.The Warriors hired their new head of physical performance and sports medicine, Australian sports science expert Lachland Penfold, with this data-driven mission in mind. \"Eventually,\" Lacob says, \"we'll have, like, a video game fatigue meter. A guy like Lachland will be able to go up to Bob and Steve [Kerr] and say, 'Guys, he's at a 77, and our threshold is 75 for Safe to Play.'\" (The team declined to make Penfold available for an interview.)Obviously, when it came to re-signing Curry before Nov. 1, 2012, there was nothing close to such technology. Asked now about the thinking behind his approach, Myers chuckles like a trader who bought Google mid-recession. \"I wish we could've paid Steph more,\" he says with a grin. But the GM notes that at the time of the outlay -- a four-year, $44 million extension -- Curry had just sprained his right ankle in the preseason, labeling him rather emphatically Unsafe.\"So we decided to bet on a couple of things,\" Myers explains. \"We bet on who he is as a human being. We bet on his ability. We bet on the fact that he was the type of player who'd do everything within his power to come back and be smart and be diligent.\"But to be perfectly clear: \"Nobody could imagine this happening,\" Curry says. It was unthinkable that the Warriors might one day offer the theory currently being advanced inside this back room: \"The ankle thing made him work smarter, to counteract him ever being put in that position again,\" Lacob says. \"If he hadn't had it, maybe he wouldn't have the same core strength.\" Adds Myers, nodding, \"It made Steph what he is now.\"This is not to suggest that the people in Curry's inner circle have stopped worrying about him. Five separate interviewees knock on wood in the middle of talking about his ankles. One of them, Warriors assistant coach Bruce Fraser, who oversees Curry's famed pregame shooting routine, frets about defenders challenging Curry's jumpers by getting underneath him, turning their feet into land mines. \"But I don't know if Steph's aware of that,\" Fraser says. \"And I don't know if I want to make him think about it.\" Ferkel, meanwhile, still pays periodic visits to the Bay Area, just to check in. And Payne still can't shake the feeling of watching Curry limp after hitting his banged-up left shin against Lakers center Roy Hibbert in January. \"It scared the hell out of me,\" the trainer says. \"It brought back immediate memories of Steph getting hurt.\" Payne sighs, then continues: \"Watching him isn't the enjoyable process you'd think. It's a lot of sitting on edge.\"Dell sometimes declines to sit altogether. This Christmas, in the middle of the second quarter of the Cavs game at Oracle, Steph had to go back to the locker room to attend to a right calf strain. It was exactly the type of scene that leads to naysayers crowing about injury luck regressing to the mean ... and friends texting Lyles in Atlanta, half joking,  ... and a terrified dad suddenly abandoning his chair to follow his son inside. \"Any time I'm at the game and Steph gets dinged up,\" Dell says, a tad sheepishly, \"I'm able to get around that building pretty good. Just to see what's going on.\" It is even more remarkable, then, that the player in question might be less anxious than them all.Back in the Warriors' locker room after trouncing the Heat by 15 -- Steph dropped a ho-hum 31 -- Curry ponders his front office's theory of his evolution. After all that agony and uncertainty, does he honestly believe that the absurdity of his ankle history has saved him from a worse career?\"I think so,\" Curry matter-of-factly replies. \"It definitely drove home my work ethic. Post-surgery, it's kept me driven about taking advantage of every day. There was a time when I was just worried about playing basketball, much less playing at a high level. Now I try to have as much fun out there as possible. You don't enjoy the surgery and the rehab process. But I enjoy how I came out of it, for sure.\"His answer carries the rosy whiff of cliché, admittedly. But when you remember all that must be waved aside to embrace this unfinished timeline of events, so much positivity sounds less like optimism and more like the real secret to Steph Curry's flying, higher than ever.He learned to forget, finally, that he still might fall."},
{"url": "http://espn.go.com/nba/story/_/id/14757415/steve-kerr-battles-headaches-lingering-spinal-fluid-issues-coaches-pain", "text": "PHOENIX --  coach Steve Kerr was able to coach the team's final game before the All Star break, after suffering though headaches and pain related to the spinal fluid leak that caused him to miss the first 41 games of the season.Kerr felt ill after Tuesday's win over the , but he traveled with the team to Phoenix and was able to coach in Wednesday's  over the Suns.\"I still have symptoms from everything I've been dealing with,\" Kerr said. \"I wish everything was clear and gone away, but at times it's not, and I have to deal with stuff.\"The Warriors have gone 11-0 since Kerr returns on Jan. 22. They concluded Wednesday's game with a 48-4 record, the best record through 52 games in NBA history. Interim coach Luke Walton went 37-4 in Kerr's stead.\"Nobody has ever done it, right?\" Kerr said after Wednesday's game. \"Fifty-two games in, to have only lost four games is remarkable. It speaks to the talent and chemistry of the players. We have a deep roster, and they love playing together, they enjoy winning, and they are good at it.\"When Kerr returned to the bench last month, he said he might occasionally have to sit out a game if his symptoms flared up.Asked whether it was nice to have Walton available in those situations, Kerr smiled and joked, \"Yeah. But I'm undefeated. He lost four games.\""},
{"url": "http://espn.go.com/blog/san-antonio-spurs/post/_/id/469/tim-duncan-returns-suffers-no-setbacks", "text": "ORLANDO, Fla. --  forward  returned to the lineup Wednesday after missing eight games due to soreness in his right knee, and walked away unscathed from his team’s 98-96 triumph over the .That’s a start for Duncan, who last played a game against the Los Angeles Lakers on Jan. 22 in L.A.“It felt good,” Duncan said. “I couldn’t make a shot, but it was good to be out there with those guys, and do what I can to help them win.”Duncan played a little more than 18 minutes but sat on the bench the entire fourth quarter as the Spurs rallied from 12 points behind at the start of the quarter to win on ’s 19-foot jumper with nine-tenths of a second remaining in the game.Spurs coach Gregg Popovich said Duncan brought “a couple of rebounds, steadiness” to the Spurs, adding that “everybody feeds off him, and knows where to go on the court” when the power forward is involved.Duncan contributed five points on 2-of-9 shooting, but pulled down seven rebounds, dished five assists and blocked three shots. On several occasions, Popovich has called Duncan the “center” of everything the club does on defense. So with the offense finally starting to mesh as players such as Kawhi Leonard and  find synergy, Duncan’s assistance on the defensive end should bring about optimism about the team’s prospects as the postseason approaches.Popovich thought Duncan “did good,” but most importantly “he didn’t feel anything” in the sore right knee.“He felt fine,” Popovich added.Duncan snagged his first rebound just 32 seconds into the game, then blocked a  driving layup at nearly the halfway point of the first quarter. Aldridge and  agreed Duncan’s timing might be off, but both say he makes the Spurs a more formidable defensive team. Leonard raved about Duncan’s “great mind for basketball.”“He definitely changes our defense,” Aldridge said. “He makes it tougher to score down there. It’s going to take him some time to get his timing back, but that’s just natural because he’s been out for a while. But he’s Tim. He’ll figure it out.”Added Green: “I think it was a good game for him to come back on. Obviously, he’s still a little rusty. It’s hard to get back. Playing shape is very different. But I thought he played pretty well for the most part, didn’t get the foul calls that he wanted. But he made some good moves, got some good finishes, made some good passes. The timing will get there. Tim is another rebounding big, great defensive guy, blocks a lot of shots and he’s a great passing big. He’s also another pick-and-pop guy. Getting another one of those main guys back, it helps our defense a ton. We’re gonna need that.”The team also needs this upcoming All-Star break to heal, as  recovers from a sprained left ankle and  works to return from testicular surgery. Duncan said the injured knee felt fine, and he didn’t suffer any setbacks against the Magic. But Duncan still needs to recover his timing while working himself back into playing shape.“We’re gonna have to put it all together,” Duncan said. “Obviously, Tony was out tonight. Manu is still out. I came back and things changed a little bit. But we’ll figure it out. Luckily, we have another half of the season to do that.”"},
{"url": "http://espn.go.com/blog/cleveland-cavaliers/post/_/id/2110/kyrie-irving-shines-brightest-on-kobe-lebron-night", "text": "CLEVELAND -- When Phil Jackson arranged for his former pupil and 's idol, , to meet the brash, young  phenom for the first time, there was one nugget of knowledge Jordan imparted to Bryant.Of course, Jordan had to listen to the kid brag about how he could beat him one-on-one before he passed on the message to Bryant, but here’s what one scorer at heart told to another as the secret to unlocking all the NBA buckets you could ever ask for: Develop a one-dribble pull-up jump shot.Years later, it was Bryant’s turn to talk to  -- coached by Bryant’s USA Basketball coach, Mike Krzyzewski, at Duke and then starting his career under Bryant’s former teammate, Byron Scott, in Cleveland.And just like Bryant’s fadeaway mimicked MJ's, and his gait mimicked MJ's, and his celebrations mimicked MJ's and even the inflection of his voice mimicked MJ's, so too did the advice he chose to bestow upon Irving.“When he first came into the league, we talked about the importance of a pull-up jump shot,” Bryant said after the Lakers’  to the  on Wednesday. “We talked about that a lot. And being able to stop on a dime and shoot. A player of his caliber that can shoot the 3 and get all the way to the rim, it’s important to keep the defense off balance with one-, two-, three-dribble pull-ups.”As much as Wednesday’s game was built up to be about Bryant versus  for what would be the first of their final three meetings before Bryant retires (Sunday’s All-Star Game and another regular-season game in March), it really meant maybe even more to Irving.You see, Bryant, with his 20 seasons and five rings under his belt, has nothing left to take from the game. Between now and mid-April, when he laces them up for the final time in what’s sure to be a surreal night at Staples Center, he is opening himself up.“I think it’s important to share whatever knowledge that I’ve gained throughout the years so hopefully they can pass it on to the generation after,” Bryant said.Everyone from Nike to the league office tried to peg Bryant and James against one another as rivals, but the reality is that Bryant was already a seven-year veteran when James entered the league.“To me LeBron is still young,” Bryant said Wednesday, openly guessing that James was in his 10th season and then reacting as if he was blown away when informed that it’s indeed season No. 13 for James.James, with 13 seasons and two rings to his resume, still wants more out of the game. Namely championships. But at the same time, the way he is setting himself up to get there is by feeding the 23-year-old Irving.As a five-year vet, there is so much more that Irving sees as his rightful bounty from basketball. James already suggested this season that Irving will win an MVP someday. Scott called him the most talented point guard he has ever coached -- and his former players include the likes of Jason Kidd and . And Bryant sounded like he was describing himself when detailing Irving’s game.“He has a killer mentality,” Bryant said. “He can shoot the long ball. His midrange game is excellent. And he can finish at the rim. So, he has all the tools there. It’s just a matter of continuing to work and get into rhythm where he can start doing that on a consistent basis. But the way he played tonight, he can do this pretty much every night.”Wednesday’s game got mildly competitive in the fourth quarter when Bryant broke out some of his old magic to score seven points in two minutes late in the quarter to bring the Lakers within eight after once trailing by 22. But Irving closed things out with eight fourth-quarter points of his own en route to 35 points.It was a game-high total and a season-high total for Irving, more than James' 29 and more than doubling Bryant’s 17. While all the postgame cameras flooded Bryant and James to capture their embrace after the final buzzer, Irving and Bryant had a hug of their own that went comparatively unnoticed.In Bryant’s final game against Jordan, he smoked him for 55 points, including 42 in the first half. Irving told ESPN.com that he was going for the same sort of statement game against Bryant. As much as it could come off as cutthroat, it’s just as much about reverence and respect, almost like a kid inviting his parents to his talent show competition because he wants them to be proud.“Oh yeah, for sure,” Irving said. “Going against your mentor, one of the guys that you want to prove something to every time you go out and play, there was definitely some added incentive going in there.”And so, some of basketball’s brightest aligned for one night. A dimming star, a brilliant one and one just beginning to burn. All sharing the same sky. All connected as a constellation."},
{"url": "http://espn.go.com/fantasy/basketball/insider/story/_/id/14752687/ranking-michael-jordan-larry-bird-10-greatest-fantasy-basketball-seasons-all-time", "text": "Young, stat-crazy NBA fans don't know how good they have it. Just to throw an NBA old-man anecdote out there: I got my first idea for a player rating measurement when I was about 13 years old. In order to obtain the data to calculate it, I had to write to the league office and beg for a packet of statistics. (Which they sent!)That old formula of mine has been lost to the dusts of time, but I still love to rate players as much as ever. So it was great pleasure that I participated in ESPN's process of ranking the . Because of the incompleteness of the historical statistical record, we had to rely as much on memories and stories as hard data when slotting in anyone who came before Magic Johnson and Larry Bird, though we have methods for gleaning quite a bit statistically from the little bits we have left behind.As it happens, the history of roto sports -- or fantasy leagues, in the modern parlance -- is roughly the same age as our history of (mostly) complete NBA statistics. We  to look at where  rated in his career as a fantasy asset. In that vein, and borrowing the same methodology, let's get into the spirit of #NBARank and look at the best-ever single-season fantasy performers."},
{"url": "http://espn.go.com/nba/story/_/id/14757066/nba-schedule-breaking-players", "text": ", Kristaps Porzingis looked fresh and rested as he walked into the Quicken Loans Arena for a late-December game in Cleveland. And for the first three quarters, he played that way.But even if the 20-year-old rookie phenom looked good on the outside, on the inside his body was surely a mess. For the past three months, it had been systematically trashed by the NBA's silent killer: its grueling 82-game schedule. New York had just come off a three-games-in-four-nights stretch, which had come on the heels of a three-games-in-four-nights swing through Utah, Sacramento and Portland. Not surprisingly, Carmelo Anthony had rolled his ankle late in a game two nights earlier and was now out.Sure enough, by the fourth quarter, the hormonal, mental and physical aftershock of the Knicks' schedule emerged into full view. With a minute left, Porzingis, who had scored 23 points in the first three quarters, had yet to score in the fourth and was visibly dragging. The Knicks trailed by four and needed a stop. And with the entire arena on its feet, LeBron James -- coming off a luxurious, if rare, two days of rest -- made his move. From the left corner, LeBron darted toward Porzingis before rising up for a sky-high one-handed slam. Instead of challenging James at the rim, Porzingis ducked away, like a matador. The Cavs would win by seven, with the Knicks mustering just 12 points in the fourth, tying their then-season low.For the NBA, LeBron's slam was the stuff of dreams: A superstar soaring for a game-clinching dunk is the very thing that sells tickets, spikes ratings and launches Vines. But here's the thing: It almost never happens, and for reasons most people don't realize.As it turns out, the fourth-quarter dunk is a rare phenomenon. From the 2005-06 season through 2014-15, there were nearly 5,000 fewer dunks in the fourth quarter compared with the first, a decline of 20 percent. In fact, dunks become rarer with each passing quarter: from an average of 1.98 in the first to 1.59 in the fourth. More fascinating: The overall frequency falls 24 percent when teams play on zero days' rest versus one day off, dropping from 5.5 dunks per game to 4.2. The upshot: It took a dog-tired Knicks team on the road against a fresh Cavs squad to produce that James highlight.It's merely one of a hundred signals that NBA players are exhausted and sleep-deprived. In this case it was to the benefit of the highlight makers. But the evidence suggests that, over the course of a season, all players -- and fans -- end up losing.\"It makes no sense to me,\" says Dr. Charles Czeisler, director of sleep medicine at Harvard Medical School. \"These guys are so extraordinarily talented, and it's a shame that they're being impaired. It'd be like the NBA saying, 'OK, let's see how they do if we starve the players. OK, let's see how they do if we make them all drunk before they play, so everybody has to do six shots before they do the game.' Would anyone in their right minds consider that?\" one of the world's top running coaches -- his middle- distance and marathon runners are prepping for the Olympics now -- and a leading authority on athlete exhaustion. There are disagreements among experts in his world about how hard to push athletes, but nobody recommends anything like what the NBA prescribes: four contests in five nights, say -- or 82 in 169 days.\"It's almost ludicrous how often they play,\" says Magness, who has a master's in exercise science and wrote the book . With so few days off, the restorative faculties of the human body start to shut down. And it's a problem the NBA knows it has. Commissioner Adam Silver recently told reporters in London that \"we're becoming more sophisticated about the impact of fatigue on our players and the direct correlation between fatigue and injuries.\"But even with a new push by the league to reduce back-to-backs and four-in-fives to all-time lows, there are still 533 back-to-backs in the NBA schedule, far too many in the eyes of Magness, who advises his top Olympic athletes to race no more than once a week.The problem is mounting. Research from ESPN's Kevin Pelton indicates that stars are more injury-prone than ever. Incumbent All-Stars from 2013-14 missed 19 games on average last season, or about a quarter of the season. Compare that with 2009-10, when incumbent All-Stars missed just 10.8 percent of their games -- or one of every 10 games. The plague of the injured star was evident in the 2015 Finals, when James shot 38 percent sans Kyrie Irving and Kevin Love. And Jimmy Butler, the NBA leader in minutes per game, just suffered a knee injury on the second night of a back-to-back that will keep him out for three to four weeks.If you survey doctors and sports scientists around the world, the NBA's problem stems in large part from chronic lack of sleep, the body's natural performance-enhancing drug. How important is it? A recent Stanford University study found that shooting accuracy improved by 9 percent and 3-point percentage by 9.2 percent after basketball players spent at least 10 hours in bed for nocturnal sleep during a five-to-seven-week period. \"We get this nice big surge of testosterone and human growth hormone when we get into deep sleep,\" Magness says. \"The longer the deep sleep phase gets, the more HGH and testosterone you produce.\"Magness describes a war between two biomarkers in the body: testosterone and cortisol. The more testosterone, the better; it's the anabolic steroid that promotes muscle growth and recovery. Cortisol, though, is a stress hormone that parachutes in when the body is breaking down. As cortisol levels rise, the body signals that it's in distress and dispatches ambulances and firetrucks to fix the damage. In October and November, he says, NBA athletes show strong testosterone-to-cortisol levels. But as the season grinds on, the ratio flips: \"As your body flip-flops into 'not being able to repair itself' state, your immune system can't keep up; it eventually taps out.\"Magness has seen this firsthand: It's common for marathoners to stay healthy all during training and then get sick a week or two before the race. \"Because they cooked it just a little too hard.\"In early January, the NBA's ironman, Clippers center DeAndre Jordan, missed his first game since 2011. The DNP was due to a bout with, of all things, pneumonia, to which Magness quips, \"Yeah, exactly.\"There's a reason, after all, teams play three points per 100 possessions worse on the second day of back-to-backs. And even worse when they play four games in five days. \"Basically, it makes the body a mess,\" Magness says. \"What happens when you play 82 games in a 160-day stretch is you don't give your body time to repair itself and get ready for the next go-round. It just kicks into this stage where it can't keep up with the demands.\" since Chris Bosh's diagnosis of a pulmonary embolism -- a blood clot in his lungs that forced him to miss much of last season. Fresh off scoring 18 points in a win over the Hawks, the 6-foot-11 Bosh is slumped deep in the red leather chair in front of his locker, trying to illustrate what air travel is like for him. He says the constant flying contributed to the life-threatening clot that migrated from his calf to his lungs: \"You sit so much. You're like this for two hours. If you get kicked, blood just pools up somewhere and you don't move it, it just sits there.\"Bosh played for weeks last season with chest pains from the embolism, forcing him to spend days laid up in February in a Miami hospital bed with tubes in his chest. With 12 years of NBA life under his belt, he thought he had the whole travel thing figured out. \"Yeah,\" Bosh says, \"until you're in the hospital.\"Doctors indicated that being tall and flying frequently -- defining characteristics of NBA players -- were the main contributors to his condition. Other NBA giants have fallen prey to similar diagnoses in recent years, including 6-11 center Anderson Varejao in 2012-13 and 6-9 power forward Mirza Teletovic last season. \"We got strong hearts,\" Bosh says, before pointing down to his feet, \"but that's a long way away.\"Of course, Bosh's case is at the extreme end of the spectrum. For many players, zipping across time zones and being forced to scrape for z's while upright on planes, in unfamiliar beds or folded onto training room couches leads not just to poor basketball but to greater injury risk. Eliminating back-to-backs is critical, says Dr. Michael Joyner, a renowned expert in human performance and physiology at the Mayo Clinic in Minnesota.Thirty-three years ago, Joyner was in medical school at Arizona -- where he'd run track as an undergrad -- when a sweet-shooting guard named Steve Kerr stepped onto the Tucson campus. It was there -- watching coach Lute Olson turn around the program with Kerr -- that he became obsessed not only with hoops but also with the madness of the NBA schedule. \"There's a reason why airline pilots have sleep rules,\" Joyner says.No sport spends more time at 30,000 feet than the NBA. Consider that the Warriors will travel an NBA-high 54,000 miles this season, per an NBAsavant.com analysis, twice as many as the NFL's top travel team (the 49ers, who jetted 28,000 miles in 2015, according to Pro Football Reference). Baseball obviously has it worse with its 162-game schedule, right? Wrong: The average NBA team logged 44,214 miles last season; in MLB it was 29,374, according to BaseballSavant.com. Even NHL teams travel less than NBA teams do, averaging about 40,000 miles of flight per season. leaves players at risk, particularly the ones who log big minutes. Research shows that risk increases exponentially as minutes rise. NBA empirical data is notoriously scant, but a 1999 study in the British Journal of Sports Medicine found there were significantly more injuries in English Premier League soccer in the 15-minute periods at the end of each half, when fatigue was at its highest.What's more, there were far more injuries in the second half compared with the first half of matches for both professional (56 percent versus 44 percent) and youth players (59 percent versus 41 percent). A 2010 study in the American Journal of Sports Medicine found that pro soccer players suffer six times as many injuries playing two matches in a week compared with just one match per week. And a 2012 Basketball Prospectus study by Pelton found that the period of playing time when players are most likely to tear their ACLs arrives between minutes 33 and 39. Even the injuries that seem driven by bad luck -- say, turning an ankle by landing on an opponent's foot -- might be avoidable with more rest, as spatial awareness improves with sleep and muscle strength is hardened by rest.\"Timing is off, and when muscles fatigue, they're more likely to tear from overuse,\" Joyner says. \"The things you do easily -- jumping and landing -- become more difficult. You see this with ballerinas and ice-skaters; you miss your jumps because you land weird. And that's when you turn an ankle and twist your knee.\"In fairness, the NBA has shuffled the schedule to reduce the number of back-to-backs. \"We have more people than ever looking at the impact of the schedule on injuries and analyzing how we can potentially make it better,\" a league official says. In 2014-15, the Blazers traveled an absurd 64,576 miles. The league shaved 12,000 miles off that this season, thanks to a fancy algorithm implemented by the NBA's analytics guru, Jason Rosenfeld.But Portland fans might argue that the schedule tweak was too late. Although correlation does not equal causation, former Blazers starter Wes Matthews, in the midst of a breakout season, ruptured his Achilles on the second night of a back-to-back in March, ruining his season and setting off a personnel chain reaction that led to this season's franchise rebuild., Silver will host a gathering of owners and power brokers at his All-Star Tech Summit in Toronto. At the main panel, the literature boasts, health and analytics will be the focus: \"We'll explore how technology is rapidly improving the game of basketball.\"Coaches are adapting too: The number of players averaging 35 or more minutes per game stands at 21 this season, down from 58 a decade ago. But DNPs and scheduling algorithms can only do so much -- at a certain point, more rest means fewer games, which means fewer events to sell tickets to and broadcast.It's clear, for now, that the league is not ready to take up the hard work of getting the owners and players to consider more profound changes. \"It's not a conversation that is being had,\" Silver told  in June. \"We've had an 82-game regular season for almost 50 years.\" A league spokesman affirms that thinking, noting that there's \"no definitive evidence to this point that fewer games would mean a lower rate of injury -- and therefore, not sufficient evidence to consider a big structural change.\"To researchers, the evidence is clear: Players are overworked. When presented with stats showing that dunks trail off as the game progresses, Joyner audibly giggles. He points out that the legendary Oscar Robertson famously never dunked in the NBA, despite being 6-5 and averaging a triple-double one season.\"Oscar Robertson is the id of NBA players,\" Joyner says. \"The body is telling the NBA player what Oscar's mind told him: Don't bother to dunk unless there is a desperate reason to do it. In a long season like the NBA's, why do gratuitous stuff that can ruin the body?\"The Spurs, no surprise, have already gotten that memo. Between 2005-06 and 2014-15, they dunked at a rate of almost half the NBA average, registering 567 dunks fewer than the next-lowest team, the Pacers. \"It's just easier to save energy and not do it,\" says Spurs guard Danny Green, who believes his team's style helps reduce injuries.Indeed, the Spurs have been ahead of the curve on injury prevention and are leading the way on body monitoring and controlling minutes. Research by Jeff Stotts of Rotowire.com found the Spurs have lost 995 games due to injury since 2005-06, the lowest number in the NBA. And therein lies the NBA's great contradiction. The Spurs are boring, in part because they play below the rim but also because they manage the 82-game grind with strategic rest. What ruins the body is also what sells, but as Spurs forward Kawhi Leonard says, \"We're not trying to put on a Globetrotter show.\"Flash back to 2012, when then- commissioner David Stern fined San Antonio $250,000 for holding Tim Duncan, Manu Ginobili, Tony Parker and Green out of a nationally broadcast game in Miami, the finale of a six-game, nine-day road trip. Coach Gregg Popovich defended his move before the game, calling it \"pretty logical.\" According to Stern, Pop's decision to send the players home early ran \"contrary to the best interests of the NBA.\"The clear verdict from science, though, backs Popovich. Turns out, the thing that runs contrary to the best interests of the NBA is its own schedule."},
{"url": "http://espn.go.com/blog/houston-rockets/post/_/id/1986/its-time-for-daryl-morey-to-fix-the-rockets", "text": "PORTLAND, Ore. -- The day after Christmas, Rockets interim coach J.B. Bickerstaff said his team embarrassed the game following a loss to the .A little more than a month and half later, Bickerstaff said his team is broken. He used words, such as fragmented, and said it's not the front office's responsibility to fix it. The oldest player on the roster, 38-year old , said the group has chemistry issues. said he was tired of talking about negative things.  didn't say much of anything other than he's frustrated and didn't know what else to say.The  lost to Portland on Wednesday, , to finish the first half of the season at 27-28 and outside of the playoffs if the season ended now.The current status has forced Rockets GM Daryl Morey, whether he wants to or not, to make a deal by the Feb. 18 trade deadline. A deal has to be made to shake up this team because this current group doesn't seem to enjoy playing with one another.\"Not on the same page,\" Bickerstaff said. \"It's however you want to say it. At the end of the day we all want to win. We all say we want to win. We all say we'll do whatever it takes to win. You got to walk that walk.\"The Rockets are failing at that so badly that Morey must do something.\"We're generally an active team,\" Morey said to ESPN regarding trades. \"I mean we won't force anything. They're not many windows where you get a chance to upgrade your team. We'll have to look at it very closely.\"So what can be done?The only in-season move Morey has made so far was to arrange 's return to the club. The Rockets won three straight upon his arrival, but since then he has struggled so badly that he hasn't played in the second half of the last three games. Smith played only six minutes Wednesday. Bickerstaff said Smith isn't in the doghouse, and Morey said the veteran forward will improve.In regard to everything else, the Rockets need to take strong looks at what they can get for everybody on their roster short of Harden, who continues to be a strong offensive presence. He scored 34 points on 20 shots Wednesday night. Howard, who scored 28 points and grabbed 13 rebounds, also should remain.Yet the appearance of Howard and Harden not being on the same page offensively is damaging, which filters down the roster.On defense, the Rockets get beat too many times in the front court and place too much pressure on the bigs to protect the rim. The Rockets are a poor team defensively when it comes to rotating. Knowing all this, Morey must find a strong post defender, or maybe a strong defensive guard.He already has one strong defensive guard in  but needs someone else, if they're out there. The Rockets would love to acquire another shooter, with the theory being if you're making shots, you're not trying to grab rebounds.In the locker room after the loss to Portland, players said goodbye to one another as if the season were over, but in reality they were getting a needed break -- hopefully to get their act together.Is it too late?\"If you look at it, the chemistry is not quite where you would like it, and hopefully the break can be what we need to get away from each other,\" Terry said. \"It's like a marriage. You might need time away to get back right. I've seen worse.\"Bickerstaff said it's on the coaches and players to solve this.\"[We're] just not willing to help each other out,\" Harden said. \"That's all it is. Everything, both ends of the floor. That's what a team is.\"Morey doesn't have a team right now. He has a dysfunctional group that must be put back together before the quickly evaporating season fades away. In some ways the season already has for the Rockets.\"Genuinely do we like to play with each other,\" Terry said. \"That's as simple as I can get it. X's and O's take care of itself. We're talking about basketball, and if you can't get five guys on the court that can function as a unit you're not going to have much success.\""},
{"url": "http://espn.go.com/nba/insider/story/_/id/14733862/5-5-experts-trade-deadline-western-conference-nba", "text": "Which West team will trade its way into title contention? And who will be the biggest name on the move? Our experts break down the most interesting storylines in the Western Conference heading into the Feb. 18 NBA trade deadline."},
{"url": "http://espn.go.com/nba/story/_/id/14758418/kobe-bryant-los-angeles-lakers-relieved-all-star-break-amid-myriad-aches", "text": "CLEVELAND --  star  didn't mince words about the state of his oft-injured 37-year-old body entering the All-Star break.\"[I] feel horrible,\" he said Wednesday after playing his final game in Cleveland,  to the  at Quicken Loans Arena. \"My ankles, knees, everything. This stretch couldn't come at a better time. My ankles hurt. My knees hurt. So I'm looking forward to having a complete week where I just do nothing.\"Bryant scored 17 points on 5-of-16 shooting in 33 minutes against the Cavaliers.Later, when Bryant rose from his chair after a postgame news conference, he groaned, \"Oh my god.\" He then gingerly walked toward a nearby door after sitting for nearly 12 straight minutes.Bryant, whose past three seasons have all been cut short by injury, announced his plans to retire this summer after his 20th NBA season.He was selected by fans to start for the Western Conference in the 2016 NBA All-Star Game in Toronto on Sunday. It was Bryant's 18th selection to the All-Star Game, the second-most behind fellow Laker legend 's 19.Bryant is expected to have a busy schedule leading up to the game, considering it's his last All-Star Game, but he said he'll work to manage his time carefully to help preserve his body.\"It is busy, but it's also very selective,\" he said. \"There's certain things that we'll do that's short bursts of appearances, but nothing too long, nothing where I'm on my feet for long periods of time. It's also the last one, so I try to enjoy it as much as I can. But it's no running, it's no pounding, it's none of that stuff. It's rest with plenty of ice baths in between.\"Lakers coach Byron Scott said he has spoken to Bryant about getting some rest during the break.\"It's going to be almost 24-7 [for him],\" Scott said. \"I'll probably go to bed at night wondering if he's getting any sleep at all and how he's going to feel for the next day.\"Scott said he trusts  coach Gregg Popovich, who is coaching the Western Conference All-Star team, to play Bryant sparingly.\"I know Pop is good,\" Scott said. \"So I know he'll handle it.\"Bryant is a four-time All-Star MVP -- in 2002, 2007, 2009 and 2011 -- tying him with Bob Pettit for the most all time. He dispelled any notion that he'll be gunning for MVP honors during the All-Star Game.\"Why?\" he said. \"I'm good. I'm good. I'm good.\"I'll make a couple jump shots and try to play the best I can, but I'm OK.\"In terms of what he wants to take from him his final All-Star Game, Bryant said he just wants to be around fellow players.\"Seriously, this is crazy,\" he said. \"Twenty years for me, that's more than half my life playing in the NBA and being in the locker room and looking [at]  like, when I first came in the league, I literally could've babysat this guy.\"And , I knew Klay when he was a young kid. And seeing the different generations, I'll be able to sit in the locker room and seriously just look at it all and smile and take it all in. This is truly amazing to be here after all these years and seeing so many young players come. This is cool, man.\"Bryant also recounted his first All-Star Weekend held in Cleveland in 1997, when he became the youngest slam dunk champion at 18 years old. He also played in the Rookie Challenge for the West team, coached by Red Holzman.\"I remember walking around the hotel, I remember walking around this arena and just running into great after great after great after great after great,\" he said. \"And I grew up watching all of these players. So I watched all the classic videos, the films, the books. To see these players all walking around, it was pretty amazing. Pretty amazing. To be coached by Red Holzman, that was as cool as it gets.\""},
{"url": "http://espn.go.com/nba/story/_/id/14759786/patrick-beverley-houston-rockets-hurt-defend-nba-all-star-skills-challenge-title", "text": "PORTLAND, Ore. --  point guard  will not defend his Skills Challenge title this weekend at the NBA All-Star Game because he reinjured his sprained left ankle, according to a source.After the Rockets' 116-103 loss to Portland on Wednesday night, Beverley was sitting at his locker icing the ankle. Beverley said he wanted to attend All-Star weekend in Toronto but needed to see how he felt physically on Thursday morning before a final decision was made.Beverley reinjured the ankle less than a minute into the second half but remained in the game. He finished with seven points in 31 minutes.Beverley has been bothered by the ankle most of the season. He has missed a total of seven games, during two different stretches, because of the injury."},
{"url": "http://espn.go.com/nba/story/_/id/14757135/kevin-love-cleveland-cavaliers-leaves-game-shoulder-injury", "text": "CLEVELAND --  forward  exited Cleveland's game against the  late in the first half on Wednesday with a left shoulder contusion and did not return.It is the same shoulder Love dislocated in the first round of the playoffs against the , causing him to miss the remainder of Cleveland's postseason run to the Finals.\"At the time I didn't know really what it was,\" Love said after the Cavs'  over the Lakers. \"Just like when you get hit in the funny bone, the elbow has shooting pain. It felt like fire was running down my arm. Just a stinger, and doctors decided we'll be cautious and use the break for it to feel better, but it actually feels OK right now.\"Cavs general manager David Griffin told ESPN's Lisa Salters that Love is not expected to miss much time. Griffin said the injury looked a lot worse than it is. Love told reporters he did not expect to miss any games.Wednesday marked the Cavs' last game before the All-Star break. Love, who was not selected to join  in Toronto, will have six days off to heal before Cleveland's next practice after the break.Love was injured while jostling with  in the post.\"I think I took two dribbles, and the second one just kind of jammed it up on Kobe,\" Love said. \"Kind of went to the bench and went straight to the locker room.\"While the energy was sucked out of Quicken Loans Arena for a few tenuous minutes with Love's status unknown,  said he did not overthink what another serious injury to Love could mean for the Cavs' chances this season.\"I felt like we got a great medical staff, and they was going to do whatever it took to help,\" James said. \"I was just wishing that it wasn't popped back out. I seen the play. It didn't look like there was any reason for it to be popped out, so I thought it would just be a stinger or whatever the case may be. It wasn't time, at that point in time, for me to hold my breath. I was still in the game, and we had to close out the quarter.\"Love's shoulder injury last postseason came while battling in the post against  of the . Coincidentally, Olynyk left Boston's win over the  on Wednesday with a shoulder injury.Love said team doctors advised him he could have postsurgery complications with his shoulder, even though it's healed enough for him to play for the last several months.\"I was told it could be a number of things, one being my stuff is anchored down pretty tight in there, and it will always kind of be like that,\" Love said. \"Getting full range of motion back, you can get to 90-95 percent, but getting that last little bit is always tough. It wouldn't be surprising if in the next couple days it loosens up on me and feels good.\""},
{"url": "http://espn.go.com/nba/story/_/id/14757505/markieff-morris-archie-goodwin-phoenix-suns-get-shoving-match-out", "text": "A disappointing season for the Phoenix Suns turned uglier Wednesday when teammates  and  got into a physical altercation on the bench.Morris and Goodwin were seen arguing during a timeout in their game against the . The argument escalated into a shoving match between Morris, who is 6-foot-10, 245 pounds, and Goodwin, who is 6-5, 200 pounds. Teammates quickly stepped in and separated the two.\"That was nothing. That was part of being a leader and big brother,\" Morris said after the team's . \"Of course it looks bad. Everything I do looks bad.\"Both players returned to the game. Morris finished with 19 points, eight rebounds and four assists in 36 minutes, and Goodwin added 20 points, two rebounds and two assists in 28 minutes. The Suns have lost nine straight and 24 of their last 26.Wednesday's episode was another low point for a Phoenix team many figured would compete for a spot in the playoffs. Instead, the Suns have been beset by injuries and drama, and Wednesday's loss dropped them to 14-40, the second-worst record in the Western Conference.Before the season even began, Morris expressed his displeasure with the franchise after his twin brother, , was traded to Detroit.A bad start and rough patch that saw the team lose 19 of 21 games cost coach Jeff Hornacek his job. Among the troubling moments for Hornacek was a Dec. 24 incident in which Markieff Morris threw a towel toward him on the sideline during a game. The Suns suspended Morris for two games.Hornacek was fired on Jan. 31 and replaced on an interim basis by assistant Earl Watson.Compounding those issues have been a rash of injuries that have hampered the team's desire to deploy its multiple-guard attack.Guard  (knee) and small forward  (foot) were lost to season-ending injuries, and guard  has been out since mid-January with a groin injury."},
{"url": "http://espn.go.com/nba/story/_/id/14758568/interim-coach-jb-bickerstaff-calls-houston-rockets-broken-team", "text": "PORTLAND, Ore. --  interim coach J.B. Bickerstaff said Wednesday night that he is coaching \"a broken team,\" and veteran guard  said the team has chemistry issues.The Rockets enter the All-Star break at 27-28 after  to the  on Wednesday night.\"We're broken,\" Bickerstaff said. \"It's that simple. We're a broken team, and we all need to use this break to figure out how we're going to impact change. If we don't want to impact change, then we need to be made aware of that, too, and we'll go in a different direction.\"We can't continue to go out and play this way. It's easy to see it's a fragmented bunch. You can't win that way.\"The Houston Chronicle reported that after the loss, Rockets center and guard met with general manager Daryl Morey and Bickerstaff \"long into the night\" to discuss the team's woes.The Rockets won 56 games last season and reached the Western Conference finals before losing to the eventual champion  in five games.With expectations raised, the Rockets got off to a 4-7 start, leading to the firing of coach Kevin McHale.Under Bickerstaff, the Rockets have gone 23-21, and the loss to the Blazers pushed them from the seventh seed in the West to ninth.\"If you look at it, the chemistry is not quite where you would like it, and hopefully the break can be what we need to get away from each other,\" Terry said. \"It's like a marriage. You might need time away to get back right. I've seen worse.\"Howard, when told about Bickerstaff's comments, said he didn't want to talk negatively about his team. Howard did say he is shocked by the Rockets' record and noted that his teammates have to start playing together.When asked what about the team is broken, Howard said, \"I'm not going to talk about what's broken. It's all we do is we talk about the issues that we have. Nobody is being positive.\"Harden, the Rockets' leading scorer, said Bickerstaff told the team it was broken after Wednesday's loss. Harden said he didn't know how to fix it.However, Morey told ESPN that, considering the expectations, he is disappointed in the performance of his team.\"We're obviously not playing at a level we need to be,\" Morey said. \"We will keep battling until we are.\""},
{"url": "http://espn.go.com/nba/story/_/id/14756588/ingrid-williams-wife-thunder-assistant-coach-monty-williams-dies-44", "text": "Ingrid Williams, the wife of  assistant coach Monty Williams, is dead at age 44, the team announced Wednesday.Ingrid Williams was involved in a car accident Tuesday night in Oklahoma City when she was hit head-on by another car that crossed over the center lane. She was taken to a hospital and died Wednesday evening from injuries suffered in the crash. The driver of the other car was pronounced dead at the scene.\"The Thunder organization has heavy hearts tonight with the news of Ingrid's passing,\" the team said in a statement. \"Words cannot adequately describe how deep our sorrow is for the loss of Monty's wife. Our thoughts and prayers are with Monty and his family, and we will support him in every way possible. We know the entire community of Oklahoma City has them in their prayers.\"Before joining the Thunder coaching staff, Monty Williams served as ' head coach from 2010 to 2015. He and Ingrid Williams have five children with ages ranging from 5 to 17 years old.\"The New Orleans Pelicans are devastated to hear the news of Ingrid Williams' passing,\" the Pelicans said in a statement. \"Ingrid was beloved by the Pelicans organization and the New Orleans community and will forever be remembered as one of the most generous, kind and humble individuals we've ever known. Our thoughts and prayers are with Monty Williams and his family during this difficult time.\"Pelicans star  took to Twitter to send his condolences.Davis' teammate  also sent his best to the Williams family.The Thunder were off Wednesday night but play at New Orleans on Thursday.Alvin Gentry, who replaced Monty Williams as Pelicans coach, said the team said a prayer for Williams' family in the locker room before Wednesday night's game, and the arena's public address announcer asked for a moment of silence before tipoff.\"The players that were here with Monty and their family definitely felt it,\" New Orleans point guard  said after a  over . \"Obviously we're all blessed to play the game of basketball, but family comes before that. And I know most of the guys were thinking about our families, thinking about his family.\"Monty Williams played three seasons with the  and served there as a coaching intern. The news of Ingrid Williams' death almost led Spurs coach Gregg Popovich to not coach his team's game Wednesday.An emotional Popovich walked out of the locker room several minutes after San Antonio's  over the  with a tissue in one hand, tears in his eyes and remnants of tears wiped away as he addressed the media.\"I'd rather talk about basketball,\" Popovich said. \"The personal stuff's none of your business.\"Popovich changed clothes and later re-entered the locker room. He walked over to , who had been coached by Williams, and the two shared a private moment.'s last-second jumper gave the Spurs their sixth consecutive victory, and their 20th win in their last 22 games, but the locker room afterward was a somber place.\"Coach [Williams] was a Spur,\" guard  said. \"He's still a part of our family, and my prayers go out to him and his family.\" coach Doc Rivers also had a close relationship with the Williams family.\"Monty Williams and his wife, Ingrid, I've known them since I was married,\" Rivers said after the Clippers'  to the . \"So I don't know if -- there's no words. There really isn't. I am heartbroken. I'm sick to death. Once again it puts this stuff we do in perspective. This is awful. Obviously our love and support and all that, but sometimes that doesn't seem fair. There's no better human being in the world than Monty and Ingrid, and for this to happen, sometimes you question everything, and this is one of those times for me at least.\" coach Mike Malone said he is a friend of Monty Williams and that the news of Ingrid's death affected him during his team's  over .\"I apologized to the team. The first half, I coached very angry,\" Malone said. \"I don't know if you guys heard, Monty Williams, a good friend of mine, his wife was killed in an accident.\"After a long pause, he said, \"So I apologized to them because it's taking my anger out on them, and they don't deserve that.\""},
{"url": "http://espn.go.com/espn/feature/story/_/id/14747243/all-nbarank-animated-gifs", "text": ""},
{"url": "http://espn.go.com/nba/story/_/id/14758038/joe-johnson-brooklyn-nets-sees-consecutive-field-goal-streak-end-937-games", "text": "NEW YORK --  guard 's streak of games with at least one field goal ended at 937 games after he missed all three of his shots and was held scoreless in 23 minutes during Monday night's  to the  on Wednesday night at Barclays Center.It had been the longest active streak in the NBA and, according to the Elias Sports Bureau, was the eighth-longest in NBA history.\"I don't even know what to tell you,\" a frustrated Johnson said when asked to put the streak in perspective. now has the longest active streak at 854 games, according to Elias, and the '  holds the all-time record, having made a field goal in 1,310 consecutive games.The last time Johnson had been held without a field goal was Dec. 6, 2003, when he was with the  in a game against New Jersey, according to data from basketball-reference.com.Now 34, Johnson was just 22 that night and went scoreless on 0-for-4 shooting in 17 minutes.Johnson has had just 19 games played without a field goal in his 15-year career.He is currently 52nd on the all-time scoring list, just 51 points shy of 19,000 for his career.\"That's sad; he's a great pro, but obviously it wasn't his best night,\" Nets coach Tony Brown said. \"We were trying to do some things to start the third and get him some opportunities, but he came up short. Unfortunately, I hate to be the one to break that, but I wish I could've gotten him some more touches.\""}]