[{"url": "http://www.foxsports.com/nba/story/stephen-curry-lebron-james-kobe-bryant-twitter-hashtag-emojis-nba-all-star-game-2016-toronto-021116", "text": "\nThe NBA as a whole has done a fantastic job of sinking its claws into social media. From letting fan-ripped highlights flourish to official team accounts that add to the fun of the game, it's a great time to be an online fan of basketball.\nAnd if you're one of the countless people who engages with the NBA on Twitter, the league unveiled a special gift for you on Thursday night: Hashtags for the 2016 Toronto All-Stars which display emojis for Stephen Curry, LeBron James, Kevin Durant, and the rest of this year's squads — along with an added set for some of basketball's most famous broadcasters:\nThat wasn't enough for Twitter users, however. They took it upon themselves to suggest a few additional options for players past and present, plus one former coach:\nIt's nice to know that as the world keeps changing, the one thing you can count on is Basketball Twitter having jokes for days."},
{"url": "http://www.foxsports.com/nba/story/stephen-curry-yearbook-photo-021116", "text": "\n superstar  has won nearly every individual award except the NBA All-Star Game MVP trophy, an award he's a favorite to pick up this weekend in Toronto. Curry spent part of his childhood in Toronto while his father Dell played for the Raptors, and The Globe and Mail dug up an old yearbook photo from Queensway Christian College. As an eighth-grader, Curry led the team to an undefeated season, and in 2002 was already thinking about going pro.\nCurry's former coach James Lackey said that Curry was making the normal shooting drills look so easy that he let him shoot from a longer range than anyone else.\nVia :\n"},
{"url": "http://www.foxsports.com/nba/story/kobe-s-last-toronto-s-1st-as-nba-all-star-goes-outside-us-021116", "text": "\n TORONTO (AP) Of all the goodies  collects in his farewell season, one this weekend might be particularly useful.\n After all, you need a good winter coat in Canada. Though Bryant probably wouldn't be too unhappy walking away another All-Star Game MVP trophy.\n The final NBA showcase for Bryant and the first to be staged outside the U.S. is in Toronto, the city that staged the first NBA game 70 years ago and is so enthusiastic for basketball now that it could no longer be ignored no matter what the thermometer says.\n ''I think it's going to be bonkers,'' former Raptors superstar Vince Carter said.\n ''I think it's overdue. It's a great city. I think they'll be a great host and I think guys are going to have a lot of fun. It's going to be cold.''\n Frigid, actually.\n A relatively mild winter by Canada's standards will be nothing but a warm memory this weekend, when Saturday's forecast is for temperatures near zero degrees and far below it with the wind chill. The players can cover up with the parkas Canada Goose, maker of cold weather outerwear, designed for them.\n The NBA long sought warm-weather locations for its winter road trip, and cities that had a good chance for a white Christmas generally had little hope of getting All-Star weekend.\n But Toronto, where the Toronto Huskies and New York Knicks played on Nov. 1, 1946, in Maple Leaf Gardens and is so passionate about its Raptors that general manager Masai Ujiri was fined a couple years ago for using an expletive about playoff opponent Brooklyn - with Commissioner Adam Silver in attendance - is ''an ideal host,'' Silver said.\n ''There is a special energy and excitement around All-Star this year, and we're looking forward to four days of great events that honor our marquee players and legends, celebrate the game, and provide loads of excitement for our fans,'' Silver said.\n If Bryant heats up, he could add a fifth All-Star Game MVP award to his collection.\n The events kick off Friday, the slam dunk and 3-point contests are Saturday and the game is Sunday night.\n ---\n Some things to watch this weekend:\n BRYANT'S BEST? Bryant is a four-time MVP of the All-Star Game and its career scoring leader - though now just two points ahead of LeBron James. Does the 18-time All-Star's aching body have enough left at 37 for one more vintage performance? ''Knowing Kobe as well as I do, I'm sure if he gets going, and the guys get him going, you know the crowd's going to want it to happen; certain players are going to want it to happen,'' former teammate Shaquille O'Neal said in remarks provided by TNT. ''If he can find his stroke and get it going a little bit, I can guarantee you he's going to go for the MVP. It's his last one? Why not go out with a bang?''\n THEY'VE GOT SKILLS: The NBA announced the bracket Thursday for Saturday's Skills Challenge, the event that combines dribbling, passing and shooting and this year features a number of big men in a field that traditionally is for guards. A big guy is guaranteed to reach the final. All-Stars Anthony Davis and DeMarcus Cousins meet in the first round, with the winner to face All-Star Draymond Green or rookie Karl-Anthony Towns in the semifinals. The little guys are on the other side: Denver's Emmanuel Mudiay vs. All-Star Isaiah Thomas, and the Lakers' Jordan Clarkson against Portland's CJ McCollum.\n GOOD GAME? The early part of the All-Star Game is always about showing off sneakers and dunks, but count on it becoming competitive down the stretch. The last six games have been determined by an average of 4.7 points. ''We've been actually fortunate in recent years. Despite the highlight-type schoolyard play early on we've had some good games down the stretch and obviously that's what we hope for,'' said Marv Albert, who will call the game on TNT.\n NO VINSANITY: Carter, now playing for Memphis, is the Raptors' career leader with 23.4 points per game and a former slam dunk champion. But he won't be in the city he called the NBA's ''best-kept secret,'' instead spending his break watching his daughter play in a tennis tournament. ''It's just bad timing because I know it's going to be epic and I would love to be there,'' he said. ''It's just daddy duties first.''"},
{"url": "http://www.foxsports.com/nba/story/shaq-wishes-he-had-a-farewell-tour-like-kobe-is-getting-021116", "text": "\n TORONTO (AP) Shaquille O'Neal says he wishes he could have had a farewell tour at the end of his career similar to the one former teammate  is enjoying now.\n O'Neal held court in Toronto before TNT's popular ''Inside The NBA'' television show Thursday night as the NBA prepared to kick of its All-Star weekend. He reminisced about his time with Bryant, the  star who is retiring at the end of the season.\n O'Neal was forced to retire in 2011 at the age of 37 after tearing his Achilles. He says he would have enjoyed being able to say goodbye to the fans and teams in each city, but he wasn't healthy enough to play the one more season he planned on.\n Bryant was voted a starter for the West team on Sunday."},
{"url": "http://www.foxsports.com/nba/story/kobe-bryant-peyton-manning-retirement-los-angeles-lakers-denver-broncos-021216", "text": "\nJust a week after  won his second and we can only assume final Super Bowl, Kobe Bryant will step onto the floor at the Air Canada Centre in Toronto to play his 18 and final NBA All Star Game.\nThe superstars who were drafted into their respective leagues two years apart are now walking off the stage at the same time, both of their aged bodies breaking down, both only shadows of the players who were the faces of a sporting era.\nAnd yet the two icons could not be exiting in a more different fashion.\nI’m not just talking about Peyton’s last season – and I’m going to hope and pray and beg that he makes this his last rodeo – ending in the Lombardi Trophy and Kobe’s last season winding down in embarrassing fashion.\nI’m talking about the way each of these men chose to approach the end.\nA debilitated Peyton reinvented himself, not as a superstar but as a game manager who didn’t let his own deficiencies get in the way of an all-time great defense. He set his ego aside. He knew that 55-touchdown pass seasons were in his past, so he dinked and dunked the  through the playoffs and to the Super Bowl. He didn’t try to do what he was no longer physically able to do. What had been a career defined by monstrous regular-season stats and failings in the playoffs turned into a season defined by ugly regular-season stats and doing just enough to let his teammates burst through the playoffs and win it all. The former superstar got as close as an NFL quarterback can get to becoming a role player, and in so doing he wrote a fitting final chapter to his Hall of Fame career.\nAnd Kobe?\nWell. Kobe is Kobe. Kobe is an all-time great. Kobe won five rings for the Los Angeles Lakers by working harder than anyone else, by demanding the ball, by knowing that he was the best player on the floor and by willing his teams to victory. Kobe was the NBA’s biggest Alpha Male since Michael Jordan and the most successful player since Jordan as well.\nBut when Kobe’s powers left him in his late 30s, he could not adjust. He could not cede to teammates and become a bit player. He could not put the franchise he’d brought so much past glory before the glory he still needed for himself.\nIt’s something that was entirely predictable from Kobe Bean Bryant: When it was time to step aside and be a role player – when it was time for him to do what Peyton did for the Broncos – he could not.\nUnlike Peyton, who demurred at several opportunities to announce his retirement in the lead-up to and immediate aftermath of the Super Bowl, Kobe made his final season all about himself. He is in the midst of a much-deserved but terribly narcissistic farewell tour. He held his franchise hostage in the final years of his career – not just because of his league-high $25 million salary that gave the Lakers little roster flexibility but because of his insistence that the Lakers were still all about Kobe. In truth, Kobe was all about hurting the franchise he had become synonymous with.\nLook at his final Lakers team. It is an embarrassing 11-44, last in the Western Conference, second-worst record in the league next to the Sixers.\nWorse still, Kobe’s ego has set the Lakers back a couple years in what should have been a swift rebuild. His need to still play a starring role has sullied an entire season of development for young and promising players like D’Angelo Russell and Julius Randle. He’s hogging the minutes and the attention. He’s teaching the kids bad, ball-dominating habits that could prove difficult to unteach.\nI don’t need to give you too many statistics to grasp the totality of Kobe’s struggles this season, but I will anyway. His player efficiency rating ranks 163 in the league, sandwiched between that of Shabazz Muhammad and Tiago Splitter. Not counting his injury-shortened 2013-14 season, he is averaging fewer points per game than he has in any season since 1997-98, when he still came off the bench in his second year as a pro. Kobe ranks 145 in VORP (value over replacement player), right between Brandon Bass and Michael Carter-Williams. The Lakers rank last in the league in effective field-goal percentage, and much of the blame for that falls to Kobe.\nThis is not Michael Jordan going to the Washington Wizards. This isn’t Joe Montana going to the Kansas City Chiefs. This is different because Kobe is holding back the same franchise that he brought so much glory.\nIt’s not all Kobe who is to blame. Who wouldn’t take all the money he could get? Who wouldn’t soak in the adulation on his way out? Head coach Byron Scott deserves some blame for ceding total control to the team’s ex-superstar’s ego instead of to future stars. General manager Mitch Kupchak deserves some blame for allowing this dynamic to consume the franchise for two full seasons.\nA Kobe Bryant Farewell Tour would have been unassailable if it looked more like the Kevin Garnett Farewell Tour: featuring more of a player-coach than the superstar, someone who can set an example for the youngsters and set his own ego aside.\nA Kobe Bryant Farewell Tour would have been great if it had looked like the Peyton Manning Farewell Tour: not an abysmal curtain call for a fading great but a reinvention of an all-time talent.\nBut Kobe is not one to fade into the background. It is not in his DNA. The mindset that made him a once-in-a-generation player in his prime is also the mindset that makes him incapable of finding a new and lesser role now that he no longer can deliver the goods.\nKobe recently joked about how much he hates that the Lakers “suck” during his final season.\nWhat Kobe should hate much more is exactly how much of that is his fault.\n"},
{"url": "http://www.foxsports.com/nba/story/lamar-odom-makes-appearance-at-kanye-west-fashion-show-021116", "text": "\n NEW YORK (AP) Lamar Odom made his public return at brother-in-law Kanye West's New York Fashion Week show on Thursday.\n Odom's appearance marked the first time he'd attended a public event since he was hospitalized in critical condition in Las Vegas in October 2015 after he was found unconscious at a Nevada brothel with cocaine in his system. Odom, who is estranged from Khloe Kardashian, had been moved from a Los Angeles hospital to a private facility in January.\n As West walked Odom to his seat with the Kardashian and Jenner families, the crowd at Madison Square Garden for West's Yeezy runway show cheered and shouted Odom's name."},
{"url": "http://www.foxsports.com/nba/story/jerseys-advertisements-ads-corporate-logos-owners-players-lockout-021116", "text": "\nIf you take in the NBA All-Star Game on Sunday, you'll likely notice that the jerseys are unlike anything you see during the regular season. And, yes, a big part of that will be the different design aesthetic. More importantly, though, the jerseys in Toronto worn by the likes of  and  will feature an advertisement in the form of a patch on the front of the jersey.\nAccording to a report on Thursday, it likely won't be the last time you see such an ad, however, as the league's owners will meet to discuss the future of corporate logos on jerseys ():\nThe money won't go just to the owners, however. Because the jerseys are considered part of basketball-related income under the collective bargaining agreement, they'll be subject to the league's revenue-sharing rules.\nWhile the possibility of the NBA's putting ads on regular-season jerseys has been discussed for years,  helped set the stage for Sunday's patch and any future ads. Before the 2014-15 season, the league shifted the logo patch from the upper left front of the jersey to the back. The former location is reportedly where any proposed ads would be placed, as seen in this year's All-Star jerseys."},
{"url": "http://www.foxsports.com/nba/story/lebron-james-cleveland-cavaliers-021116", "text": "\nEven with LeBron James, Kyrie Irving and Kevin Love on their roster, the  are still one move (or two) away from forming a squad that's versatile and deep enough to win the NBA championship. \nIn order to topple the Golden State Warriors, the Cavaliers need at least one more wing, ideally someone who can create his own shot, knock down open 3s, go off the dribble and defend multiple positions. Those players are rare and in high demand throughout the league, but Cleveland has its sights on a few helpful options, including Atlanta Hawks guard Kyle Korver and Sacramento Kings guard Ben McLemore. But the most interesting (and realistic) option might be Brooklyn Nets forward Joe Johnson ():\nJohnson turns 35 in June and is averaging his fewest points per game since 2003. (Did we mention he's old?)\nBut the seven-time All-Star remains useful; Brooklyn's offense is a remarkable 9.8 points per 100 possessions better with him on the court. \nIt's unclear who he'd guard in a seven-game series against Steph Curry and Golden State, but as a dependable offensive option off the bench, it's not hard to picture him having a meaningful moment or two. He hits big shots, and would help, more than hurt, the Cavaliers on their path to a title."},
{"url": "http://www.foxsports.com/southwest/story/thunder-hold-moment-of-silence-for-monty-williams-wife-021116", "text": "\nOKLAHOMA CITY (AP) -- The  held a moment of silence for assistant coach Monty Williams' wife before their game against the  on Thursday night, a day after she died following a car crash.\nWilliams coached New Orleans last season, and the Pelicans also held a moment of silence for Ingrid Williams before their game Wednesday night against Utah.\nThe family's pastor, Dr. Mark Hitchcock of Faith Bible Church in Edmond prayed for the family.\nThunder star Kevin Durant was overcome with emotion as he reflected after the morning shootaround.\n\"Just love Coach Monty so much, man,\" Durant said. \"I feel for him, man. It's somebody we all love.\"\nThunder coach Billy Donovan said it would be different Thursday without Williams to his right, but the team had no choice but to prepare for the game.\n\"I thought our group this morning was as good as it could be coming in,\" Donovan said. \"Everybody, I think, personally, is hurting for Monty and his family. Just trying to have faith right now that Ingrid is in a better place, and hopeful that our guys will come out there and play to the best of their ability.\"\nIngrid Williams, 44, was involved in a crash Tuesday night. An oncoming car crossed the center line and hit her SUV just outside of downtown Oklahoma City, said police Capt. Paco Valderrama. That driver was pronounced dead at the scene, Valderrama said.\nMonty Williams was hired by New Orleans to his first and only head coaching job in 2010 and fired after last season. He helped guide the Pelicans to the postseason twice and had a record of 173-221.\nPelicans star Anthony Davis spent three seasons with Williams as his coach and said Ingrid Williams was important, too. He said in a tweet: \"Completely devastated. Ingrid Williams was like a 2nd mother to me when I got to NOLA. My thoughts & prayers are with Monty & the family.\"\nFirst-year Pelicans coach Alvin Gentry said Ingrid's impact was significant. It really affected his team as it prepared for its game Wednesday night, and the players were still dealing with it Thursday.\n\"It was really difficult for our guys to get through it because he (Monty Williams) has had such an impact on the players, and she had even more of an impact, maybe, with the mothering that she did for most of the guys and the type of person that she was,\" Gentry said. \"She wanted everybody to feel like they had a home away from home.\""},
{"url": "http://www.foxsports.com/nba/story/bucks-go-into-all-star-break-with-99-92-win-over-wizards-021116", "text": "\n MILWAUKEE (AP) Khris Middleton scored 27 points, Giannis Antetokounmpo had 17 points and 13 rebounds, and the  held off the  99-92 on Thursday night.\n Middleton scored 14 points in the final quarter, giving the Wizards trouble off the dribble and from the perimeter.\n Washington got within three when John Wall made a long 3-pointer from the wing with 1:15 left. But Middleton answered again, hitting a jumper in the lane on the next possession before setting up a drive-and-dish to Greg Monroe that gave the Bucks a 97-90 lead with 15 seconds left. Middleton tied a season high with nine assists.\n Bradley Beal scored 19 points for the Wizards, and Wall had 15 points and 10 assists."},
{"url": "http://www.foxsports.com/nba/story/thunder-beat-pelicans-teams-mourn-ingrid-williams-death-021116", "text": "\n OKLAHOMA CITY (AP) Russell Westbrook just missed a triple-double, and the  beat the  121-95 on Thursday night, a day after Thunder assistant and former Pelicans head coach Monty Williams' wife died.\n Ingrid Williams was involved in a car crash Tuesday night in Oklahoma City and died Wednesday. A moment of silence was observed for her before the game. Monty Williams coached the Pelicans last season before coming to Oklahoma City to help new coach Billy Donovan.\n Westbrook had 23 points, 10 assists and nine rebounds. Kevin Durant scored 23 points, and Serge Ibaka added 18 for the Thunder. They have won 14 of 16 heading into the All-Star break.\n Anthony Davis and Jrue Holiday each scored 23 points for the Pelicans."},
{"url": "http://www.foxsports.com/nba/story/nba-capsules-021216", "text": "\n OKLAHOMA CITY (AP) Playing with a heavy heart a night after  assistant and former Pelicans coach Monty Williams' wife died, Russell Westbrook led Oklahoma City to a 121-95 victory over New Orleans on Thursday.\n Ingrid Williams was involved in a car crash Tuesday night in Oklahoma City and died Wednesday. A moment of silence was observed for her before the game. Monty Williams coached the Pelicans last season before coming to Oklahoma City to help new coach Billy Donovan.\n Westbrook had 23 points, 10 assists and nine rebounds. Kevin Durant scored 23 points, and Serge Ibaka added 18 for the Thunder. They have won 14 of 16 heading into the All-Star break.\n Anthony Davis and Jrue Holiday each scored 23 points for the Pelicans.\n Westbrook got his 10th assist on Ibaka's 3-pointer that gave the Thunder a 79-65 lead. Westbrook had his ninth rebound with just under 3 minutes to go in the third quarter before heading to the bench for his usual rest and the Thunder ahead 86-68.\n  99, WIZARDS 92\n MILWAUKEE (AP) - Khris Middleton scored 27 points, Giannis Antetokounmpo had 17 points and 13 rebounds, and Milwaukee held off Washington.\n Middleton answered again, hitting a jumper in the lane on the next possession before setting up a drive-and-dish to Greg Monroe that gave the  a 97-90 lead with 15 seconds left. Middleton tied a season high with nine assists.\n Bradley Beal scored 19 points for the Wizards, and John Wall had 15 points and 10 assists."},
{"url": "http://www.foxsports.com/nba/story/lamar-odom-makes-appearance-at-kanye-west-fashion-show-021216", "text": "\n NEW YORK (AP) Lamar Odom made his public return at brother-in-law Kanye West's New York Fashion Week show on Thursday.\n Odom's appearance marked the first time he'd attended a public event since he was hospitalized in critical condition in Las Vegas in October 2015 after he was found unconscious at a Nevada brothel with cocaine in his system. Odom, who is estranged from Khloe Kardashian, had been moved from a Los Angeles hospital to a private facility in January.\n As West walked Odom to his seat with the Kardashian and Jenner families, the crowd at Madison Square Garden for West's Yeezy runway show cheered and shouted Odom's name."},
{"url": "http://www.foxsports.com/nba/story/stephen-curry-golden-state-warriors-charles-barkley-021216", "text": "\nSomehow, someway, Charles Barkley remains somewhat skeptical of Steph Curry and the . Despite the fact that he's a defending NBA MVP who's widely accepted as the best basketball player alive, thriving on a team that might be the best in league history, Barkley still isn't convinced of Curry's all-around greatness ():\nSo, is Curry \"just a shooter\"? If you've ever watched him play, you know the answer is \"no.\"\n, just over 20 percent of all his field goal attempts occur within three feet of the hoop, and he's making a career-high 68.9 percent of them. \nHis free-throw rate has never been higher, and his 6.9 assists per game career average is sixth highest among all active players. Curry's handle is that of a magician, and he's able to get wherever he wants, whenever he wants, however he wants. \nNo disrespect to , but that guy is \"just a shooter,\" someone who stands in the corner and melts into a puddle when asked to do anything but launch wide open jumpers.\nCurry is a transcendent all-around talent who just so happens to be the best shooter the sport has ever seen. He deserves applause every second of every day—not doubt. "},
{"url": "http://www.foxsports.com/nba/story/bucks-go-into-all-star-break-with-99-92-win-over-wizards-021216", "text": "\n MILWAUKEE (AP) Khris Middleton's role on the  has evolved from catch-and-shoot perimeter player to crunch-time playmaker.\n A matchup problem as a 6-foot-8 forward who plays in the backcourt, Middleton did more damage Thursday night against the  by attacking the bucket and finding open teammates.\n Middleton scored 27 points, Giannis Antetokounmpo had 17 points and 13 rebounds, and the Bucks held on for 99-92 win to head into the All-Star break on a high note.\n ''Yeah, we look at Khris as our best player, our best scorer,'' teammate Jabari Parker said. ''He opens up a lot of areas for us, and we're going to depend on him.''\n Especially in the final quarter, when Middleton had 14 points and five assists.\n He's not just a catch-and-shoot player anymore. Expectation rose in the offseason when Middleton signed a five-year contract worth $70 million.\n Against Washington, Middleton was 1 of 3 from 3-point range, but 9 of 17 overall. Middleton also tied a season high with nine assists.\n ''Sometimes, you want to put guys in position (for more responsibility), you want to see if they grab it - and he's grabbing it,'' coach Jason Kidd said.\n Bradley Beal scored 19 points for the Wizards, and John Wall had 15 points and 10 assists.\n Washington got within three when Wall made two free throws with 1:36 left.\n But Middleton answered again, hitting a jumper in the lane on the next possession before setting up a drive-and-dish to Greg Monroe that gave the Bucks a 97-90 lead with 15 seconds left.\n ''He was being aggressive,'' Wall said. ''When a guy gets in a rhythm, it's kind of hard to stop. He's always been a person that's scored well against us.''\n HITTING WALL\n Washington's star guard played with a sore right knee after he said he collided with Milwaukee's O.J. Mayo in the first quarter. Wall said he would get treatment for the All-Star game this weekend and will play ''unless he can't move.''\n BREAK TIME\n The Wizards go into the All-Star break 3-7 in their last 10 games.\n The Bucks will take a modest but badly-needed two-game winning streak into the break. At 22-32, Milwaukee needs to inch back closer to .500 before it can start thinking about making a run at a second straight playoff appearance.\n UP AND DOWN\n Sparked by better defense, the Wizards rallied from an 11-point deficit late in the second quarter to turn it into a tight contest after halftime.\n Milwaukee used a 25-5 surge in an eight-minute span to help build a 55-44 lead with 45 seconds left in the second quarter. Jabari Parker scored 12 points during that quarter, when the Bucks made their run using primarily a three-guard lineup that attacked with the ball.\n ''I was just sitting here trying to contemplate on what actually happened, like how did we lose the game?'' Beal said. ''I feel like we came out aggressively, came out and played the right way in the first and third quarters, and I guess the second and fourth they made bigger plays than we did.''\n STAT PACK\n A 58-38 rebounding advantage for the Bucks hurt the Wizards, as did Washington's 6-of-32 night from the 3-point line.\n ''We didn't attack,'' coach Randy Wittman said. ''Bradley did the last couple of minutes and he got to the rim. We didn't do enough of that in the fourth quarter.''\n JUST JABARI\n Parker finished with 17 points and shot 7 of 11 from the field, playing a season-high 41 minutes. He's showing no ill effects from the left knee injury that sidelined him in December of his rookie season in 2014-15.\n TIP-INS\n Washington: Wall had his 30th double-double of the season. ... The Wizards went 0 of 10 from the field with three turnovers during the Bucks' second-quarter run.\n Milwaukee: Bucks co-owner Marc Lasry is taking part in the All-Star celebrity game Friday in Toronto. Asked before the game if the boss was ready, Kidd said with a straight face: ''That's a very good question. We'll see if he needs the asthma inhaler.'' ... O.J. Mayo was assessed a flagrant foul after Washington's Otto Porter Jr. fell hard to the floor on a layup attempt with 10 minutes left in the third quarter.\n UP NEXT\n Washington: Hosts Utah on Feb. 18.\n Milwaukee: Hosts Charlotte on Feb. 19.\n ---\n Follow Genaro Armas at http://twitter.com/GArmasAP"},
{"url": "http://www.foxsports.com/nba/story/nba-all-star-weekend-highlights-canada-s-growing-hoops-love-021216", "text": "\n TORONTO (AP) When Greg Anthony arrived in Vancouver to join the inaugural Grizzlies team in 1995, the cash in his pocket wasn't the only currency that he needed to exchange.\n Anthony was a star in college at mighty UNLV and went to the NBA to play for the Knicks, who took a backseat to nobody in New York during those playoff days.\n In hockey-mad Canada, it was another story. There was no star treatment for hoop stars and no real understanding of the game. Local and national publications had to run basic tutorials that explained the rules of the basketball to fans.\n ''I don't want to say it was humbling, but to a certain degree it was. To go there where it was kind of a Basketball 101 for so many people,'' said Anthony, now an analyst for NBATV. ''We all want to feel like what we do matters. It took a while for it to really matter for the vast majority of people in Vancouver.''\n Basketball has finally carved out a much higher profile in the country's sports consciousness, albeit 20 years after Anthony first set foot in Canada as part of the NBA's initial in-roads into the country.\n The Grizzlies lasted only six seasons in Vancouver, but as the NBA's All-Star weekend kicks off on Friday night in Toronto, it offers Canadian basketball its first opportunity to really show the rest of the world how far the game has come.\n Canada is ready for its closeup.\n ''You could put it up there with some of the biggest moments in Canadian basketball history,'' said Dan McKenzie, vice president and general manager for NBA Canada.\n That list isn't incredibly long. The , the other team to break into the league with the Grizzlies in `95, have lived a largely unremarkable NBA life with only one playoff series victory in franchise history.\n Like the Grizzlies, the Raptors early days were difficult, with players and coaches often expressing reluctance about coming and staying north of the border.\n My, how times have changed.\n On the 125th anniversary of the invention of the game, the NBA is holding its midseason gala outside of the United States for the first time.\n It comes during a period of rebirth for the Raptors, who have galvanized under the leadership of general manager Masai Ujiri and coach Dwane Casey. All-Stars in Kyle Lowry and DeMar DeRozan have led the team to the second-best record in the Eastern Conference at the break, giving their dedicated and vocal fan base reason to pack the Air Canada Center.\n There are 12 Canadian-born players in the NBA, more than any other country outside the United States. And budding young stars Andrew Wiggins and Tristan Thompson have helped put Canada's national team on the map in international competition.\n Television viewership of NBA games has doubled over the last three years, bolstered by an influx of immigrants from basketball-hungry nations like China and the Philippines.\n ''I can't express to you how far Canada Basketball has come,'' said Raptors guard Cory Joseph, a native of Toronto. ''It's going to be a crazy atmosphere. I feel like it's going to inspire the youth around town, inspire the whole country and hopefully it just skyrockets from here even more.''\n Canada is home to Dr. James Naismith, who invented the game, former two-time MVP Steve Nash and even, for a couple of years in his youth, reigning MVP Stephen Curry, who has emerged as the new face of the league. Curry's wife Ayesha is Canadian as well.\n ''I'm very familiar with the entire scene there,'' said the Golden State Warriors guard. ''I know where my house, where we used to live, Lakeshore Avenue. We drive by it from the airport to the hotel we're staying at. ... My wife's extended family all live there, she's from there, so a lot of sentimental value to going back.''\n Even Charles Barkley - noted lampooner of NBA cities like San Antonio and Oklahoma City - likes Toronto.\n ''I think it's one of the best-kept secrets in the world,'' said Barkley, the Hall of Famer and TNT analyst. ''I think it's one of the best cities in the world. They're amazing fans. You saw this year in the playoffs. You saw how crazy that place was. I think it's going to be great to shine a light on that city.''\n When he contemplates the moment that is about to arrive, Tas Melas - a longtime Raptors fan who now is co-host of ''The Starters'' on NBATV - said it sends shivers down his spine to think about where things were in the team's formative years. That's when the NBA was buried in the sports pages and deep into the nightly highlight shows in Canada.\n ''It's something no one saw coming 20 years ago when this all started,'' Melas said. ''It was just a lot of dark times. ... The reputation of the city was really lousy and it was a bit of a joke in the NBA world. This is just a huge mark of validation.''\n Most believe Vince Carter's high-flying act saved the Raptors from possible relocation at the turn of the century and got a whole generation of youngsters to pick up a basketball for the first time.\n Wiggins, the NBA's rookie of the year last year who is having another strong season for the Minnesota Timberwolves, was one of those youngsters. He will participate in the Rising Stars Challenge on Friday night, part of weekend of activities that could inspire the next generation of Canadians.\n ''People (in Canada) have never got a chance to experience something like that before, especially the younger generation,'' Wiggins said. ''Unless you're there to witness it, you don't really know how it is. It's one thing to watch it on TV and another thing watching it live in person.''\n ---\n AP Sports Writer Janie McCauley, in Oakland, contributed to this story."},
{"url": "http://www.foxsports.com/nba/story/dwight-howard-kobe-bryant-trade-rumors-deadline-021116", "text": "\n is never one to pull punches, especially earlier in his career. So when the  landed  in an offseason trade in 2012, it was only a matter of time that Kobe's patience for the fun-loving big man would run thin.\nEventually, it did.\nTheir friction hamstrung a Lakers team that many believed would make a deep run in the playoffs;  was bounced in the first round. Kobe's win-at-all-costs mentality didn't mesh with Dwight's penchant to yuk it up.\nKobe probably didn't find it too funny that Howard  behind his back about a shooting slump while the team was sitting at 17-24. The Lakers tried to diffuse the situation, with Kobe going as far as posting a photo of him and Howard play fighting with then-coach Mike D'Antoni trying to break it up.\nBut Kobe's true feelings about Howard eventually came out. The Mamba reportedly told Howard he  when the Lakers were trying to re-sign Howard in 2013. Howard bolted to the Rockets shortly thereafter, and many thought Kobe's remarks were harsh.\nFast forward to Thursday,  that the  are reportedly dangling Howard in trade discussions. If Howard is dealt, it would be the fourth team he's played for in his 12-year career.\nThe Rockets have imploded this season. They fired Kevin McHale after a 4-7 start, and after Houston's loss Wednesday, interim head coach J.B. Bickerstaff said, \"we're broken. It's that simple.\" Veteran guard Jason Terry reportedly was much harsher:\nNow does this all fall at Howard's feet? Maybe not all of it, but he deserves some blame, along with All-Star guard James Harden. The duo was supposed to form a one-two punch that would make the Rockets a legitimate contender.\nBut the Rockets are sitting at 27-28. It would be laughable to mention them among the title contenders at this point. But Howard just wants to stay positive:\nKobe, on the other hand, thrives on a killer instinct that he didn't see in Howard (Bryant went so far as to  when the two were tussling for a rebound in 2014). Bryant knew Howard wouldn't retaliate. He had no respect for Howard as a leader, even though Howard helped the Magic make it to the Finals in 2009.\nBryant didn't want to hand the keys to the Lakers to Howard. Los Angeles' current position (11-44) aside, the Lakers avoided a huge mistake by re-signing Howard. And the franchise — and its fans —\u0080\u0093 have Kobe to thank."},
{"url": "http://www.foxsports.com/nba/story/all-star-skills-challenge-can-big-man-win-davis-cousins-draymond-isaiah-021216", "text": "\nThe Skills Challenge competition that precedes the dunk contest on All-Star weekend's Saturday night has been dominated by guards ever since its inception in 2003, and there's a very good reason for that. Speed is the name of this particular game, as contestants are timed as they make their way through a course that requires a combination of ball-handling, passing and shooting.\nBut this year's competition will be a little bit different. While there is still an array of skilled guards in the field, a group of big men which includes Anthony Davis, DeMarcus Cousins,  and Karl-Anthony Towns has been added for the very first time. \nThe question is, do any of them have a real shot?\nThe way the tournament has been set up means that at least one of them will. All of the big men are on one side of the bracket, while the guards are on the other. \nIt would still be downright shocking to see one of the bigs end up winning, for the simple fact that there's no way they'll be able to get through the course as quickly as someone like the 5'9\" Isaiah Thomas. \nGreen would appear to have the best chance of pulling the upset, but unless one of the guards stumbles with an errant pass or missed shot in the final round, the big men may entertain, but they won't be able to win against the league's more diminutive players. "},
{"url": "http://www.foxsports.com/wisconsin/story/milwaukee-bucks-top-washington-wizards-khris-middleton-giannis-antetokounmpo-021116", "text": "\n Khris Middleton's role on the  has evolved from catch-and-shoot perimeter player to crunch-time playmaker.\nA matchup problem as a 6-foot-8 forward who plays in the backcourt, Middleton did more damage Thursday night against the Washington Wizards by attacking the bucket and finding open teammates.\nMiddleton scored 27 points, Giannis Antetokounmpo had 17 points and 13 rebounds, and the Bucks held on for 99-92 win to head into the All-Star break on a high note.\n\"Yeah, we look at Khris as our best player, our best scorer,\" teammate Jabari Parker said. \"He opens up a lot of areas for us, and we're going to depend on him.\"\nEspecially in the final quarter, when Middleton had 14 points and five assists.\nHe's not just a catch-and-shoot player anymore. Expectation rose in the offseason when Middleton signed a five-year contract worth $70 million.\nAgainst Washington, Middleton was 1 of 3 from 3-point range, but 9 of 17 overall. Middleton also tied a season high with nine assists.\n\"Sometimes, you want to put guys in position (for more responsibility), you want to see if they grab it -- and he's grabbing it,\" coach Jason Kidd said.\nBradley Beal scored 19 points for the Wizards, and John Wall had 15 points and 10 assists.\nWashington got within three when Wall made two free throws with 1:36 left.\nBut Middleton answered again, hitting a jumper in the lane on the next possession before setting up a drive-and-dish to Greg Monroe that gave the Bucks a 97-90 lead with 15 seconds left.\n\"He was being aggressive,\" Wall said. \"When a guy gets in a rhythm, it's kind of hard to stop. He's always been a person that's scored well against us.\"\n\nWashington's star guard played with a sore right knee after he said he collided with Milwaukee's O.J. Mayo in the first quarter. Wall said he would get treatment for the All-Star game this weekend and will play \"unless he can't move.\"\n\nThe Wizards go into the All-Star break 3-7 in their last 10 games.\nThe Bucks will take a modest but badly-needed two-game winning streak into the break. At 22-32, Milwaukee needs to inch back closer to .500 before it can start thinking about making a run at a second straight playoff appearance.\n\nSparked by better defense, the Wizards rallied from an 11-point deficit late in the second quarter to turn it into a tight contest after halftime.\nMilwaukee used a 25-5 surge in an eight-minute span to help build a 55-44 lead with 45 seconds left in the second quarter. Jabari Parker scored 12 points during that quarter, when the Bucks made their run using primarily a three-guard lineup that attacked with the ball.\n\"I was just sitting here trying to contemplate on what actually happened, like how did we lose the game?\" Beal said. \"I feel like we came out aggressively, came out and played the right way in the first and third quarters, and I guess the second and fourth they made bigger plays than we did.\"\n\nA 58-38 rebounding advantage for the Bucks hurt the Wizards, as did Washington's 6-of-32 night from the 3-point line.\n\"We didn't attack,\" coach Randy Wittman said. \"Bradley did the last couple of minutes and he got to the rim. We didn't do enough of that in the fourth quarter.\"\n\nParker finished with 17 points and shot 7 of 11 from the field, playing a season-high 41 minutes. He's showing no ill effects from the left knee injury that sidelined him in December of his rookie season in 2014-15.\n\nWashington: Wall had his 30th double-double of the season. ... The Wizards went 0 of 10 from the field with three turnovers during the Bucks' second-quarter run.\nMilwaukee: Bucks co-owner Marc Lasry is taking part in the All-Star celebrity game Friday in Toronto. Asked before the game if the boss was ready, Kidd said with a straight face: \"That's a very good question. We'll see if he needs the asthma inhaler.\" ... O.J. Mayo was assessed a flagrant foul after Washington's Otto Porter Jr. fell hard to the floor on a layup attempt with 10 minutes left in the third quarter.\n\nWashington: Hosts Utah on Feb. 18.\nMilwaukee: Hosts Charlotte on Feb. 19."},
{"url": "http://www.foxsports.com/nba/story/lamar-odom-kanye-west-khloe-kardashian-tlop-the-life-of-pablo-yeezy-season-three-021116", "text": "\nFormer  forward  for his new album, \"The Life of Pablo,\" at Madison Square Garden in New York. \nOdom hadn't appeared in public since he was hospitalized Oct. 12 after an overdose left him in a coma. The former NBA star was joined by his estranged wife, Khloe Kardashian, whose sister Kim Kardashian is married to the iconic rapper. The 36-year-old by West. , Odom says West's music \"saved him\" during his recovery.\nThe listening party streamed online via Tidal and was shown in 700 movie theaters in 23 counties around the world. \nLakers guard Nick Young, who has rocked  during an NBA game this season, was also seen at the event.\n"},
{"url": "http://www.foxsports.com/nba/story/lebron-donates-uniforms-to-toronto-area-school-teams-021116", "text": "\n CLEVELAND (AP)  crossed the Canadian border to dish out an All-Star assist.\n The  forward surprised school kids in Toronto by giving them new team uniforms on Thursday, a giveaway sponsored by James' family foundation as a way of thanking this year's host city for the NBA All-Star game.\n The new uniforms for 23 teams from a variety of sports, including basketball, badminton, cricket, ultimate Frisbee, rugby and a special needs group, were unveiled during a fashion show at Earl Haig Secondary School. The teams from across the city were chosen by the LeBron James Family Foundation as a reward for sportsmanship and leadership.\n James also brought student ''ambassadors'' from Ohio to assist in the giveaway and to volunteer for a day at Variety Village, an organization in Toronto providing programs to help disabled youngsters. The 23 Ohio students had never been out of the United States. The group was scheduled to see a play at the historic Royal Alexandra Theatre and a visit with James at practice.\n James, who is a father of three, has done similar events at previous All-Star games.\n ''It means a lot to me and my foundation to be able to give back to every All-Star city, and in Toronto we wanted to do something special for some teams and groups that earned it,'' he said.\n This is his 12th All-Star game and on Wednesday night, with fellow All-Star Kobe Bryant in town to play his final game in Cleveland, James reflected on a career beginning its descent.\n James remembered sitting home as a kid and watching Bryant participate in the 1997 All-Star game dunk contest in Cleveland. James is now 31, no longer the up-and-comer but an established veteran and iconic player who will one day turn the game over to the next generation.\n ''It's funny sometimes when you look at the box scores or even the notes before the games and you see guys born in like the mid-90s,'' he said. ''Born in `96? I was like golly, born in `96 and you guys are in our league?''"},
{"url": "http://www.foxsports.com/nba/story/heat-s-hassan-whiteside-banned-a-game-for-throwing-elbow-021116", "text": "\n NEW YORK (AP)  center  has been suspended one game without pay for his elbow to the head of San Antonio Spurs center Boban Marjanovic.\n The punishment was announced Thursday by NBA executive Kiki VanDeWeghe.\n Whiteside will serve his suspension Feb. 19 when Miami plays the Hawks in Atlanta.\n He was ejected with 9:35 left in the Spurs' 119-101 win at Miami on Tuesday night. He swung his right elbow after a free throw, smacking Marajonovic on the side of the face and knocking him backward."},
{"url": "http://www.foxsports.com/nba/story/los-angeles-lakers-ben-simmons-kanye-west-nick-angstadt-byron-scott-021116", "text": "\nThe Lakers (11-44) are one of the worst teams in the NBA, which means they're one of the teams in contention to land talented draft prospect . In fact, one fan is so excited at the prospect (what else do Lakers fans have to live for these days?) that he's made a song about the Lakers tanking so that the  star can come to Los Angeles.\nThe song is titled \"Ben Simmons' Comin' Here (Lakers Tank Anthem)\" and it was produced by Nick Angstadt (also the man behind the  to parody L.A. coach Byron Scott), who says this \"terrible\" Lakers season left him bored and frustrated enough to release this song.\nAnd it just so happens to be a parody of \"Good Life\" by Kanye West, who has a new album scheduled to drop Thursday. \n\"I had been working on the song for a little while,\" Angstadt told FOX Sports. \"The fact that the Lakers lost, Ben Simmons played, and Kayne's album dropped all at the same time was too good to pass up.\"  \nThe remix of \"Good Life\" includes some impressive wordplay about Simmons and the Lakers. Here are the song's five best lines:\n1. \"About to play in L.A. / there's no way I'd play in Phill-ay.\"\n2. \"The Lake Show: it's not like Atlanta, it's just like L.A. / It feels like Miami, more titles than N.Y.\"\n3. \"Don't mind the coach / You've got to know: He's bound to go.\" \n4. \"Keep balling down in college / We'll keep tanking until we hit the bottom.\"\n5. \"Ben Simmons, what's good? Reunited with D'Angelo, we know that you would.\"   \n\n"},
{"url": "http://www.foxsports.com/nba/story/nba-capsules-021116", "text": "\n CLEVELAND (AP) 's final game in Cleveland was reduced to a sideshow when Cavaliers forward Kevin Love re-injured his surgically repaired left shoulder in the first half of a 120-111 win over the  on Wednesday night.\n Kyrie Irving scored a season-high 35 points and LeBron James 29 for the Cavs, who head into the All-Star break with one of their ''Big 3'' injured.\n Love quickly left the floor late in the second quarter after he got hurt while working in the post against Bryant. He did not return in the second half, and the Cavs did not provide any specifics about his injury.\n Bryant finished with 17 points in his last performance in Cleveland. Lou Williams scored 28 to lead the Lakers, who have dropped 13 of 15.\n WARRIORS 112, SUNS 104\n PHOENIX (AP) - Stephen Curry nearly had a triple-double before sitting out the fourth quarter, and Golden State stormed into the All-Star break on an 11-game winning streak with a victory over free-falling Phoenix.\n Curry had 26 points, nine rebounds and nine assists for the defending NBA champions. At 48-4, the Warriors have the best record through 52 games in NBA history, one win better than the 1995-96  and 1966-67 Philadelphia 76ers. Those Bulls finished the season with a league-record 72 wins.\n Klay Thompson added 24 points for Golden State.\n Archie Goodwin scored 20 and Markieff Morris 19 for the Suns, who have lost nine straight and 24 of 26. Rookie guard Devin Booker added 15 points and a career-best 10 assists.\n  116, ROCKETS 103\n PORTLAND, Ore. (AP) - Damian Lillard sparked a second-quarter outburst for Portland and finished with 31 points and nine assists in a win over Houston.\n Maurice Harkless set season highs with 19 points and 13 rebounds for the , who moved past Houston into a tie with Utah for seventh place in the Western Conference standings. They enter the All-Star break having won three in a row and eight of nine.\n James Harden had 34 points, 11 assists and nine rebounds for the Rockets, who have dropped three straight and six of eight to fall out of playoff position. Dwight Howard dominated the paint with 28 points and 13 rebounds.\n  98,  96\n ORLANDO, Fla. (AP) - Kawhi Leonard scored 29 points and drilled a jumper from the tip of the key with 0.9 on the clock to lift  to a win over Orlando.\n LaMarcus Aldridge had 21 points and Patty Mills added 17 points and seven assists for the , who won their fourth straight game.\n Evan Fournier, whose 3-pointer tied the game with 13.3 seconds left, led Orlando with 28 points. Nikola Vucevic had 20 points and 13 rebounds, Victor Oladipo scored 14 and  had 13 points and seven assists.\n Payton missed an open layup at the buzzer that could have tied it.\n  114, 76ERS 110\n PHILADELPHIA (AP) - DeMarcus Cousins had 28 points and 12 rebounds, and Darren Collison scored 21 of his 25 points after halftime to lead Sacramento to a comeback victory.\n Rajon Rondo added 14 points, eight rebounds and 15 assists for the , who snapped a four-game losing streak overall and six-game skid on the road while winning for just the second time in their last 10. It also allowed Sacramento to enter the break on a positive note following a tumultuous week that included rumors of the impending dismissal of coach George Karl.\n Rookie Jahlil Okafor tied his career high with 26 points to go with 10 rebounds, and Robert Covington scored a career-high 29 points for the 76ers, who played without top big man Nerlens Noel.\n  139,  134, OT\n BOSTON (AP) - Isaiah Thomas had 36 points and 11 assists, including a fade-away jumper that sent the game to an extra period, to help Boston overtake  in overtime.\n Jared Sullinger added 21 points and 11 rebounds. Jae Crowder finished with 19 points, and Avery Bradley added 18 points as the  won their eighth straight at home.\n Boston played the second half without big man Kelly Olynyk. He left late in the first half with a bruised right shoulder.\n The  led by five late in regulation, but went without a field goal for more than three minutes.\n Chris Paul led the Clippers with 35 points and 13 assists. J.J. Redick added 27 points and DeAndre Jordan finished with 21 points and 16 rebounds.\n  113, BULLS 90\n CHICAGO (AP) - Jeff Teague had 17 points and eight assists, Al Horford scored 16 and  routed struggling Chicago.\n Dennis Schroder had 18 points and hit three of his team's 13 3-pointers. Paul Millsap scored 15, and the Southeast Division leaders headed into the All-Star break on a winning note after back-to-back losses to last-place Orlando.\n The  led by five at halftime and broke it open in the third quarter, sending the sloppy Bulls to their fourth straight loss and 13th in 18 games.\n Pau Gasol had 20 points and 10 rebounds for Chicago after being selected Tuesday to his sixth All-Star team as a replacement for injured Bulls teammate Jimmy Butler.\n TIMBERWOLVES 117, RAPTORS 112\n MINNEAPOLIS (AP) - Karl-Anthony Towns had 35 points and 11 rebounds, and Minnesota came back from 18 points down to stun Toronto.\n Canadian star Andrew Wiggins scored 13 of his 26 points in the fourth quarter, including a jumper with under 2 minutes to go that gave Minnesota a 112-109 lead. Ricky Rubio had 19 points, eight assists and eight rebounds to outplay All-Star Kyle Lowry, and the Wolves used a huge advantage at the free-throw line to close out a team that had won 14 of its last 15 games.\n DeMar DeRozan scored 35 points for the Raptors, who head home to host All-Star weekend beginning on Friday.\n PELICANS 100,  96\n NEW ORLEANS (AP) - Anthony Davis capped a 19-point night with a running left-handed hook and 3-pointer in the final minute, and New Orleans beat Utah to snap the 's seven-game winning streak.\n Jrue Holiday scored 21 points for the Pelicans, who won their second straight. Davis scored all but three of his points in the second half. His running hook from about 5 feet out gave New Orleans a 94-92 lead with 59 seconds remaining. His 3 made it 97-93 with 35 seconds left.\n Derrick Favors scored 29 and Gordon Hayward, 21 for Utah, but each missed a free throw in the final minute.\n Rodney Hood added 15 for Utah, but the Jazz turned the ball over 17 times and missed 14 of 21 shots from 3-point range.\n  109, NETS 90\n NEW YORK (AP) - Mike Conley scored 20 points, Jeff Green had 12 of his 18 in the third quarter, and Memphis beat Brooklyn in its first game since losing Marc Gasol to a broken right foot.\n The  unleashed a strong perimeter attack in the absence of their franchise center, making seven 3-pointers in a 39-point third quarter that blew open the game.\n Zach Randolph finished with 15 points for the Grizzlies, who were coming off consecutive losses, both in overtime.\n Brook Lopez led Brooklyn with 20 points.\n NUGGETS 103,  92\n AUBURN HILLS, Mich. (AP) - Will Barton scored 15 of his 20 points in the fourth quarter, and Denver held off depleted Detroit, which was without three starters.\n Kentavious Caldwell-Pope has been out with a core muscle strain, and the team announced before the game that Reggie Jackson and Ersan Ilyasova had been ill and would be sidelined as well.\n Denver led by eight early in the fourth, but the  closed to 83-82 after consecutive 3-pointers by Anthony Tolliver. Randy Foye made a 3 to halt that run, and Denver was able to hold onto its lead the rest of the way.\n Andre Drummond had 15 points and 17 rebounds for Detroit but shot 7 of 22 from the field.\n HORNETS 117, PACERS 95\n INDIANAPOLIS (AP) - Kemba Walker scored 25 points and Jeremy Lamb had 16 as suddenly surging Charlotte rolled to a victory over Indiana.\n Six players scored in double figures for the Hornets (27-26), who won their third straight - and their first at Indiana since November 2008.\n Paul George led the Pacers with 22 points, eight rebounds and six assists.\n Charlotte started the second quarter on a 17-4 run to take a 42-29 lead.\n And with Indiana's defense struggling to stay in front of the Hornets' deft drivers and potent 3-point shooters, the Pacers never had a chance."},
{"url": "http://www.foxsports.com/nba/story/shaquille-o-neal-kristaps-porzingis-new-york-knicks-dunk-dikembe-mutombo-no-finger-wag-021116", "text": "\nWhile we might be overrating  just a little bit in his rookie season with the , there's no denying the degree to which he's captured the imagination of basketball fans around the world. His affinity for dunking all over people is a big part of that, of course. \nBut there's a question we can't stop thinking about: Could Porzingis serve up a dunk so vicious that even Hall of Famer Shaquille O'Neal would fall victim to the slam?\nAccording to the legendary retired big man, the answer is a no — probably. And he wasn't shy about responding as such right to Porzingis' face at a recent sports memorabilia signing, complete with a Dikembe Mutombo-esque finger wag:\nOf course O'Neal is going to have that kind of confidence. That's not surprising, although this is still a really fun video that we've watched a dozen times already. \nBut did you catch that line from O'Neal? He says that the only person who's ever dunked on him is Michael Jordan. And, yes, there's this super-cut of Jordan having a field day against O'Neal during the early parts of the latter's career.\nHas O'Neal forgotten his previous tale, though?  of NBA TV's \"Open Court,\" O'Neal admitted to one of his most embarrassing moments, when Derrick Coleman dunked on O'Neal \"chest-to-chest.\" Other than that, though, O'Neal claimed that he'd only been \"dunked by,\" not \"dunked on.\"\nGranted, O'Neal was speaking extemporaneously in the company of Porzingis, so we don't expect him to be absolutely accurate in all of his recollections. But it seems like an odd chance to O'Neal's story.\nRegardless of that, we have one more question: Whom do we contact in order to get this Porzingis-O'Neal one-on-one game set up immediately? We'll even get to work on building a time machine to make sure the prime version of Shaq can take the court."},
{"url": "http://www.foxsports.com/nba/story/hornets-f-kidd-gilchrist-tears-labrum-in-shoulder-again-021116", "text": "\n CHARLOTTE, N.C. (AP) Hornets forward Michael Kidd-Gilchrist has torn the labrum in his right shoulder for a second time, possibly ending his season.\n The team says Kidd-Gilchrist will be re-evaluated after the All-Star break and gave no prognosis for his return.\n However, when Kidd-Gilchrist first tore his labrum in his shoulder in early October in a preseason game, he needed shoulder surgery and missed nearly than four months of action. He returned last month and was averaging 12.7 points, 6.4 rebounds and 1.3 assists in 29.3 minutes per game in seven contests since returning to action.\n Kidd-Gilchrist, a former No. 2 pick in the draft out of Kentucky, sustained the injury in the third quarter of 's 117-95 win against the Indiana Pacers on Feb. 10."},
{"url": "http://www.foxsports.com/florida/story/miami-heat-hassan-whiteside-suspended-by-nba-021116", "text": "\n  center  has been suspended one game without pay for his elbow to the head of San Antonio Spurs center Boban Marjanovic.\nThe punishment was announced Thursday by NBA executive Kiki VanDeWeghe.\nWhiteside will serve his suspension Feb. 19 when Miami plays the Hawks in Atlanta.\nHe was ejected with 9:35 left in the Spurs' 119-101 win at Miami on Tuesday night. He swung his right elbow after a free throw, smacking Marajonovic on the side of the face and knocking him backward."},
{"url": "http://www.foxsports.com/nba/story/sacramento-kings-demarcus-cousins-car-commercial-video-chase-chevrolet-ima-cousins-021116", "text": "\nYou've  and \"Cliff Paul,\" but have you been introduced to Ima Cousins yet?\nOn Thursday, Chase Chevrolet out of Stockton, Calif., posted a commercial to YouTube featuring a finance director who looks plenty like  center . The ad starts out pretty straightforward, with Ima telling you he wants to save you money, but then there's disco lights and dancing, and, well, who saw that coming? \nBy the way, this isn't the first time Cousins has gone incognito for Chase Chevy. "},
{"url": "http://www.foxsports.com/southwest/story/thunder-beat-pelicans-teams-mourn-ingrid-williams-death-021116", "text": "\nOKLAHOMA CITY (AP) -- Basketball didn't matter much to Kevin Durant on Thursday night.\n assistant coach Monty Williams' wife, Ingrid, was involved in a car crash Tuesday night in Oklahoma City and died Wednesday. Monty Williams coached the  last season before coming to Oklahoma City to help new coach Billy Donovan, so as his two most recent teams met, both played with heavy hearts. A moment of silence was observed before the Thunder's 121-95 victory.\nDurant was distraught earlier in the day while discussing the situation after the team's shootaround, and he said it remained fresh in his mind after the game.\n\"We love the game so much, but that's not really what's important,\" Durant said. \"It's definitely something that we love to do, but relationships, family -- those things -- that's what's most important in life, not the latest trends or the fashion world or all that stuff. It's cool and all that stuff, but the stuff that lasts forever is relationships, family and love.\"\nDonovan wasn't sure how his team would deal with all that happened. Durant scored 23 points, Russell Westbrook had 23 points, 10 assists and nine rebounds, and Serge Ibaka added 18 points.\n\"I really appreciated all of our guys, the way they all have handled a really difficult situation these past 24 hours and being able to go out and play,\" Donovan said.\nAnthony Davis and Jrue Holiday each scored 23 points for the Pelicans. Davis, who was emotional on Twitter after learning of the death, still was disappointed in the way the Pelicans played.\n\"We've got to go out there and still compete,\" he said. \"Go out there and play. We had a job to do tonight.\"\nOklahoma City has won 14 of 16 heading into the All-Star break to join Golden State and San Antonio as the only teams with at least 40 wins. The Thunder don't feel much needs to change to compete for the title.\n\"No switch-up, just enhance and get better at what we do.\"\nThe Thunder led 62-53 at halftime behind 18 points from Westbrook and 17 from Durant.\nWestbrook got his 10th assist on Ibaka's 3-pointer that gave the Thunder a 79-65 lead. He had his ninth rebound with just under 3 minutes to go in the third quarter before heading to the bench for his usual rest and the Thunder ahead 86-68. Oklahoma City led 95-74 at the end of the third quarter.\nOklahoma City's backups expanded the lead early in the fourth quarter, and Westbrook didn't return.\n\"I don't know what we can take out of it other than we competed like crazy in the first half,\" New Orleans coach Alvin Gentry said. \"Tried like crazy in the second half, but when they got separation, it was really difficult.\"\nThe Thunder found an escape from pain through playing.\n\"Basketball, the effect it has, it allows you to forget about things a little bit, and it also brings you together as a group,\" Durant said. \"Thankful for that.\"\nQUOTABLE\nGentry, on Westbrook: \"He's just a really talented guy, probably the best athlete in professional sports, and when I say that, I mean pro sports. Not just basketball.\"\nON THE RISE\nGentry said the Thunder have the look of a title contender.\n\"This team's playing extremely well,\" he said. \"I know they had a tough loss against Golden State (last Saturday), but I think they're playing really good basketball, and I think, obviously, they're going to be a huge factor.\"\nSTAT LINES\nDurant is averaging 30.0 points on 49 percent shooting during the Thunder's 14-2 surge heading into the All-Star break.\nTIP-INS\nPelicans: Shot 53.5 percent from the field in the first half, but just 43.2 percent for the game. ... Were outrebounded 50-31 ... Committed just nine turnovers. ... Norris Cole scored 15 points.\nThunder: Shot 52.3 percent from the field. ... Thunder G Andre Roberson remained out with a right knee sprain. ... Anthony Morrow scored 10 points. ... Enes Kanter finished with 11 points and 12 rebounds.\nUP NEXT\nPelicans play at 76ers on Feb. 19.\nThunder host Pacers on Feb. 19."},
{"url": "http://www.foxsports.com/nba/story/dwight-howard-trades-houston-rockets-los-angeles-lakers-new-york-knicks-boston-celtics-dallas-mavericks-miami-heat-atlanta-hawks-021116", "text": "\n can choose to become a free agent this summer if he doesn't pick up his player option for next year. Because of that, there has been trade speculation surrounding him all season. And now, as the  sit with a disappointing 27-28 record on the outside of the Western Conference playoff picture, Adrian Wojnarowki of Yahoo! Sports reports that .\nHe may have lost some popularity over the years, and he may not be quite as dominant or healthy as he once was in Orlando, but Howard still belongs on the list of the NBA's five best centers. He still defends. He protects the paint about as well as anyone. He grabs rebounds at an elite rate. He's capable finishing around the rim. There are teams for whom he's worth the rental -- and for whom he's worth trying to keep around after that.\nRockets general manager Daryl Morey is one of the league's more creative GMs, but he may not be able to think of every possible trade involving his current starting center. Here are a few that may get him working:\n\nHoward actually grew up in Atlanta, so even though he would play only 20-something games for the Hawks after the deal, you'd have to imagine coach Mike Budenholzer's team would have a legitimate shot to re-sign him come free agency this summer.  reported recently that the Hawks may be entertaining deals for Al Horford, who will also be a free agent at the end of this season. The current Hawks center could be a nice fit inside the Houston offense with his shooting, and you'd have to imagine the Rockets would do everything they could both to bring him back to Houston and progress his game out to the three-point line. Tiago Splitter adds some depth to the Rockets roster and Donatas Motiejunas gives the Hawks an extra young piece who could both back up and play next to Paul Millsap.\n\nMaybe the Knicks want to get out of Carmelo Anthony's contract, which still has three years left on it after this one. Maybe Melo wants to head to Houston to play next to James Harden and for a team that's only one year removed from the Western Conference finals. Maybe Howard would entertain sticking around in New York, a big market where he could still be a star. And maybe the Knicks, who have a locker room full of high-character players, would be willing to take a risk on Ty Lawson, who was one of the NBA's 10 best point guards less than a year ago. It's unlikely a trade of this magnitude would happen (especially since Anthony has a no-trade clause), but Howard and Kristaps Porzingis could make for an intimidating defensive frontcourt and a fitting offensive one. And Houston would actually get another star to play next to Harden while receiving back a quality defensive and pick-and-roll center in Robin Lopez. There are ways this deal makes sense for everyone.\n\nSo, this deal just involves everyone. The Rockets get to clear some cap space with David Lee's contract, and they receive two young pieces in Kelly Olynyk and Julius Randle. The Lakers get Hassan Whiteside, whom they can re-sign in the offseason and whom has the personality and flashiness to become a star in Los Angeles. The Heat may have a tough time trying to re-sign Whiteside this offseason, and Erik Spoelstra has sat him for plenty of fourth quarters, so Jae Crowder should be more than enough value back for him. Miami could play small lineups that included Crowder and Luol Deng at the two forward spots and Chris Bosh at the 5. The Celtics, meanwhile, get a star and a rim-protector, something Brad Stevens has never had during his time in Boston, which is why a huge deal to bring Howard to Beantown shouldn't be the only option on the table for Celtics general manager Danny Ainge ...\n\nThe Celtics owe their top-five defense to their surplus of wing defenders: Marcus Smart, Avery Bradley and Jae Crowder are all wonderful and versatile. But giving up one of those guys for a much-needed rim protector could help Boston a whole bunch. The Dallas pick, which the Celtics received in last year's deal that sent Rajon Rondo to the Mavs, would almost certainly come this year, given that it's top-seven protected. So, Houston gets a perimeter defender to complement Trevor Ariza or James Harden and a pick out of the whole thing. It could do worse while giving up a potential expiring contract.\n\nAgents are behind more transactions in the NBA than many people realize. And here, we'd actually have two clients of Dan Fegan, Dwight Howard and Chandler Parsons, traded for each other. Howard and Parsons will likely become free agents this summer (Parsons has a player option for next year, as well), and considering the  the last time Parsons was a free agent with Houston, we could be in for Fun Free Agency, Part 2. On top of that, Houston receives Zaza Pachulia, who's on a cheap contract and is in the midst of the best year of his career, and Justin Anderson, a first-round pick still in his rookie season. Everyone wins."},
{"url": "http://www.foxsports.com/nba/story/kevin-durants-words-on-the-death-of-ingrid-williams-put-sports-in-perspective-021116", "text": "\nThe  are , wife of assistant coach Monty Williams, who died this week from injuries sustained in a car accident. \nA moment of silence was observed before the Thunder played Thursday night at home against the New Orleans Pelicans, who Williams coached from 2010 to 2015. \nThunder head coach Billy Donovan said Thursday that the players and coaches have to do the \"best job we can,\" and it's clear that even though Williams just joined the Thunder last summer, his family made a profound impact on the team. Durant was epecially shaken up before the game.\n\".\"\nDurant went out and contributed 23 points in a 121-95 win over New Orleans, but the team played with heavy hearts, and the victory was of little consolation.\n\"We love the game so much, but that's not really what's important,\" Durant said. \"It's definitely something that we love to do, but relationships, family — those things — that's what's most important in life, not the latest trends or the fashion world or all that stuff. It's cool and all that stuff, but the stuff that lasts forever is relationships, family and love.\""},
{"url": "http://www.foxsports.com/nba/story/kanye-west-tlop-album-cover-nba-memphis-grizzlies-021116", "text": "\nKanye West released his seventh solo album on Thursday: \"The Life of Pablo.\" For those with ears, this event is kind of like a big deal. But before his new music could be heard, digested, cried to and/or laughed at, West decided to release some pretty interesting cover art:\nThe  and their brilliant social media team immediately jumped all over it to throw out their own version:\nShortly thereafter, the Detroit Pistons followed suit:\nThese are very tough times in Memphis, so it's good to see they still have a sense of humor. All-NBA center Marc Gasol will likely miss the rest of this season with a broken foot, and with Mike Conley scheduled to hit free agency this summer, it's very possible that the \"Grit N' Grind\" era has already ended. They're currently in fifth place, up four games in the loss column on the Dallas Mavericks, but without Gasol in the lineup there's a strong chance Memphis misses the postseason altogether.\nThat's awful. \nBut it's good to see that the players on board (presumably) still have each other's back in the form of this well-timed, photo-shopped tweet. And if Kanye's album is his best effort yet, all will be right in their universe, and ours. "},
{"url": "http://www.foxsports.com/nba/story/denver-nuggets-emmanuel-mudiay-skills-challenge-replacement-chance-to-shine-021116", "text": "\n rookie point guard Emmanuel Mudiay will take center stage in the NBA's Skills Challenge on Saturday, replacing defending champion Patrick Beverley.\nThe Houston Rockets point guard pulled himself from the competition after suffering an ankle injury in Wednesday's loss at Portland. Mudiay, who is just 19, was the seventh overall pick in the 2015 draft.\nHe ranks first among rookies in assists (5.9), second in minutes (30.2) and fifth in scoring (11.4). Mudiay will also compete for the World Team in Friday night's Rising Stars Challenge."},
{"url": "http://www.foxsports.com/nba/story/kobe-bryant-lebron-james-los-angeles-lakers-cleveland-cavaliers-2016-olympics-021116", "text": "\nLeBron James has always looked up to Kobe Bryant. The Los Angeles Lakers great is six years older than the best player in Cleveland Cavaliers history — and had five championships to James' zero at one point. \nBut does that idolization still exist? Apparently, the answer is yes. And it could impact a huge decision LeBron still has to make about this summer's Olympic games ():\nLeBron is his own man, with his own family, living his own life, taking care of his own career and body. So it's very strange for him (or anyone else, for that matter) to weigh whatever Bryant's doing beside their own path.\nJames is not 37 years old and he isn't one of the least efficient players in the league. This isn't his 20th season. Unlike Kobe, he can still help the United States win a gold medal by taking entire games over and singlehandedly obliterating another nation's ambition.\nIf he doesn't play, it'll be due to health, the (critical) need to refuel his mind and body after another physically taxing year. \nEspecially considering there's a good chance LeBron makes it to the NBA Finals for a sixth straight season — something Bryant never did."},
{"url": "http://www.foxsports.com/nba/story/nba-western-conference-houston-rockets-1-team-in-wild-west-shakeup-021116", "text": "\nThere's a problem in Houston, all right. There's one in Memphis, too. Maybe even in Dallas. While the top four spots in the Western Conference are practically chiseled in stone, the bottom half is primed for a major shakeup with the potential for familiar names to make surprising exits.\nWith the All-Star break upon us, the , West finals participants a season ago, are under .500, out of the playoff mix and fraying from within. It's unclear whether Houston general manager Daryl Morey is taking or placing more calls about Dwight Howard's availability.\nJust as the Memphis Grizzlies were starting to play better basketball, center Marc Gasol could be lost for the season with a broken foot, and now the Griz, eyeing another playoff battle with nemesis Los Angeles Clippers, could be goners. \nAnd in Dallas, where the Mavericks have been praised all season for their post-DeAndre Jordan resiliency, suffered a crushing overtime loss at home to the Utah Jazz on Tuesday to fall to just three games over .500. So much talk has centered on nabbing the five-spot, but Dallas sits equally close to fifth place as it does ninth place.\nThe surprise challengers in this playoff puzzle are those Jazz, who dropped a tough one at New Orleans on Wednesday to snap a seven-game winning streak, their longest since 2010, and the resurgent Portland Trail Blazers, who are 12-3 in their last 15 games, behind All-Star snub Damian Lillard.\nLillard and the Blazers dropkicked Houston on Wednesday to set off interal Rockets fireworks and now occupy the seventh spot, with Utah in eighth.\nDallas, whose only playoff absence since 2000 came the season of Dirk Nowitzki's knee surgery, has a favorable schedule after the All-Star break. But it remains to be seen whether the Mavs can put together a consistent stretch. They haven't won two in a row since early January and are 10-13 since Jan. 1.\nIt is possible that among Houston, Dallas and Memphis, one or more will not make the playoffs. The Rockets at the moment are easily the most dysfunctional. The Grizzlies, who rely so heavily on their frontcourt, might just be undermanned, while Dallas has yet to show it can beat top teams.\nThere's also a wild card in all this: Those internally inept . Even after this bizarre stretch in which they've lost eight of 10 and were set to fire coach George Karl only not to, the 10th-place Kings are just 4 1/2 games behind the Jazz for the final playoff spot.\nWith the unbelievable season center DeMarcus Cousins is having, the Kings have the talent to win games. If they can regroup, maybe even man-up in a way we haven't seen the Kings do in ages, they could at least make things interesting down the stretch.\nWhen the NBA resumes late next week, the Golden State Warriors' chase for 73 wins will be front and center, but the bottom half of the West playoff race threatens to get just as interesting. "},
{"url": "http://www.foxsports.com/nba/story/los-angeles-clippers-blake-griffin-doc-rivers-better-without-lost-their-mind-021116", "text": "\nThe Clippers are 18-5 since  went down with a quad injury back in December. But even if their winning percentage is better without the starting power forward, are the Clippers actually a better team with Blake riding the pine?\nDoc Rivers thinks even the premise of that question is egregious:\nThe 18-5 record over that stretch is a tad misleading. The Clippers have played just nine teams with records currently over .500 and many of those are middling Eastern Conference playoff contenders whose records are just barely above sea level.\nFor all the talk of how Griffin, Chris Paul and DeAndre Jordan don't play well together,  was still outscoring opponents handily with the three of them on the floor. That's not because of stellar defense, of course; instead, the Clippers score 111.3 points per 100 possessions with their star trio. Just for the sake of comparison, the NBA's best overall offense clocks in at 113 points per 100.\nThat doesn't mean things are perfect, though. The Clippers could certainly use Griffin better within their offense. He's taking more and more long 2s every year, and even if only a couple of those a night turned into 3s, the attack could become that much more efficient. It would help spacing. It would give him some more shots with a better expected points outcome. And if we've conceded that Griffin just isn't going to go inside as much as he once did (whether because of his doing, Rivers' preferences or DeAndre Jordan's propensity to hang around the paint), a few 3s would be the next-best option.\nThat said, the Clippers are hardly broken in the core. They don't have a backup 4. They don't have a backup point guard, though Pablo Prigioni has proven to be serviceable of late. They don't have a consistent, two-way 3. Those are the issues the Clips need to fix most.\nSo, no. Taking away Griffin doesn't make the Clippers better. And it certainly doesn't give them a better chance to beat the Warriors, Spurs or Thunder in the postseason. L.A., who just suspended him for four games for the fighting incident in Toronto, should be anxiously awaiting his return."},
{"url": "http://www.foxsports.com/nba/story/golden-state-warriors-stephen-curry-alley-oop-mistake-021116", "text": "\nEach night, the  manufacture highlight-worthy basketball theatre every 45 seconds or so. They can't help it. It's in their blood.\nStarting with Steph Curry, every player on their roster is incredibly talented, unselfish and creative. There's no evidence to prove this as fact, but they also appear capable of reading each other's minds. \nThrow it all together, and what you have is the most exciting basketball organism that's ever existed; even their mistakes are 100 times more satisfying than any other team's success:\nDoes Leandro Barbosa honestly think Curry can go up and dunk a pass off the backboard? Better question: Does the answer even matter? \nThe Warriors turn the ball over quite a bit, and someday that may get them in a little bit of trouble. But until that happens they should continue to play as wild and free as they are.\nIf it isn't broke, don't fix it."},
{"url": "http://www.foxsports.com/nba/story/bc-ap-sports-preview-digest-021116", "text": "\n Some of the sports stories The Associated Press is covering Thursday. A full Sports Digest will be sent by about 3 p.m. All times EST:\n - LONDON - The IOC medical director tells the AP that ''everything that can be done is being done'' to combat the Zika virus in Brazil and provide safe conditions at the Rio de Janeiro Olympics.\n - The NBA begins its annual showcase in Toronto on Friday, the first time the league has held the All-Star Game outside the United States.\n - This year's Basketball Hall of Fame class features three players certain to make the cut - Shaquille O'Neal, Yao Ming and Allen Iverson.\n - DAYTONA BEACH, Fla. - With Jeff Gordon retired and Tony Stewart sidelined with a broken back, NASCAR's season begins with a much different look and new rules package.\n - PEBBLE BEACH, Calif. - Jordan Spieth, Jason Day and Bubba Watson lead a strong field entering the opening round of the AT&T Pebble Beach.\n - NEW YORK - With spring training approaching and dozens of players still seeking jobs, union leader Tony Clark tells the AP the system needs change.\n - BOSTON - Daily fantasy sports companies insist their industry remains viable. DraftKings and FanDuel have taken hits to their business in recent weeks as states move to regulate the games.\n - NCAA football rules committee gives video replay officials more authority to overturn incorrect targeting fouls and call targeting penalties when they are missed on the field.\n - GENEVA - FIFA presidential candidate Prince Ali questions the role of election rival Sheikh Salman in not protecting Bahrain players who alleged abuses after pro-democracy protests in 2011."},
{"url": "http://www.foxsports.com/nba/story/toronto-raptors-kyle-lowry-dwayne-casey-kevin-mchale-fatherhood-021116", "text": "\nThe ' Kyle Lowry has been one of the most impressive guards in the NBA this season. But he knows his career hasn't always been met with that type of success.\nIn a story for  published Thursday morning, Lowry credits the changes he has noticed in himself recently to fatherhood. First, Lowry outlined what it was like playing for Houston's former coach Kevin McHale. Despite McHale's good intentions as a basketball coach, Lowry constantly felt himself resisting. None of that made sense until he became a dad. \nYears later, Lowry said he finally understands what went wrong. He didn't feel like he could trust his coach; he didn't feel like he could trust a lot of people. \nLowry also discusses his lack of a relationship with his own father, the complications of his collegiate recruiting process and relecting on his experience first joining the Raptors -- which he originally viewed as temporary.\nAccording to Lowry, fatherhood has given him the necessary perspective and mentality to help his team win. Now, the Raptors have the second-best record in the Eastern Conference. Lowry will represent Toronto in the All-Star game, voted in as a starter.     \n\"A few years ago, I think people thought of me more as a pain in the ass than a guy who deserved this kind of honor,\" writes Lowry. \"Now, it feels like they appreciate what I do.\" \n"},
{"url": "http://www.foxsports.com/nba/story/derek-fisher-matt-barnes-ex-wife-photo-new-york-knicks-021116", "text": "\nDerek Fisher has some free time on his hands after  as head coach of the New York Knicks earlier this week.\nSo what's he doing with all this time on his hands? Apparently hanging out with ' ex Gloria Govan. If you remember, Barnes wasn't too pleased when he found out before the season that Fisher and Govan were seeing each other. Barnes  to confront the two in early October.\nBarnes  after Fisher's firing. But now he might be hopping in his car again after  that Govan posted on Instagram (she later removed it from her account).  IDs Gloria and Fisher in the shot."},
{"url": "http://www.foxsports.com/nba/story/san-antonio-spurs-gregg-popovich-becky-hammon-nba-all-star-game-coach-021116", "text": "\n Becky Hammon will make history as the  in the All-Star Game. But her accomplishment almost never occurred, until she intervened. \n that when  head coach Gregg Popovich was asked to coach the Western Conference All-Star team, he initially had no interest. If Popovich declined, the NBA would have found a new coach for the West and that coach would have selected the assistants for the game instead. \nHammon and others on San Antonio's coaching staff, however, stepped in to try and convince Popovich to accept the honor.\nAccording to Hammon, Popovich prefers to use his breaks from basketball for reading -- and avoiding the game entirely. But Popovich was convinced and Hammon will, in fact, become the NBA's first woman to be an assistant coach during an All-Star Game. \nThe former WNBA All-Star was hired as the league's first female assistant before the 2014-15 season. She was the team's Summer League coach before this season; her team won the league title. \n"},
{"url": "http://www.foxsports.com/san-diego/story/clippers-fall-to-streaky-celtics-in-overtime-021116", "text": "\nBy KYLE HIGHTOWER\n\n\nBOSTON (AP) -- The way the  are scoring right now, they may want to try bottling a little of it before they leave for the All-Star break.\nWhatever it is, it has the Celtics looking like a probable playoff team heading into the second half of the season.\nIsaiah Thomas had 36 points and 11 assists, including a fade away jumper that sent the game to an extra period, to help the Boston Celtics overtake the  139-134 in overtime on Wednesday night.\nJared Sullinger added 21 points and 11 rebounds. Jae Crowder finished with 19 points, and Avery Bradley added 18 points as the Celtics won their eighth straight at home. Boston trailed by five with just over a minute left in regulation before rallying to force the extra frame. Boston is averaging 115 points during its current win streak at the Garden.\n\"We play together and we make adjustments on the fly and I think that's big,\" Sullinger said. \"It's not just from (coach) Brad (Stevens), it's not from Isaiah or ET (Evan Turner) or Jae Crowder or Avery. It's from everybody. Everybody makes adjustments and is willing to listen.\"\nThough possible shakeups to the roster before the trade deadline are possible for this young team, Crowder said no one wants to see any tinkering.\n\"Guys in the locker room we are sticking together, we're fighting. We stick up for one another,\" Crowder said. \"Everyone gets along and it's a great energy in the locker room.\"\nBoston played the second half without big man Kelly Olynyk after he left late in the first half with a bruised right shoulder. But the Celtics found a way to make up for the lack of his presence inside.\nChris Paul led the Clippers with 35 points and 13 assists. J.J. Redick added 27 points and DeAndre Jordan finished with 21 points and 16 rebounds.\nThe loss spoiled what may be Clippers' forward Paul Pierce's final game in the Boston Garden. The 38-year-old played 15 seasons with the Celtics and was facing his former team for the eighth time.\nThe Clippers led by five late in regulation, but were held without a field goal for more than three minutes.\n\"I think we try to pride ourselves on our defense -- so we didn't defend. That's probably why we lost,\" Paul said.\nTIP-INS\nClippers: The Clippers did not have a field goal for the final 3:29 of regulation. ... Paul had 10 points and five assists in the first quarter. It was the 37th time in his career he's had at least 10 points and five assists in a quarter. That's the most in NBA since 2005-06.\nCeltics: Improved to 10-3 in the second game of back-to-backs.\n Clippers coach Doc Rivers was informed by a member of the Clippers organization immediately after the game about the death of Ingrid Williams, wife of Oklahoma City assistant Monty Williams. The 44-year-old died Wednesday night from injuries sustained in a car crash on Tuesday. Rivers has known both side before they married, and the friendship expanded when Monty coached his son and current Clippers' guard Austin Rivers after he was drafted by the New Orleans Pelicans. \"I'm heartbroken,\" said a teary-eyed Rivers. \"Sometimes it doesn't seem fair. There's no better human being in the world than Monte and Ingrid. Sometimes you question everything, and this is one of those times.\"\n For all the late-game plays by the Celtics, the pregame spotlight belonged to Pierce. In his eighth game against his former team, the 38-year-old received the starting nod in what could possibly be final game in the Garden against his former team. The moment resulted in a huge ovation by the Boston fans when his name was announced. Pierce, who spent 15 seasons in Boston and won a championship in 2008, acknowledged them, raising his right hand before his teammates started playfully pounding on him.\n \"I think the NBA had a lot of say so in it, and so did we. And that's the way it should work. I thought it was really well done in that light. They have more people that can investigate things than us because they do it all the time. I just thought as far as that went I thought it was really well handled by both sides.\" -- Rivers on the team and NBA collaborating to decide on a suspension for Blake Griffin.\nCELEBRITY WATCH: Boxing legend \"Marvelous\" Marvin Hagler sat courtside.\nUP NEXT\nLos Angeles hosts San Antonio on Feb. 18.\nBoston travels to Utah on Feb. 19."},
{"url": "http://www.foxsports.com/florida/story/miami-heat-chris-bosh-all-star-021116", "text": "\n  sees no need to reflect on where he was at this time last year.\nPhysically, mentally and emotionally, he moved past it all long ago. The tubes stuck into the side of his chest, the fear of his life being in danger by the blood clot that attacked one of his lungs, the tests that would determine if his career could continue and the searing pain that accompanied each breath all are safely tucked away in the memory bank, and life as Bosh has known it for more than a decade has resumed.\nA year after a blood clot gave the  forward the scare of a lifetime, Bosh is again an All-Star.\n\"It doesn't surprise me,\"  coach Erik Spoelstra said. \"I know C.B. probably as well as I've known anybody that I've coached and I know his competitive character. You don't ever want anything like that to happen to anybody in this league. The one thing you can take from it, though, is he has great perspective. I think we all can use that.\"\nBosh is back at the All-Star Game this weekend, and as an added bonus he'll do so in the city where his NBA career began. Only three players who will be taking part in Toronto this weekend -- Kobe Bryant, LeBron James and Dwyane Wade -- have more All-Star appearances than Bosh, who has been selected for the league's midseason showcase in each of the last 11 seasons.\nHe's even taking part in the 3-point contest on Saturday night, not deterred in the least that at least one Las Vegas sports book lists him as the longest shot in the field of eight. So right now, he's perfectly content looking ahead, not back at the diagnosis that came just days after last year's All-Star weekend ended.\n\"I just put all that stuff behind me,\" Bosh said. \"Once I was free of it, once I stopped having pain, I was like, 'Well, OK, I'm out the door and hopefully I won't be back here again.' I appreciate everything more, but that's really it. We can always talk about it. I don't mind talking about it, but personally I just walked away being thankful and leave it at that.\"\nBosh and Wade were on vacation with their wives in Haiti after last year's All-Star events in New York, and Bosh had been dealing with pain in his side for some time. The pain worsened, so Bosh's wife Adrienne insisted that her husband get checked out at a hospital. That's when the clot was found, Bosh's season was declared over and his future seemed most uncertain.\nBut this season, he's been good as new.\nBosh leads the Heat at 19.1 points per game, just ahead of Wade's 18.7 as the two veterans have Miami back in playoff contention. Bosh has also established a career-high in 3-pointers with 81 already, one of the reasons why he's in the long-range contest against the likes of more-traditional 3-point stars like Stephen Curry and Klay Thompson of the NBA champion Golden State Warriors.\n\"I don't have anything to lose,\" Bosh said. \"No one expects me to win, so I could just throw hook shots up there and I don't think it'll be a big deal.\"\nAll jokes aside, Bosh's NBA family is thrilled to have him back and flourishing again.\n\"He's such a class act on top of being a talented player,\" said San Antonio coach Gregg Popovich, who will lead the Western Conference All-Stars against Bosh and the Eastern Conference squad on Sunday night. \"You pull for those kind of guys even more than the usual just-good player. To have him back, seeing him doing what he loves and helping his team, it's good for him, his team, his city and the NBA, really.\"\nBosh's reception in Toronto might not exactly be warm -- Raptors fans haven't necessarily forgotten that he left for then Miami in 2010 -- but the weekend will still be one to savor.\n\"It takes a lot more to make me nervous,\" Bosh said. \"I've been in so many life situations. It's going to be exciting. It's going to be a lot of fun. Just to be in these situations, it's always a great thing.\""},
{"url": "http://www.foxsports.com/nba/story/los-angeles-lakers-dangelo-russell-byron-scott-chris-paul-kyrie-irving-021116", "text": "\n head coach Byron Scott, once again, offered criticism about rookie D'Angelo Russell. This time, Scott said the point guard doesn't have the maturity that Chris Paul and Kyrie Irving had.\nScott coached Paul during his rookie season as Hornets head coach in 2005-06. Paul won Rookie of the Year after playing two years at Wake Forest University. He averaged 16.1 points with 7.8 assists and 5.1 rebounds per game. Irving won the 2012 Rookie of the Year Award, averaging 18.5 points per game with 5.4 assists and 3.7 rebounds per game as a 19-year-old rookie. \nIn a report , Scott admitted he hasn't been the \"easiest man in the world\" on Russell. He also explained that he thinks the rookie has the potential to be a \"very good basketball player\" and that's why he continues to try to develop him. But does Scott think Russell has potential to be as good as Irving and Paul?\nScott has chastised Russell's maturity all season. Last week, he went as far as saying that the rookie is \"not old enough\" to meet with him. Russell is 19, which is the same age Irving was when he was drafted by the Cavaliers.\nWhile some think  from constantly challenging Russell, it's certainly interesting to compare Russell's development with CP3's and Irving's considering all three played for the same coach as a rookie. \n"},
{"url": "http://www.foxsports.com/nba/power-rankings", "text": ""},
{"url": "http://www.foxsports.com/nba/story/kobe-bryant-lebron-james-shoes-los-angeles-lakers-cleveland-cavaliers-021116", "text": "\n had some flattering things to say about  following his final game in Cleveland.\nBut the soon-to-be retired  star showed King James the ultimate sign of respect Wednesday night when he gave James his signed game shoes before leaving Quicken Loans Arena for the last time.\nBryant personalized a pair of his purple and gold Nikes for James, making them out to \"LB\" with a special inscription.\nIronically, it wasn't the first time that James received a pair of shoes from the five-time NBA champion. Bryant actually  during LeBron's high school days."},
{"url": "http://www.foxsports.com/nba/story/kobe-bryant-lebron-james-los-angeles-lakers-cleveland-cavaliers-highlight-021116", "text": "\n is 37 years old and crawling his way through the 20th and final season of his career.  is 31 and one of the two best basketball players on the planet. \nRead these two sentences out loud, watch the clip below, then try to rationalize a universe that all too often fails to make a lick of sense:\nLeBron's  defeated Bryant's  , mostly because James cruised to the type of 29-point, 11-assist performance very few opponents can survive. But the King did not walk away unharmed.\nEven though Kobe finished with just 17 points on 31.3 percent shooting, his final spin move surely put a dent in LeBron's ego:\nJames' next and very last opportunity to exact revenge is March 10 in L.A. It's not a game you'll want to miss."},
{"url": "http://www.foxsports.com/nba/story/miami-heat-martin-spoof-intro-song-dwyane-wade-chris-bosh-021116", "text": "\nThe  aren't having as smooth a season as some pundits expected. They're 29-24, and if the season ended today they'd be a five seed in the Eastern Conference playoff bracket. \nBut none of that means the Heat are afraid to let its hair down every once in awhile. \nTheir spot-on spoof of the intro song from \"Martin\" is undeniably fantastic:\nThis is funny and great. But it begs a simple question: How did Miami choose who would be in the video? Like, where are Hassan Whiteside, Goran Dragic, Luol Deng, Gerald Green and Justise Winslow? Why is Josh Richardson here? \nCan we read too deep into this or are we on the right track?\nThe only exclusion that's remotely intriguing is Whiteside, who was ejected from Tuesday night's loss against the San Antonio Spurs for elbowing Boban Marjanovic in the neck. \nWhiteside can be funny...sometimes: \nBut his lackadaisical on-court attitude appears to be grating on his veteran teammates' nerves. Is it possible the decision to leave him out of their \"Martin\" video was intentional? Sure! Anything's possible. And if the free-agent-to-be winds up on another team next season, this should be viewed as the beginning of the end."},
{"url": "http://www.foxsports.com/nba/story/kobe-bryant-lebron-james-los-angeles-lakers-cleveland-cavaliers-kobe-retirement-tour-021116", "text": "\n has never been shy about his admiration for .\nThe  forward has always credited Bryant for being someone he could look up to -- a great role model and inspiration -- to help shape his illustrious NBA career.\nAnd while it may have taken a long, long time, James has earned Bryant's respect as both a player and friend.\nAs the 37-year-old Bryant presses on with his retirement tour, he found himself on James' home court in Cleveland on Wednesday night. The five-time NBA champion was asked about LeBron's best qualities.\n\"I think his greatest strength is his ability to communicate with others and instill confidence in others,\" Bryant said.\n\"He has a very big personality and one of the things I noticed about him, playing with him on the Olympic team, is his ability to communicate with others, get the best out of others and challenge them in a very gregarious way. It's one of the things I've always admired about him.\"\nJust like Kobe, LeBron is a great leader. While James is known for being a devoted student of the game, it was Bryant who said their relationship taught him a valuable virtue.\n\"He has a very, very big voice,\" Bryant said. \"He's able to direct guys and I think that's one of the things I appreciate the most about him and one of the things I've learned from him.\"\nJames echoed Bryant's sentiments.\n\"(There's) just a lot of mutual respect and friendship that we've built over the years,\" James said. \"That's it. Sometimes what's known doesn't need to be said. It's just words can't even describe sometimes us coming together, and for this to be one out of the two -- we got another one out in L.A. -- but for it to be here in our back yard, it meant a lot.\"\nThe Cavaliers and Lakers meet again March 10, at the Staples Center in Los Angeles."},
{"url": "http://www.foxsports.com/nba/story/health-scare-over-bosh-ready-to-enjoy-another-all-star-trip-021116", "text": "\n TORONTO (AP)  sees no need to reflect on where he was at this time last year.\n Physically, mentally and emotionally, he moved past it all long ago. The tubes stuck into the side of his chest, the fear of his life being in danger by the blood clot that attacked one of his lungs, the tests that would determine if his career could continue and the searing pain that accompanied each breath all are safely tucked away in the memory bank, and life as Bosh has known it for more than a decade has resumed.\n A year after a blood clot gave the  forward the scare of a lifetime, Bosh is again an All-Star.\n ''It doesn't surprise me,''  coach Erik Spoelstra said. ''I know C.B. probably as well as I've known anybody that I've coached and I know his competitive character. You don't ever want anything like that to happen to anybody in this league. The one thing you can take from it, though, is he has great perspective. I think we all can use that.''\n Bosh is back at the All-Star Game this weekend, and as an added bonus he'll do so in the city where his NBA career began. Only three players who will be taking part in Toronto this weekend - Kobe Bryant, LeBron James and Dwyane Wade - have more All-Star appearances than Bosh, who has been selected for the league's midseason showcase in each of the last 11 seasons.\n He's even taking part in the 3-point contest on Saturday night, not deterred in the least that at least one Las Vegas sports book lists him as the longest shot in the field of eight. So right now, he's perfectly content looking ahead, not back at the diagnosis that came just days after last year's All-Star weekend ended.\n ''I just put all that stuff behind me,'' Bosh said. ''Once I was free of it, once I stopped having pain, I was like, `Well, OK, I'm out the door and hopefully I won't be back here again.' I appreciate everything more, but that's really it. We can always talk about it. I don't mind talking about it, but personally I just walked away being thankful and leave it at that.''\n Bosh and Wade were on vacation with their wives in Haiti after last year's All-Star events in New York, and Bosh had been dealing with pain in his side for some time. The pain worsened, so Bosh's wife Adrienne insisted that her husband get checked out at a hospital. That's when the clot was found, Bosh's season was declared over and his future seemed most uncertain.\n But this season, he's been good as new.\n Bosh leads the Heat at 19.1 points per game, just ahead of Wade's 18.7 as the two veterans have Miami back in playoff contention. Bosh has also established a career-high in 3-pointers with 81 already, one of the reasons why he's in the long-range contest against the likes of more-traditional 3-point stars like Stephen Curry and Klay Thompson of the NBA champion Golden State Warriors.\n ''I don't have anything to lose,'' Bosh said. ''No one expects me to win, so I could just throw hook shots up there and I don't think it'll be a big deal.''\n All jokes aside, Bosh's NBA family is thrilled to have him back and flourishing again.\n ''He's such a class act on top of being a talented player,'' said San Antonio coach Gregg Popovich, who will lead the Western Conference All-Stars against Bosh and the Eastern Conference squad on Sunday night. ''You pull for those kind of guys even more than the usual just-good player. To have him back, seeing him doing what he loves and helping his team, it's good for him, his team, his city and the NBA, really.''\n Bosh's reception in Toronto might not exactly be warm - Raptors fans haven't necessarily forgotten that he left for then Miami in 2010 - but the weekend will still be one to savor.\n ''It takes a lot more to make me nervous,'' Bosh said. ''I've been in so many life situations. It's going to be exciting. It's going to be a lot of fun. Just to be in these situations, it's always a great thing.''"},
{"url": "http://www.foxsports.com/nba/story/lamar-odom-expected-to-attend-kanye-west-s-new-album-listening-party-021116", "text": "\nFormer NBA star Lamar Odom has been out of sight since being discovered unresponsive in a Nevada brothel a few months back, but that is expected to change today as he makes his first public appearance at Madison Square Garden in support of Kanye West's new album.\nOdom, who was in a coma and suffered several strokes and kidney failure in the aftermath of the brothel episode, has made major strides since being transferred from a Las Vegas hospital to Los Angeles. He's now recovering in a residence close to his estranged wife Khloe Kardashian and was apparently well enough to hike with Khloe and sister Kim just a few days back.\nNow, it appears Odom is ready to expand his horizons even further.\nAccording  and , Odom and Khloe Kardashian -- who called off their divorce in the wake of his health scare, but are not romantically linked -- boarded a private plane to New York to support their brother-in-law's , \"The Life of Pablo.\" West' is also live-streaming the event on music service Tidal, he announced Wednesday. \n(Side note: This is at least the third name Kanye's given his new record, so who knows if it'll stick.)\nAnyway, here's the shot of Khloe and Lamar boarding the plane from TMZ. \nAnd here's hoping for a full recovery after such a scary close call."},
{"url": "http://www.foxsports.com/north/story/minnesota-timberwolves-timberpups-tracker-february-11-edition-021116", "text": "\n\n\nA measure of per-minute production standardized such that the league average is 15.\n A measure of shooting efficiency that takes into account 2-point field goals, 3-point field goals, and free throws.\n An estimate of the percentage of team plays used by a player while he was on the floor.\n An estimate of points produced per 100 possessions.\n An estimate of points allowed per 100 possessions.\nA box score estimate of the points per 100 TEAM possessions that a player contributed above a replacement-level (-2.0) player, translated to an average team and prorated to an 82-game season.\n (age 20, second season)\n 20.8 points (20.7), 3.7 rebounds (1.7), 1.8 assists (1.3), 0.6 blocks (1.00), 35.1 minutes (33.7), .447 FG% (.429), .244 3PT% (.000)\n16.3 PER, .526 TS%, 28.0 USG%, 104 ORtg, 112 DRtg, -0.2 VORP\n Wiggins kept up his usual scoring pace last week, racking up 21 points in a win over Chicago, before picking up 15 points in a loss to New Orleans and bouncing back with a 26-point effort in a big victory over Toronto.\n (age 20, second season)\n12.8 points (12.7), 2.9 rebounds (2.3), 3.2 assists (3.3), 0.2 blocks (1.33), 24.4 minutes (34.0), .434 FG% (.333), .345 3PT% (.300)\n14.7 PER, .521 TS%, 26.1 USG%, 101 ORtg, 111 DRtg, 0.2 VORP\n LaVine started at shooting guard against the Raptors, chipping in 13 points, five assists and four rebounds, while hitting three 3-pointers. It was the best performance of the week for the second-year guard, who put up 13 points against Chicago and 14 points in a loss to New Orleans.\n (age 24, second season)\n 2.7 points (2.0), 2.0 rebounds (2.5), 0.5 assists (0.5), 0.2 blocks (0.00), 9.4 minutes (9.5), .414 FG% (.400), .348 3PT% (.000)\n 7.1 PER, .477 TS%, 16.4 USG%, 87 ORtg, 107 DRtg, -0.2 VORP\n It's tough to get a read on Payne since his return from the D-League, as not much has changed in his production. The Michigan State alum has played sparingly, and was inactive Chicago this week. Payne saw 11 minutes of action against the Pelicans, hitting a field goal, grabbing three rebounds and logging an assist, before posting a similar stat-line against Toronto.\n (age 20, first season)\n 17.1 points (26.7), 10.1 rebounds (13.3), 1.4 assists (1.0), 1.8 blocks (2.33), 30.1 minutes (35.3), .544 FG% (.625), .375 3PT% (.000)\n23.1 PER, .596 TS%, 24.5 USG%, 113 ORtg, 104 DRtg, 1.9 VORP\n It's been the K.A.T. and Gorgui show over the last few weeks. The duo combined for 50 points and 30 rebounds against the Bulls, before a slight dip in production led to a loss against New Orleans. However, Towns stormed back in a win over the Toronto Raptors, scoring 35 points.\n (age 27, first season)\n 4.5 points (5.0), 3.2 rebounds (3.0), 1.3 assists (1.0), 0.3 blocks (0.00), 17.9 minutes (12.0), .429 FG% (.833), .354 3PT% (N/A)\n 9.4 PER, .549 TS%, 12.0 USG%, 107 ORtg, 109 DRtg, 0.4 VORP\n Bjelica had a deceptively solid outing against the Pelicans on Monday, scoring 10 points and grabbing four rebounds with the game largely out of reach in the fourth quarter. Outside of that performance it was a quiet week for the Serbian forward, as he was inactive for a win over Chicago and was held to just two rebounds and one assist in a win over Toronto.\n (age 19, first season)\n 3.0 points (3.0), 1.8 rebounds (3.0), 1.9 assists (5.0), 0.1 blocks (0.00), 11.0 minutes (12.0), .333 FG% (.200), 0.2 3PT% (.000)\n 9.0 PER, .388 TS%, 19.1 USG%, 86 ORtg, 109 DRtg, -0.1 VORP\n Jones finally saw the floor this week, if only for just 12 minutes. The rookie picked up three points, added three rebounds and picked up five assists against the Pelicans."},
{"url": "http://www.foxsports.com/college-football/story/corey-robinson-david-robinson-notre-dame-wr-student-body-president-021116", "text": "\nCorey Robinson, a wide receiver at Notre Dame and the son of NBA great David Robinson, has  to be student body president.\nRobinson, a junior, teamed with sophomore running mate Becca Blais and faced two other tickets in the election.\n\"It feels very humbling to be able to be announced the president and vice president of Notre Dame. It's (definitely something) we've been dreaming about for a long time, and to be able to be here and lead the student body is just something I am very thankful for,\" Robinson told the school newspaper, The Observer.\nRobinson had 16 catches for 200 yards and a touchdown for the Irish in 2015. As a sophomore, he tallied 40 catches for 539 yards and five TDs. He has said he'll remain a member of the football team.\nBut in the meantime, he and Blais will work on fleshing out a team that will help them lead the student body when they take office on April 1.\n\"Campaign season's exhausting, but now we can finally start assembling our team and get ready to really make some of our policies and ideas real,\" Robinson said.\n(h/t )"},
{"url": "http://www.foxsports.com/wisconsin/story/milwaukee-bucks-young-bucks-tracker-february-11-021116", "text": "\n\n\nA glossary of the advanced statistics used for season totals:\nA measure of per-minute production standardized such that the league average is 15.\nA measure of shooting efficiency that takes into account 2-point field goals, 3-point field goals, and free throws.\nAn estimate of the percentage of team plays used by a player while he was on the floor.\nAn estimate of points produced per 100 possessions.\nAn estimate of points allowed per 100 possessions.\nA box score estimate of the points per 100 TEAM possessions that a player contributed above a replacement-level (-2.0) player, translated to an average team and prorated to an 82-game season.\n\n 15.8 points (14.0), 7.0 rebounds (4.5), 2.8 assists (1.0), 1.1 steals (1.5), 1.2 blocks (2.0), 34.6 minutes (35.0), 50.8 FG% (50.0), 23.1 3PT% (33.3).\n 16.6 PER, 57.1 percent TS%, 21.3 percent USG%, 107 ORtg, 108 DRtg, 1.1 VORP.\n It wasn't a spectacular week for Antetokounmpo, but it was nevertheless a solid one, with a pair of 14-points performances while shooting 50 percent from the field in each of the Bucks' two games. He remains  averaging 15+ points, 1+ blocks and 1+ steals per game.\n\n 11.6 points (13.0), 5.1 rebounds (6.0), 5.5 assists (4.5), 1.6 steals (2.0), 0.7 blocks (0.5), 30.6 minutes (27.5), 45.5 FG% (50.0), 29.5 3PT% (0.0).\n 14.8 PER, 50.0 percent TS%, 21.3 percent USG%, 97 ORtg, 107 DRtg, 0.6 VORP.\n Carter-Williams, along with Greg Monroe, was sent to the bench vs. Boston but he (like Monroe) rose to the challenge, posting 16 points, six rebounds and five assists in the win. Perhaps lost in MCW's up-and-down season is that he's shooting the ball much better (including making 6 of 8 shots vs. the Celtics). His field-goal percentage is at 45.5 percent, compared to 39.6 last season, accounting for one of the top season-to-season differentials in the league.\n\n 2.5 points (0.0), 1.0 rebounds (1.0), 1.0 assists (1.0), 0.3 steals (2.0), 0.0 blocks (0.0), 8.7 minutes (8.0), 40.0 FG% (n/a), 28.6 3PT% (n/a).\n 7.6 PER, 46.7 percent TS%, 17.2 percent USG%, 91 ORtg, 112 DRtg, -0.3 VORP.\n Ennis played in only one of the two games last week, but instead of coming in when the game was out of hand, he was inserted in the first half to give Milwaukee a spark against Utah. While he didn't score, he did have two steals as the strategy worked. Ennis was a +7 during his brief time on the court.\n\n 6.8 points (n/a), 3.9 rebounds (n/a), 1.0 assists (n/a), 0.3 steals (n/a), 2.0 blocks (n/a), 16.7 minutes (n/a), 59.1 FG% (n/a), n/a 3PT% (n/a).\n 18.8 PER, 59.4 percent TS%, 18.5 percent USG%, 109 ORtg, 105 DRtg, 0.7 VORP.\n A back injury continues to keep Henson sidelined, which is tough news for the Bucks as Henson is the team's best (only?) rim protector.\n\n The Westchester Knicks played three games last week. Inglis, still not in the starting lineup, played 19 minutes (5 points, 7 rebounds) in the first and 15 minutes (11 points, 6 rebounds) in the second. However, for Tuesday's game, Westchester got Thanasis Antetokounmpo back from the New York Knicks. The brother of the \"Greek Freak\" started and played 29 minutes. Inglis was a DNP-coach's decision. This bears watching. It is one thing to not play when you are in the NBA, another when you are in the NBDL.\n\n 17.7 points (19.0), 3.8 rebounds (5.5), 3.9 assists (3.5), 1.2 steals (1.5), 0.2 blocks (0.0), 36.1 minutes (39.0), 42.7 FG% (37.5), 40.6 3PT% (27.3).\n 15.6 PER, 54.9 percent TS%, 22.8 percent USG%, 108 ORtg, 112 DRtg, 0.8 VORP.\n Middleton continues to struggle with his shot -- double-teams and contested jumpers will do that -- having not made more than 37.5 percent of his attempts in six straight games. But he did have games of 18 and 20 points last week and continues to play a good overall all-around game.\n\n 3.3 points (2.0), 2.9 rebounds (3.0), 0.6 assists (0.0), 0.3 steals (0.0), 0.1 blocks (0.0), 14.3 minutes (15.0), 41.0 FG% (20.0), 1.000 3PT% (n/a).\n 7.6 PER, 44.2 percent TS%, 13.6 percent USG%, 95 ORtg, 111 DRtg, -0.6 VORP.\n Like Ennis, O'Bryant got some time against Utah -- his 14:43 was his most playing time of the month -- but also like Ennis he didn't play against Boston. As Jason Kidd continues to look for ways to change things up and get the Bucks in a groove, O'Bryant might be one of the odd guys out.\n\n 11.2 points (6.0), 4.6 rebounds (3.5), 1.4 assists (1.0), 0.8 steals (0.5), 0.4 blocks (0.5), 28.6 minutes (30.0), 48.6 FG% (33.3), 0.0 3PT% (n/a).\n 13.8 PER, 52.3 percent TS%, 18.6 percent USG%, 106 ORtg, 111 DRtg, -0.2 VORP.\n We're going to just chalk this up to a bad week. Keep in mind Parker played in only 25 games last season and is already up to 47 in 2015-16. He's someone who could perhaps use the All-Star break the most.\n\n 2.6 points (1.5), 1.2 rebounds (1.0), 0.4 assists (0.0), 0.3 steals (0.0), 0.2 blocks (0.0), 11.7 minutes (12.0), 31.5 FG% (33.3), 35.2 3PT% (50.0).\n 4.6 PER, 42.9 percent TS%, 12.9 percent USG%, 86 ORtg, 112 DRtg, -0.6 VORP.\n Vaughn didn't get as many minutes as last week, but he remains in the rotation. Plus, he made half of his 3-point attempts (OK, 1 of 2, but that's why he's on the court). After having a negative +/- for nine straight games, Vaughn has been in the positives the last three (a combined +13).\n"},
{"url": "http://www.foxsports.com/nba/story/pelicans-thunder-preview-021116", "text": "\n Monty Williams' impact on the  went beyond reaching the playoffs twice in five seasons. That has become obvious with Williams now grieving the untimely death of his wife.\n While the Pelicans and  are scheduled to play basketball Thursday night, their thoughts will be with Williams a day after the tragic crash.\n Williams went 173-221 in five seasons as coach of the Pelicans before he was dismissed after being swept by Golden State in the first round of the playoffs last season. He was subsequently hired to be coach Billy Donovan's top assistant with the Thunder.\n Tragedy struck Williams on the eve of this matchup with New Orleans. His wife Ingrid, 44, was killed in a crash just outside of downtown Oklahoma City. Her SUV was hit by an oncoming car that crossed the center line, said police Capt. Paco Valderrama. That driver was pronounced dead at the scene, and an investigation is ongoing.\n \"The Thunder organization has heavy hearts tonight with the news of Ingrid's passing,\" the Thunder said in a statement. \"Words cannot adequately describe how deep our sorrow is for the loss of Monty's wife. Our thoughts and prayers are with Monty and his family, and we will support him in every way possible.\n \"We know the entire community of Oklahoma City has them in their prayers.\"\n The same could be said of the Pelicans, who expressed their condolences following Wednesday's 100-96 win over Utah.\n \"It's just really, really tough when you know a guy like Monty and what he's all about,\" coach Alvin Gentry said. \"Then you realize that it's just a basketball game. That's all it is.\"\n Pelicans star Anthony Davis became close with Williams and his family during his first three NBA seasons and commented on Twitter:\n \"Completely devastated. Ingrid Williams was like a 2nd mother to me when I got to NOLA. My thoughts & prayers are with Monty & the family.\"\n With emotions almost certainly focused on Williams, the Thunder (39-14) will try to win for the 14th time in 16 games after Monday's 122-106 victory at Phoenix.\n They're averaging 112.4 points over that stretch, with Kevin Durant contributing 30.5. The star forward is scoring 36.3 per game over the last three after scoring 32 on 11-of-21 shooting against the Suns.\n Durant's 27.8 season average is third in the league. He's averaged 30.5 points in his last 11 home meetings with New Orleans (20-32), but a strained left hamstring forced him to miss a 110-103 win Nov. 18.\n Russell Westbrook led the way with 43 points, nine rebounds and eight assists in that meeting. He's had some of the best games of his career recently against the Pelicans, scoring at least 40 in each of the past three meetings while averaging 45.3 on 56.0 percent shooting.\n The Pelicans have followed a four-game slide with consecutive wins. Davis has totaled 46 points in those victories, hitting a running left-handed hook and a 3-pointer in the final minute to key Wednesday's win.\n \"I feel like as a leader of the team that's my responsibility,\" Davis said. \"At some point in time, you've got to take over a game.\"\n Jrue Holiday had 21 points and nine assists against the Jazz, two days after getting 27 and nine in a 116-102 win at Minnesota.\n The veteran guard shared his thoughts on the Williams' tragedy.\n \"The players that were here with Monty and their family definitely felt it,\" said Holiday, who spent two seasons under Williams. \"Obviously we're all blessed to play the game of basketball but family comes before that. And I know most of the guys were thinking about our families, thinking about his family.\""},
{"url": "http://www.foxsports.com/nba/story/curry-flirts-with-triple-double-warriors-top-suns-112-104-021116", "text": "\n PHOENIX (AP) The -Phoenix mismatch wasn't the blowout most expected, just another routine  victory.\n  nearly had a triple-double before sitting out the fourth quarter, and the Warriors stormed into the All-Star break on an 11-game winning streak with a 112-104 victory over the free-falling  on Wednesday night.\n ''It wasn't our best effort but I told them before the game keep the turnovers down, just be solid and we should be fine,'' Warriors coach Steve Kerr said. ''For the most part, we did a good job of taking care of the ball. Thirteen turnovers is a pretty good number for us. We didn't do much else that well but it was enough.''\n Curry had 26 points, nine rebounds and nine assists for the defending NBA champions. At 48-4, the Warriors enter the break with the best record through 52 games in NBA history, one win better than the 1995-96 Chicago Bulls and 1966-67 Philadelphia 76ers. Those Bulls finished the season with a league-record 72 wins.\n Kerr called his team's record ''shocking.''\n ''Nobody has ever done it, right?'' he said. ''Fifty-two games in to have only lost four games is remarkable. It speaks to the talent and chemistry of the players. We have a deep roster and they love playing together, they enjoy winning and they are good at it.''\n Klay Thompson added 24 points for Golden State. He called those 52 games ''kind of a blur.''\n ''It has gone by really fast,'' he said. ''Winning obviously helps that but we couldn't have asked for a better pre-All-Star break performance. We still have some room for improvement, believe it or not, but it is really surreal to be 48-4.''\n Curry called the 48-4 record ''pretty satisfying.''\n ''We handled a lot of different challenges pretty well this first half of the season,'' he said.\n Archie Goodwin scored 20 points and Markieff Morris 19 for the Suns, who have lost nine straight and 24 of 26. Rookie guard Devin Booker added 15 points and a career-best 10 assists.\n Goodwin and Morris emerged the team's leading scorers after scuffling on the bench during a first-quarter timeout.\n ''That's part of being a big brother, being a leader,'' Morris said. ''Sometimes little brothers and big brothers get into it. That's what happened - wrong place, wrong time.''\n Golden State was up by as many as 22 points in the second and third quarters, but the Suns cut it to 11 late in the third and 10 a couple of times in the fourth. The only time Phoenix got within single digits in the second half was on Goodwin's breakaway dunk just before the final buzzer.\n Phoenix stayed with the Warriors shot for shot for a little while and was down only 29-28 after one quarter.\n But the Warriors took off with a 16-0 second-quarter run. Curry sank a 28-foot 3-pointer, followed immediately by a 29-footer, and Green made a pair of free throws to put Golden State up 53-35 with 2:15 left in the half. The Warriors led 57-43 at the break.\n  SCUFFLE\n Morris and Goodwin got into a heated exchange on the bench during an early timeout. Television replays showed it started with Morris vehemently saying something to Goodwin. He appeared to slap Morris' hand away, then a lot of shoving ensued. Goodwin came out of the game for the remainder of the first quarter.\n ''I wouldn't say it was a fight,'' Phoenix interim coach Earl Watson said. ''I would say it's a pushing match. I've never seen an NBA player really fight. They push and then run behind referees.''\n Watson said Morris and Goodwin roomed together earlier this season.\n ''We're family,'' Goodwin said. ''It happens. I love him like a brother, he loves me.''\n Morris called Goodwin ''my little brother.''\n ''I've been with him for three years and I know him really well,'' Morris said. ''I know his family. We're really close. It happens sometimes.''\n TIP-INS\n Warriors: Curry sank a 3-pointer for the 123rd consecutive game, four shy of Kyle Korver's NBA record. ... Curry has seven career triple-doubles, two this season. ... Golden State comes out of the All-Star break with six straight road games. ... The Warriors have won six straight in the series.\n Suns: Phoenix is 0-5 under Watson, all of them at home. ... Mirza Teletovic filled Booker's car with Styrofoam packing peanuts on Tuesday while the rookie was inside the arena practicing for this weekend's NBA 3-point contest.\n UP NEXT\n Warriors: At Portland on Feb. 19.\n Suns: Host Houston on Feb. 19."},
{"url": "http://www.foxsports.com/nba/story/cleveland-cavaliers-kevin-love-boston-celtics-kelly-olynyk-both-suffer-shoulder-injuries-021016", "text": "\nFolks were tweeting about karma when the '  suffered a shoulder injury on Wednesday. That's because Olynyk was the guy who got locked up with the '  during the playoffs last season and separated Love's shoulder, knocking him out for the postseason.\nExcept it was even weirder than that, because Olynyk's injury happened on the same night -- at about the same point in the game -- that Love hurt his left shoulder again.\nNear halftime of the ' victory over the Los Angeles Lakers, Love , his left arm dangling. Love told reporters he had jammed it while making a move against Kobe Bryant.\nThe club said Love had suffered a shoulder contusion. General Manager David Griffin told ESPN that he's hopeful Love won't miss any games.\nLove said he felt a shooting pain, \"like fire was running down my arm,\" but said that it was \"just a stinger\" and that he felt fine (see video above).\nOlynyk was injured when he was fouled by the Los Angeles Clippers' DeAndre Jordan near the end of the second quarter. The Celtics said Olynyk suferred a subluxation, or partial dislocation, of his right shoulder. However, he also seems unlikely to miss any time. Love and Olynyk will have over a week to heal because both clubs are now off for the All-Star break.\nStill, Twitter couldn't help talking about not-so-instant karma.\nWe don't know about any karma, but surely some people -- Alanis Morrissette, perhaps? -- would see irony in that Olynyk and Love hurt their shoulders on the same night. We'll just call it what it actually was -- quite the coincidence.\n "},
{"url": "http://www.foxsports.com/southwest/story/thunder-assistant-coach-s-wife-dies-after-car-accident-021016", "text": "\nOKLAHOMA CITY, Okla. (AP) -- The wife of  assistant coach Monty Williams died Wednesday evening at a hospital from injuries suffered in a car crash, police said.\nThe 44-year-old Ingrid Williams was involved in a crash Tuesday night. An oncoming car crossed the center line and hit her SUV just outside of downtown Oklahoma City, said police Capt. Paco Valderrama. That driver was pronounced dead at the scene, Valderrrama said.\nThe Thunder issued a statement expressing \"deep sorrow\" and saying the team would support Williams \"in every way possible.\" Williams joined the Thunder this season after five seasons as the New Orleans Pelicans head coach.\nA statement on behalf of the Pelicans' owners said Ingrid Williams will be remembered \"as one of the most generous, kind and humble individuals we've ever known.\"\nThe Pelicans held a moment of silence for her before tip-off of their game against the Utah Jazz on Wednesday night. Monty Williams was hired by New Orleans to his first and only head coaching job in 2010 and fired after last season. He helped guide New Orleans to the postseason twice and had a record of 173-221.\nDenver coach Michael Malone became choked up while talking about Williams' death after his team's win over the Detroit Pistons.\n\"I apologized to the team. The first half, I coached very angry,\" he said. \"I don't know if you guys heard, Monty Williams, a good friend of mine, his wife was killed in an accident.\"\nAfter a long pause, he said, \"So I apologized to them because it's taking my anger out on them, and they don't deserve that.\"\nIt wasn't immediately clear what caused the oncoming car to swerve. An investigation is ongoing.\nMonty Williams was the 24th pick in the 1994 NBA Draft. He played nine seasons with New York, San Antonio, Denver, Orlando and Philadelphia."},
{"url": "http://www.foxsports.com/nba/story/lillard-scores-31-as-surging-blazers-beat-rockets-116-103-021116", "text": "\n PORTLAND, Ore. (AP)  sparked a second-quarter outburst for the  and finished with 31 points and nine assists in a 116-103 win over the Houston Rockets on Wednesday night.\n Maurice Harkless set season highs with 19 points and 13 rebounds for the Blazers, who moved past Houston into a tie with Utah for seventh place in the Western Conference standings. They enter the All-Star break having won three in a row and eight of nine.\n James Harden had 34 points, 11 assists and nine rebounds for the Rockets, who have dropped three straight and six of eight to fall out of playoff position. Dwight Howard dominated the paint with 28 points and 13 rebounds.\n After trailing by as many as 21 in the second half, Houston closed to 93-88 early in the fourth quarter. But a Blazers timeout led to a scoring burst that restored the lead to 20 with 3:47 to go."},
{"url": "http://www.foxsports.com/wisconsin/story/milwaukee-bucks-khris-middleton-3-pointers-021116", "text": "\nWhen the  host the Washington Wizards on Thursday night perhaps we should expect more than a few 3-pointers to be made.\nMilwaukee has been shooting much better from beyond the arc this month compared to last month. In January, the Bucks made just 30.4 percent of its 3-point attempts. In February, Milwaukee has made 40.3 percent of its 3s. That increase of 9.9 percent is the second-best in the NBA from January to February.\nWho will make those 3s? Well,  is a pretty good bet.\n\n\n\nIt isn't just the Bucks. Washington had made 51.4 percent of its 3s against the Bucks this season, which is the best mark of any club vs. an opponent in the NBA this season (min. three games).\nMore 3s, of course, means more scoring, which the Bradley Center has seen plenty of recently. There have been five straight games at the BC in which both the Bucks and their opponent have scored in triple figures. That is the fourth-longest such streak in Bucks history -- seven being the most (Jan. 31-Feb. 22, 2009) and six being accomplished twice (Feb. 10-29, 2004 and April 13, 2004-Nov. 12, 2005).\nOther notes:\n-- Greg Monroe will come off the bench for Milwaukee again. Against Boston, he had 29 points and 12 rebounds. That marked just the sixth time in the NBA this season a player had 25+ points and 10+ rebounds coming off the bench.\n-- Middleton averages 17.3. points per game vs. Washington, which is his second-highest career total vs. any team (18.2 ppg vs. Orlando).\n-- Washington's John Wall has 27 games of 10+ assists since Dec. 1, the most in the NBA during that span.\n"},
{"url": "http://www.foxsports.com/nba/story/hornets-take-advantage-of-pacers-poor-defense-in-117-95-win-021016", "text": "\n INDIANAPOLIS (AP) Kemba Walker scored 25 points and Jeremy Lamb had 16 as the suddenly surging  rolled to a 117-95 victory over the  on Wednesday night.\n Six players scored in double figures for the Hornets (27-26), who won their third straight - and their first at Indiana since November 2008.\n Paul George led the Pacers (28-25) with 22 points, eight rebounds and six assists. George Hill added 10 points, but it wasn't even close to being enough to extend a two-game winning streak.\n Charlotte started the second quarter on a 17-4 run to take a 42-29 lead.\n And with Indiana's defense struggling to stay in front of the Hornets' deft drivers and potent 3-point shooters, the Pacers never had a chance.\n Indiana did cut the deficit to 75-64 late in the third, but Charlotte answered with seven straight points, extended the lead to 89-70 after three and pulled away in the fourth."},
{"url": "http://www.foxsports.com/nba/story/okc-thunder-assistant-coach-s-wife-dies-after-car-accident-021016", "text": "\n OKLAHOMA CITY, Okla. (AP) The wife of  assistant coach Monty Williams has died from injuries suffered in a car crash.\n Oklahoma City police say Ingrid Williams, the wife of the former New Orleans Pelicans head coach, died Wednesday evening at a hospital.\n Capt. Paco Valderrama says the 44-year-old's SUV was struck Tuesday night just outside of downtown Oklahoma City when an oncoming car crossed the center line.\n Valderrama says that driver was pronounced dead at the scene.\n The Thunder issued a statement expressing ''deep sorrow'' and saying the team would support Williams ''in every way possible.''\n A statement on behalf of the Pelicans' owners said Ingrid Williams will be remembered ''as one of the most generous, kind and humble individuals we've ever known.''\n It wasn't immediately clear what caused the oncoming car to swerve. An investigation is ongoing."},
{"url": "http://www.foxsports.com/arizona/story/stephen-curry-flirts-with-triple-double-warriors-down-suns-021016", "text": "\n The -Phoenix mismatch wasn't the blowout most expected, just another routine  victory.\n nearly had a triple-double before sitting out the fourth quarter, and the Warriors stormed into the All-Star break on an 11-game winning streak with a 112-104 victory over the free-falling Suns on Wednesday night.\n\"It wasn't our best effort but I told them before the game keep the turnovers down, just be solid and we should be fine,\" Warriors coach Steve Kerr said. \"For the most part, we did a good job of taking care of the ball. Thirteen turnovers is a pretty good number for us. We didn't do much else that well but it was enough.\"\nCurry had 26 points, nine rebounds and nine assists for the defending NBA champions. At 48-4, the Warriors enter the break with the best record through 52 games in NBA history, one win better than the 1995-96 Chicago Bulls and 1966-67 Philadelphia 76ers. Those Bulls finished the season with a league-record 72 wins.\nKerr called his team's record \"shocking.\"\n\"Nobody has ever done it, right?\" he said. \"Fifty-two games in to have only lost four games is remarkable. It speaks to the talent and chemistry of the players. We have a deep roster and they love playing together, they enjoy winning and they are good at it.\"\nKlay Thompson added 24 points for Golden State. He called those 52 games \"kind of a blur.\"\n\"It has gone by really fast,\" he said. \"Winning obviously helps that but we couldn't have asked for a better pre-All-Star break performance. We still have some room for improvement, believe it or not, but it is really surreal to be 48-4.\"\nCurry called the 48-4 record \"pretty satisfying.\"\n\"We handled a lot of different challenges pretty well this first half of the season,\" he said.\nArchie Goodwin scored 20 points and Markieff Morris 19 for the Suns, who have lost nine straight and 24 of 26. Rookie guard Devin Booker added 15 points and a career-best 10 assists.\nGolden State was up by as many as 22 points in the second and third quarters, but the Suns cut it to 11 late in the third and 10 a couple of times in the fourth. The only time Phoenix got within single digits in the second half was on Goodwin's breakaway dunk just before the final buzzer.\nPhoenix stayed with the Warriors shot for shot for a little while and was down only 29-28 after one quarter.\nBut the Warriors took off with a 16-0 second-quarter run. Curry sank a 28-foot 3-pointer, followed immediately by a 29-footer, and Green made a pair of free throws to put Golden State up 53-35 with 2:15 left in the half. The Warriors led 57-43 at the break.\n\n\n Curry sank a 3-pointer for the 123rd consecutive game, four shy of Kyle Korver's NBA record. ... Curry has seven career triple-doubles, two this season. ... Golden State comes out of the All-Star break with six straight road games. ... The Warriors have won six straight in the series.\n Phoenix is 0-5 under Watson, all of them at home. ... Mirza Teletovic filled Booker's car with Styrofoam packing peanuts on Tuesday while the rookie was inside the arena practicing for this weekend's NBA 3-point contest.\n\n\n At Portland on Feb. 19.\n Host Houston on Feb. 19."},
{"url": "http://www.foxsports.com/nba/story/nuggets-hold-off-short-handed-pistons-103-92-021016", "text": "\n AUBURN HILLS, Mich. (AP) Will Barton scored 15 of his 20 points in the fourth quarter, and the  held off the depleted  103-92 on Wednesday night.\n Detroit was without three starters. Kentavious Caldwell-Pope has been out with a core muscle strain, and the team announced before the game that Reggie Jackson and Ersan Ilyasova had been ill and would be sidelined as well.\n Denver led by eight early in the fourth, but the Pistons closed to 83-82 after consecutive 3-pointers by Anthony Tolliver. Randy Foye made a 3 to halt that run, and Denver was able to hold onto its lead the rest of the way.\n Andre Drummond had 15 points and 17 rebounds for Detroit but shot 7 of 22 from the field."},
{"url": "http://www.foxsports.com/nba/story/nba-capsules-021016", "text": "\n OAKLAND, Calif. (AP) Stephen Curry had 35 points, nine assists and six rebounds, and the  put away the Houston Rockets in the fourth quarter for a 123-110 victory Tuesday night.\n Andrew Bogut added 13 points, 11 rebounds, three steals and a season-high six blocked shots - three in the fourth - during one of his best games yet.\n Andre Iguodala and Harrison Barnes hit consecutive 3-pointers to start the fourth quarter to get the defending champions going after the game was tied at 93 after the third.\n Golden State won its 42nd straight regular-season home game and is 24-0 at Oracle Arena this season. The Warriors are within two home victories of matching the Chicago Bulls' NBA-record home winning streak of 44 games from March 30, 1995 to April 4, 1996.\n James Harden overcame a scoreless first quarter to finish with 37 points, five assists and five rebounds in Houston's eighth straight loss to Golden State.\n The Warriors went 3-0 against Houston to sweep the Rockets in consecutive seasons for the first time.\n  119,  101\n  (AP) - LaMarcus Aldridge scored 28 points, Kawhi Leonard added 23 and  got seven points on one possession in the fourth quarter against .\n Danny Green added 15 points for the , who have won six straight over the  going back to the 2014 NBA Finals.\n Dwyane Wade scored 20 points on 9-for-12 shooting for Miami, which goes into the All-Star break on a two-game slide. Chris Bosh scored 18 and Hassan Whiteside added 14 points and six rebounds before getting ejected during that pivotal possession in the fourth.\n Whiteside was assessed a flagrant-2 foul for elbowing the Spurs' Boban Marjanovic as they tried to get position for a rebound. That was part of a seven-point trip for the Spurs, who pushed an 87-80 lead to 94-80 in 16 seconds and weren't threatened again.\n  121, MAVERICKS 119, OT\n DALLAS (AP) - Gordon Hayward hit a fadeaway jumper at the buzzer in overtime and Utah extended its season-best winning streak to seven games.\n Rodney Hood had a tying 3-pointer with 1.5 seconds left in regulation as the  ended a 10-game losing streak in Dallas. Their last win on the Mavericks' home court was Jan. 9, 2010.\n Hood finished with 29 points, and Hayward had 20, including 13 in the second half and overtime.\n Chandler Parsons led Dallas with 24 points but missed an open 3-pointer for the lead with 24 seconds left in the Mavericks' second straight overtime game and NBA-high eighth of the season.\n WIZARDS 111, KNICKS 108\n NEW YORK (AP) - John Wall had 28 points and 17 assists, Bradley Beal scored 26, and Washington beat New York in the Knicks' first game under Kurt Rambis.\n Wall made four free throws in the final 6.6 seconds and the Wizards held on when Langston Galloway's 3-pointer at the buzzer was just short.\n Carmelo Anthony had 33 points and 13 rebounds, but the Knicks lost their sixth straight in their first game since firing Derek Fisher on Monday. They have dropped 10 of 11 and started Rambis' era the same way Fisher's ended, by quickly falling in a huge early hole.\n Rookie Kristaps Porzingis scored 20 points, but just two after his 14-point third quarter.\n  112, CELTICS 111\n MILWAUKEE (AP) - Khris Middleton made one of two free throws with 0.6 seconds left and Milwaukee defeated Boston.\n Middleton drew a foul on Avery Bradley to get to the line. Boston had tied the game when Kelly Olynyk made two free throws with one second remaining.\n Milwaukee appeared to have won the game on Greg Monroe's last-second hook shot, giving the  a 111-109 lead. Olynyk then drew the foul with no time expiring off the clock.\n Monroe, who was removed from the starting lineup, had 29 points and 12 rebounds as the Bucks ended a five-game losing streak. Middleton had 20 points and Michael Carter-Williams, who also was benched, added 16.\n Crowder and Bradley had 18 points each for the Celtics."},
{"url": "http://www.foxsports.com/nba/story/kobe-lebron-share-court-as-cavaliers-beat-lakers-120-111-021016", "text": "\n CLEVELAND (AP) With 20,000 fans roaring, Kobe Bryant and LeBron James hugged and seemed to be in a world of their own.\n One on one.\n ''It was just a lot of mutual respect,'' James said of the embrace. ''Sometimes what is known doesn't need to be said.''\n The two superstars shared the same floor in Cleveland for the final time on Wednesday night as the , despite playing the second half without Kevin Love, downed the  120-111 in their last game before the All-Star break.\n Kyrie Irving scored a season-high 35 points and James added 29 for the , who feared Love had re-injured his surgically repaired left shoulder in the first half. However, following the game Love said he only has a ''stinger'' and doesn't expect to miss any time.\n Bryant finished with 17 points in his last performance in Cleveland, where many fans cheered his every move and fans serenaded him with ''Ko-be'' chants throughout the night.\n For James, there has been no player of his era quite like Bryant.\n ''His competitive nature,'' James said when asked what he admires most about Bryant. ''A lot of guys might be bigger, taller or jump higher, but it's something that's in you that gets you to that level.''\n Lou Williams scored 28 to lead the Lakers, who have dropped 13 of 15.\n The Cavs caught a major scare late in the second quarter when Love quickly left the floor after getting his arm caught under Bryant's while working in the post.\n ''At the time I really didn't know what it was,'' Love said. ''It's like when you get hit in the funny bone in your elbow, it's just shooting pain. It felt like fire was running down my arm. It's just a stinger.''\n It's the same shoulder Love had dislocated in the first round of last season's playoffs when Boston center Kelly Olynyk yanked it from the socket while battling for a loose ball. Losing Love disrupted the Cavs' title chase and for a moment Wednesday night, it appeared Cleveland would be without him again.\n Cleveland carried a 19-point lead into the fourth quarter, but struggled to put away the lowly Lakers.\n Bryant converted a 4-point play and made three free throws to get Los Angeles within 108-100, but J.R. Smith and James made 3-pointers in the final three minutes.\n The Cavs tastefully saluted Bryant during pregame introductions with a video presentation of some of his best moments. Bryant watched the tribute on the arena's gigantic scoreboard before hearing his name and taking the floor with his teammates. He patted his chest in appreciation as Cleveland's crowd - dotted with fans wearing Bryant's purple-and-gold No. 24 jersey - chanted his name.\n ''It felt great to play here so many years and get that type of reaction,'' Bryant said of the crowd's salute. ''It was really special.''\n Before the opening tip, Bryant walked to the Cavs bench and hugged Cleveland coach Tyronn Lue, who won two NBA titles as his teammate in Los Angeles.\n Bryant and James started out guarding each other, a matchup NBA fans never got to witness in the Finals and will only see one more time when the Cavs visit the Lakers on March 10.\n Before the game, Bryant said he's never viewed James as a rival.\n ''I never looked to see what he was doing,'' Bryant said. ''I just felt like we were a completely different generation. I just missed that thing completely. Not like a Magic-Bird sort of thing. From the time he came into the league it was more helping him, giving him direction, advice.''\n James said he's sorry he never developed a rivalry with Bryant.\n ''We never had the matchup that everybody wanted, that we wanted,'' he said.\n SAYING GOODBYE\n Bryant said there have great moments and some hard ones to handle during his league-wide farewell tour.\n ''That we stink, that's tough,'' he said. ''But being able to say, `thank you' to the fans, it's tough for me to express how I feel. It's hard to put into words how much I appreciate it.''\n SENSITIVE SHOT\n Lakers rookie D'Angelo Russell got drilled in his groin area by a hard pass thrown by James in the fourth quarter. Russell dropped to the floor and stayed there for several moments before he walked gingerly to the bench, where Bryant was laughing at him.\n ''Once I knew he was OK, the jokes write themselves,'' Bryant said.\n TIP-INS\n Lakers: One of Bryant's roles in his final season is to mentor Russell, the No. 2 overall pick in last year's draft. ''Well, it's like a big brother, or a grandfather,'' Bryant cracked. ''I just talk to him often about the game and the mentality and technique and execution, as well as some of the psychological things that he's going through and how to navigate through those. ... The Lakers have lost eight of nine on the road.\n Cavaliers: G Matthew Dellavedova missed his fifth straight game with left hamstring soreness. ... James entered the night trailing Paul Pierce for 15th place on the NBA's career scoring list. ... Because he's played with Bryant and coached James, Lue is as qualified as anyone to compare the two superstars. ''They're both the same,'' he said. ''Kobe is more ready to fight you, he'll cuss you out. LeBron is more by example.''\n UP NEXT\n Lakers: Host San Antonio on Feb. 19.\n Cavaliers: Host Chicago on Feb. 18."},
{"url": "http://www.foxsports.com/nba/story/teague-horford-lead-hawks-over-bulls-113-90-021016", "text": "\n CHICAGO (AP) Jeff Teague had 17 points and eight assists, Al Horford scored 16 and the  routed the struggling Chicago Bulls 113-90 on Wednesday night.\n Dennis Schroder had 18 points and hit three of his team's 13 3-pointers. Paul Millsap scored 15, and the Southeast Division leaders headed into the All-Star break on a winning note after back-to-back losses to last-place Orlando.\n The Hawks led by five at halftime and broke it open in the third quarter, sending the sloppy Bulls to their fourth straight loss and 13th in 18 games.\n Pau Gasol had 20 points and 10 rebounds for Chicago after being selected Tuesday to his sixth All-Star team as a replacement for injured Bulls teammate Jimmy Butler."},
{"url": "http://www.foxsports.com/nba/story/kobe-lebron-share-court-as-cavaliers-beat-lakers-120-111-021116", "text": "\n CLEVELAND (AP) With 20,000 fans roaring, Kobe Bryant and LeBron James hugged and seemed to be in a world of their own.\n One on one.\n ''It was just a lot of mutual respect,'' James said of the embrace. ''Sometimes what is known doesn't need to be said.''\n The two superstars shared the same floor in Cleveland for the final time on Wednesday night as the , despite playing the second half without Kevin Love, downed the  120-111 in their last game before the All-Star break.\n Kyrie Irving scored a season-high 35 points and James added 29 for the , who feared Love had re-injured his surgically repaired left shoulder in the first half. However, following the game Love said he only has a ''stinger'' and doesn't expect to miss any time.\n Bryant finished with 17 points in his last performance in Cleveland, where many fans cheered his every move and fans serenaded him with ''Ko-be'' chants throughout the night.\n For James, there has been no player of his era quite like Bryant.\n ''His competitive nature,'' James said when asked what he admires most about Bryant. ''A lot of guys might be bigger, taller or jump higher, but it's something that's in you that gets you to that level.''\n Lou Williams scored 28 to lead the Lakers, who have dropped 13 of 15.\n The Cavs caught a major scare late in the second quarter when Love quickly left the floor after getting his arm caught under Bryant's while working in the post.\n ''At the time I really didn't know what it was,'' Love said. ''It's like when you get hit in the funny bone in your elbow, it's just shooting pain. It felt like fire was running down my arm. It's just a stinger.''\n It's the same shoulder Love had dislocated in the first round of last season's playoffs when Boston center Kelly Olynyk yanked it from the socket while battling for a loose ball. Losing Love disrupted the Cavs' title chase and for a moment Wednesday night, it appeared Cleveland would be without him again.\n Cleveland carried a 19-point lead into the fourth quarter, but struggled to put away the lowly Lakers.\n Bryant converted a 4-point play and made three free throws to get Los Angeles within 108-100, but J.R. Smith and James made 3-pointers in the final three minutes.\n The Cavs tastefully saluted Bryant during pregame introductions with a video presentation of some of his best moments. Bryant watched the tribute on the arena's gigantic scoreboard before hearing his name and taking the floor with his teammates. He patted his chest in appreciation as Cleveland's crowd - dotted with fans wearing Bryant's purple-and-gold No. 24 jersey - chanted his name.\n ''It felt great to play here so many years and get that type of reaction,'' Bryant said of the crowd's salute. ''It was really special.''\n Before the opening tip, Bryant hugged Cleveland coach Tyronn Lue, who won two NBA titles as his teammate in Los Angeles.\n Bryant and James started out guarding each other, a matchup NBA fans never got to witness in the Finals and will only see one more time when the Cavs visit the Lakers on March 10.\n Before the game, Bryant said he's never viewed James as a rival.\n ''I never looked to see what he was doing,'' Bryant said. ''I just felt like we were a completely different generation. I just missed that thing completely. Not like a Magic-Bird sort of thing. From the time he came into the league it was more helping him, giving him direction, advice.''\n James said he's sorry he never developed a rivalry with Bryant.\n ''We never had the matchup that everybody wanted, that we wanted,'' he said.\n SAYING GOODBYE\n Bryant said there have great moments and some hard ones to handle during his league-wide farewell tour.\n ''That we stink, that's tough,'' he said. ''But being able to say, `thank you' to the fans, it's tough for me to express how I feel. It's hard to put into words how much I appreciate it.''\n SENSITIVE SHOT\n Lakers rookie D'Angelo Russell got drilled in his groin area by a hard pass thrown by James in the fourth quarter. Russell dropped to the floor and stayed there for several moments before he walked gingerly to the bench, where Bryant was laughing at him.\n ''Once I knew he was OK, the jokes write themselves,'' Bryant said.\n ACHES AND PAINS\n Bryant will make his 16th All-Star game appearance this weekend, but he could use the extra rest.\n ''I feel horrible, my ankles, knees, everything,'' Bryant said. ''This stretch couldn't come at a better time. My ankles hurt. My knees hurt. I'm looking forward to having a complete week where I do nothing.''\n TIP-INS\n Lakers: One of Bryant's roles in his final season is to mentor Russell, the No. 2 overall pick in last year's draft. ''Well, it's like a big brother, or a grandfather,'' Bryant cracked. ''I just talk to him often about the game and the mentality and technique and execution, as well as some of the psychological things that he's going through and how to navigate through those. ... The Lakers have lost eight of nine on the road.\n Cavaliers: G Matthew Dellavedova missed his fifth straight game with left hamstring soreness. ... James entered the night trailing Paul Pierce for 15th place on the NBA's career scoring list. ... Because he's played with Bryant and coached James, Lue is as qualified as anyone to compare the two superstars. ''They're both the same,'' he said. ''Kobe is more ready to fight you, he'll cuss you out. LeBron is more by example.''\n UP NEXT\n Lakers: Host San Antonio on Feb. 19.\n Cavaliers: Host Chicago on Feb. 18."},
{"url": "http://www.foxsports.com/nba/story/kobe-reflects-on-lebron-before-final-matchup-in-cleveland-021016", "text": "\n CLEVELAND (AP)  remembers giving a pair of his sneakers to  as a gift and offering the teenager some advice.\n The years in between have passed in a blur.\n On his final visit to Cleveland to play against James on Wednesday night, Bryant reflected on his relationship with a player who once hung a poster of him on his bedroom wall in Akron, Ohio, and has grown into a valued friend.\n And as gets ready to say goodbye to the NBA after two decades, Bryant was stunned to learn that James, too, is on the back half of his career.\n ''Is this his 10th year?'' Bryant asked, before being told that James has been in the league longer. ''Eleventh year? Thirteenth year! He's a true, true vet. It's strange. To me, it still seems like he just got into the league. Pretty crazy. ... He might retire soon, too.''\n Bryant was at ease during his interview session with reporters before the  played the . This is Bryant's sendoff, his farewell tour, and the 37-year-old is trying to savor every moment.\n When he was in high school and on the verge of becoming a household name, James met Bryant before playing against Carmelo Anthony in an All-Star game in Philadelphia. It was then that Bryant dropped some knowledge on James.\n ''I remember sitting down and talking with him,'' Bryant said. ''The advice I gave him, because he would have so much coming at him, was focus on the game. Stay true to the craft. Everything else would sort out. That was the most important piece of advice I could give him.''\n On several occasions this season, James has spoken with reverence toward Bryant, one of the game's most celebrated players with whom he is often compared. The two didn't always have the strongest connection, but is has matured over the years, helped by them playing together on the U.S. Olympic team.\n Bryant and James once seemed on a collision course to meet in the NBA Finals, but the matchup never materialized, disappointing a basketball world wanting to see the greats go head-to-head with everything on the line.\n ''We never crossed paths unfortunately,'' Bryant said. ''I just wanted to win the damn thing. I didn't care who we played. For the fans it probably stinks because it would have been a great matchup, but from a player's perspective it doesn't matter who you play. ... Just want to win the championship.''\n Bryant recalled previous visits to Cleveland, including the 1997 All-Star Game when he participated in the dunk contest as a rookie. That year the showcased the game's Top 50 players, a who's who of hoops immortality that had Bryant in a daze.\n ''Man, I remember walking around the hotel, I remember walking around this arena, and just running into a great after great after great after great after great,'' Bryant said. ''I grew up watching all of these players. So I watched all of the classic videos, the films, the books. So to see these players all walking around, it was pretty amazing.''\n This weekend, Bryant will take his All-Star bow. It will be the last time he mingles with his peers, who will undoubtedly honor him throughout the festivities in Toronto.\n Bryant's career has come full circle.\n ''I can't wait to be around them and talk to them and see how far the game has progressed, see all this young talent the different generations of players,'' said the 16-time All-Star. ''To me, LeBron is still young. I can't fathom this is his 13th season and the generations that come after him - the Durant generations, the Curry generations. There are so many generations in between that. It's going to be fun for me to be around.\n ''When I first played in an All-Star game, imagine an 18-year-old, 19-year-old kid walking into a locker room and here's John Stockton with his little itty-bitty shorts. There's Barkley. There's Clyde Drexler. There's Gary Payton. I was a 19-year-kid.''"},
{"url": "http://www.foxsports.com/nba/story/warriors-beat-suns-improve-to-48-4-stephen-curry-sits-fourth-quarter-just-misses-triple-double-021016", "text": "\n\nThe -Phoenix mismatch wasn't the blowout most expected, just another routine  victory.\n nearly had a triple-double before sitting out the fourth quarter, and the Warriors stormed into the All-Star break on an 11-game winning streak with a 112-104 victory over the free-falling Suns on Wednesday night.\n\"It wasn't our best effort but I told them before the game keep the turnovers down, just be solid and we should be fine,\" Warriors coach Steve Kerr said. \"For the most part, we did a good job of taking care of the ball. Thirteen turnovers is a pretty good number for us. We didn't do much else that well but it was enough.\"\nCurry had 26 points, nine rebounds and nine assists for the defending NBA champions. At 48-4, the Warriors enter the break with the best record through 52 games in NBA history, one win better than the 1995-96 Chicago Bulls and 1966-67 Philadelphia 76ers. Those Bulls finished the season with a league-record 72 wins.\nKerr called his team's record \"shocking.\"\n\"Nobody has ever done it, right?\" he said. \"Fifty-two games in to have only lost four games is remarkable. It speaks to the talent and chemistry of the players. We have a deep roster and they love playing together, they enjoy winning and they are good at it.\"\nKlay Thompson added 24 points for Golden State. He called those 52 games \"kind of a blur.\"\n\"It has gone by really fast,\" he said. \"Winning obviously helps that but we couldn't have asked for a better pre-All-Star break performance. We still have some room for improvement, believe it or not, but it is really surreal to be 48-4.\"\nCurry called the 48-4 record \"pretty satisfying.\"\n\"We handled a lot of different challenges pretty well this first half of the season,\" he said.\nArchie Goodwin scored 20 points and Markieff Morris 19 for the Suns, who have lost nine straight and 24 of 26. Rookie guard Devin Booker added 15 points and a career-best 10 assists.\nGoodwin and Morris emerged the team's leading scorers after scuffling on the bench during a first-quarter timeout.\n\"That's part of being a big brother, being a leader,\" Morris said. \"Sometimes little brothers and big brothers get into it. That's what happened -- wrong place, wrong time.\"\nGolden State was up by as many as 22 points in the second and third quarters, but the Suns cut it to 11 late in the third and 10 a couple of times in the fourth. The only time Phoenix got within single digits in the second half was on Goodwin's breakaway dunk just before the final buzzer.\nPhoenix stayed with the Warriors shot for shot for a little while and was down only 29-28 after one quarter.\nBut the Warriors took off with a 16-0 second-quarter run. Curry sank a 28-foot 3-pointer, followed immediately by a 29-footer, and Green made a pair of free throws to put Golden State up 53-35 with 2:15 left in the half. The Warriors led 57-43 at the break.\n\n during an early timeout. Television replays showed it started with Morris vehemently saying something to Goodwin. He appeared to slap Morris' hand away, then a lot of shoving ensued. Goodwin came out of the game for the remainder of the first quarter.\n\"I wouldn't say it was a fight,\" Phoenix interim coach Earl Watson said. \"I would say it's a pushing match. I've never seen an NBA player really fight. They push and then run behind referees.\"\nWatson said Morris and Goodwin roomed together earlier this season.\n\"We're family,\" Goodwin said. \"It happens. I love him like a brother, he loves me.\"\nMorris called Goodwin \"my little brother.\"\n\"I've been with him for three years and I know him really well,\" Morris said. \"I know his family. We're really close. It happens sometimes.\"\n\n Curry sank a 3-pointer for the 123rd consecutive game, four shy of Kyle Korver's NBA record. ... Curry has seven career triple-doubles, two this season. ... Golden State comes out of the All-Star break with six straight road games. ... The Warriors have won six straight in the series.\n Phoenix is 0-5 under Watson, all of them at home. ... Mirza Teletovic filled Booker's car with Styrofoam packing peanuts on Tuesday while the rookie was inside the arena practicing for this weekend's NBA 3-point contest.\n\n At Portland on Feb. 19.\n Host Houston on Feb. 19."},
{"url": "http://www.foxsports.com/nba/story/wizards-bucks-preview-021016", "text": "\n The first half has gone nothing like the  or  hoped, but the Bucks think they may have found a lineup wrinkle that could help them make a second-half push.\n It's no secret who the Wizards are hoping will carry them to the playoffs.\n Washington looks to ride one of the best stretches of John Wall's career into the All-Star break Thursday night in Milwaukee, while the Bucks are thinking a boost to their bench could help them avoid a season sweep from the Wizards.\n Playoff teams a year ago, both Washington (23-27) and Milwaukee (21-32) will head into the break outside the top eight in the Eastern Conference.\n There seems to be more room for optimism that the Wizards can crawl back into contention thanks to Wall, who will go into his third straight All-Star appearance playing as well as any point guard in the league. Wall has averaged 27.5 points and 11.8 assists in his last four games after putting up 28 and 17 in Tuesday's 111-108 win at New York.\n ''I think I'm having a career year,'' Wall said. ''I can say I'm playing my best basketball, but not the way I want to play because it's not equaling up to wins.''\n If Wall can keep up his newfound shooting touch, it might. A 30.5 percent 3-point shooter heading into this season, Wall is at 41.9 percent over his last 18 games and has hit 11 of 17 over this dominant four-game spurt.\n \"When I'm making jump shots I'm a different player,\" Wall said. \"And when we're making 3s it opens up the floor for me even more to be more aggressive.\n \"I'm taking more respectable (3s). Not the desperation, late-shot-clock ones. I'm getting ones in a rhythm where I want the ball and I'm able to make shots now.\"\n Doing damage from beyond the arc has been a big reason why the Wizards have taken the first three meetings from Milwaukee, though Wall - averaging 19 points and nine assists while totaling 16 turnovers - hasn't stood out statistically.\n Washington has shot 51.4 percent from long range in the series, hitting 12 3s in each game to the Bucks' 18 total, and it's attempted 109 free throws to Milwaukee's 86.\n The Wizards have scored 79 points off 62 Bucks turnovers, totaling 64 fast-break points to Milwaukee's 29. Add in Washington's plus-33 margin in the fourth quarter - it's plus-6 in the other three - and it's easy to see why the Wizards are going for their first season sweep of the Bucks since 1974-75.\n Fourth-quarter issues are nothing new for Milwaukee, which was outscored in the final 12 minutes in each of its five straight losses heading into Tuesday's visit from Boston. The Celtics nearly came from 19 down in the fourth, but the Bucks held on to win 112-111.\n Aside from that collapse, there was reason for optimism. Miles Plumlee and O.J. Mayo shifted into the starting lineup in place of Greg Monroe and Michael Carter-Williams, and while the two new starters totaled just six points, Monroe and Carter-Williams combined for 45.\n \"I think we just wanted to see something different,\" coach Jason Kidd said. \"Sometimes we get caught up in starters or bench players, but at the end of the day it's about the team.\"\n The Bucks are 14-8 at home, and the good news is they'll play 19 of their final 29 at the Bradley Center after playing an NBA-high 31 road games.\n The Wizards have played the league's fewest on the road, though they're better away from the Verizon Center (12-11) than at home."},
{"url": "http://www.foxsports.com/southwest/story/kawhi-leonard-s-last-second-shot-gives-spurs-win-over-magic-021016", "text": "\nORLANDO, Fla. (AP) -- The  can do no wrong this season and the  can't seem to do much right.\nThe Spurs rallied from a 14-point fourth quarter deficit to beat Orlando 98-96 on  jumper from the top of the key with 0.9 left to play Wednesday night.\nLeonard led the San Antonio with 29 points. LaMarcus Aldridge had 21 points and Patty Mills added 17 points and seven assists for the Spurs, who won their fourth straight game.\n\"We always pride ourselves on playing the whole 48 minutes of the game,\" Leonard said. \"We just kept pounding and fortunately everything broke for us.\"\nIncluding the last 0.9 seconds.\nThat was enough time for Magic guard Elfrid Payton to run down a length-of-the-floor pass and miss an uncontested reverse layup as the buzzer sounded. The miss ended the Magic's two-game win streak and sent Orlando to the All-Star break with just four wins in their last 19 games.\n\"We got lucky,\" San Antonio coach Gregg Popovich said. \"There was a pick down there and we didn't react very well.\"\nEvan Fournier, whose 3-pointer tied the game with 13.3 seconds left, led Orlando with 28 points. Nikola Vucevic had 20 points and 13 rebounds, Victor Oladipo scored 14. Payton had 13 points and seven assists.\n\"In key moments, we struggle to make a game-ending play or combination of plays,\" Magic coach Scott Skiles said. \"We could feel the Spurs picking it up (in the fourth quarter) and we didn't react well. We started throwing them the ball and became casual.\"\nPayton took the blame.\n\"I've got to make that shot,\" he said. \"I tried to let the ball bounce, but it slipped out of my hands. Still, I make that shot all the time and at the end of the day, I've got to make it.\"\nThe Spurs were down 81-67 early in the fourth quarter when the Magic began a familiar fourth quarter fade to the finish. That coincided with Leonard, Mills and Danny Green getting serious at the offensive end.\nThe Spurs trio split the team's first 21 points of the period evenly, cutting the deficit to 91-88 when Mills converted a layup while falling to the floor with 4:30 to play.\nAldridge, who was passive most of the night, stepped up and scored the next six points for San Antonio, including an 18-foot fadeaway jumper with 1:10 left in the game that gave the Spurs a 94-93 lead. Leonard added two free throws to up the lead to 96-93 going into the final minute.\nSan Antonio blocked two shots and forced two turnovers in the final minute, but Fournier got free in the corner and made a 3-pointer with 13.3 seconds to tie the game at 96.\nAfter a Spurs timeout, Leonard dribbled the clock down to the final second, rose up over Magic defender Aaron Gordon and buried the game winner.\n\"It was one of those games where things weren't going well and we just had to grind it out,\" Mills said. \"We didn't have a lot of energy, but the ending was a great example of the confidence and belief we have in Kawhi.\"\nTIP-INS:\nSpurs: San Antonio started the game 1-for-9 from the field, then hit 11 of its last 12 shots in the first period. ... Tim Duncan (sore knee) returned to the starting lineup after missing eight games with a sore knee. He played only 18 minutes, none in the fourth quarter. ... Tony Parker and Manu Ginobili did not play. ... The Spurs win percentage, 84.9 (45-8) is the best in franchise history going into the All-Star break.\nMagic: SF Tobias Harris (ankle) missed his third straight game. ... Reserve C Jason Smith sat out the game with a bad back. ... Orlando is just 15-40 (27.2 percent) against San Antonio. ... Aaron Gordon had 14 rebounds, but scored only four points. ... Dewayne Dedmon had nine rebounds in 10 minutes.\nUP NEXT:\nSpurs: At Los Angeles Clippers, Thursday Feb. 18\nMagic: Host Dallas Friday, Feb. 19"},
{"url": "http://www.foxsports.com/wisconsin/story/nba-milwaukee-bucks-vs-washingtion-wizards-021116", "text": "\nThe first half has gone nothing like the  or  hoped, but the Bucks think they may have found a lineup wrinkle that could help them make a second-half push.\nIt's no secret who the Wizards are hoping will carry them to the playoffs.\nWashington looks to ride one of the best stretches of John Wall's career into the All-Star break Thursday night in Milwaukee, while the Bucks are thinking a boost to their bench could help them avoid a season sweep from the Wizards.\nPlayoff teams a year ago, both Washington (23-27) and Milwaukee (21-32) will head into the break outside the top eight in the Eastern Conference.\nThere seems to be more room for optimism that the Wizards can crawl back into contention thanks to Wall, who will go into his third straight All-Star appearance playing as well as any point guard in the league. Wall has averaged 27.5 points and 11.8 assists in his last four games after putting up 28 and 17 in Tuesday's 111-108 win at New York.\n\"I think I'm having a career year,\" Wall said. \"I can say I'm playing my best basketball, but not the way I want to play because it's not equaling up to wins.\"\nIf Wall can keep up his newfound shooting touch, it might. A 30.5 percent 3-point shooter heading into this season, Wall is at 41.9 percent over his last 18 games and has hit 11 of 17 over this dominant four-game spurt.\n\"When I'm making jump shots I'm a different player,\" Wall said. \"And when we're making 3s it opens up the floor for me even more to be more aggressive.\n\"I'm taking more respectable (3s). Not the desperation, late-shot-clock ones. I'm getting ones in a rhythm where I want the ball and I'm able to make shots now.\"\nDoing damage from beyond the arc has been a big reason why the Wizards have taken the first three meetings from Milwaukee, though Wall - averaging 19 points and nine assists while totaling 16 turnovers - hasn't stood out statistically.\nWashington has shot 51.4 percent from long range in the series, hitting 12 3s in each game to the Bucks' 18 total, and it's attempted 109 free throws to Milwaukee's 86.\nThe Wizards have scored 79 points off 62 Bucks turnovers, totaling 64 fast-break points to Milwaukee's 29. Add in Washington's plus-33 margin in the fourth quarter - it's plus-6 in the other three - and it's easy to see why the Wizards are going for their first season sweep of the Bucks since 1974-75.\nFourth-quarter issues are nothing new for Milwaukee, which was outscored in the final 12 minutes in each of its five straight losses heading into Tuesday's visit from Boston. The Celtics nearly came from 19 down in the fourth, but the Bucks held on to win 112-111.\nAside from that collapse, there was reason for optimism. Miles Plumlee and O.J. Mayo shifted into the starting lineup in place of Greg Monroe and Michael Carter-Williams, and while the two new starters totaled just six points, Monroe and Carter-Williams combined for 45.\n\"I think we just wanted to see something different,\" coach Jason Kidd said. \"Sometimes we get caught up in starters or bench players, but at the end of the day it's about the team.\"\nThe Bucks are 14-8 at home, and the good news is they'll play 19 of their final 29 at the Bradley Center after playing an NBA-high 31 road games.\nThe Wizards have played the league's fewest on the road, though they're better away from the Verizon Center (12-11) than at home."},
{"url": "http://www.foxsports.com/nba/story/cleveland-cavs-kevin-love-reinjures-shoulder-vs-la-lakers-021016", "text": "\n—  forward  has re-injured his surgically repaired left shoulder.\nLove, whose shoulder was dislocated in last year's playoffs, left the floor in the final minute of the first half of Wednesday night's game against the Los Angeles Lakers. Love turned toward Cleveland's bench and said ''it's my shoulder'' before heading straight to the locker room for treatment. Love's left arm hung limply to his side as he exited.\nAfter the game, the  said Love had suffered \"a left shoulder contusion.\"\nLove also told reporters he does not expect to miss any time.\n\"At the time I really didn't know what it was,\" Love said. \"It's like when you get hit in the funny bone in your elbow, it's just shooting pain. It felt like fire was running down my arm. It's just a stinger.\"\nThe loss of Love in last year's first round derailed Cleveland's NBA title hopes. Still, the club signed him to a maximum contract this summer.\nLove came in averaging 15.8 points and 10.5 rebounds per game."},
{"url": "http://www.foxsports.com/nba/story/spurs-beat-magic-kawhi-leonard-game-winning-shot-nearly-blow-it-elfrid-payton-misses-layup-at-buzzer-021016", "text": "\n\nThe  can do no wrong this season and the  can't seem to do much right.\nThe Spurs rallied from a 14-point fourth quarter deficit to beat Orlando 98-96 on Kawhi Leonard's jumper from the top of the key with 0.9 left to play Wednesday night.\nLeonard led the San Antonio with 29 points. LaMarcus Aldridge had 21 points and Patty Mills added 17 points and seven assists for the Spurs, who won their fourth straight game.\n\"We always pride ourselves on playing the whole 48 minutes of the game,\" Leonard said. \"We just kept pounding and fortunately everything broke for us.\"\nIncluding the last 0.9 seconds.\nThat was enough time for Magic guard  to run down a length-of-the-floor pass and miss an uncontested reverse layup as the buzzer sounded. The miss ended the Magic's two-game win streak and sent Orlando to the All-Star break with just four wins in their last 19 games.\n\"We got lucky,\" San Antonio coach Gregg Popovich said. \"There was a pick down there and we didn't react very well.\"\nEvan Fournier, whose 3-pointer tied the game with 13.3 seconds left, led Orlando with 28 points. Nikola Vucevic had 20 points and 13 rebounds, Victor Oladipo scored 14. Payton had 13 points and seven assists.\n\"In key moments, we struggle to make a game-ending play or combination of plays,\" Magic coach Scott Skiles said. \"We could feel the Spurs picking it up (in the fourth quarter) and we didn't react well. We started throwing them the ball and became casual.\"\nPayton took the blame.\n\"I've got to make that shot,\" he said. \"I tried to let the ball bounce, but it slipped out of my hands. Still, I make that shot all the time and at the end of the day, I've got to make it.\"\nThe Spurs were down 81-67 early in the fourth quarter when the Magic began a familiar fourth quarter fade to the finish. That coincided with Leonard, Mills and Danny Green getting serious at the offensive end.\nThe Spurs trio split the team's first 21 points of the period evenly, cutting the deficit to 91-88 when Mills converted a layup while falling to the floor with 4:30 to play.\nAldridge, who was passive most of the night, stepped up and scored the next six points for San Antonio, including an 18-foot fadeaway jumper with 1:10 left in the game that gave the Spurs a 94-93 lead. Leonard added two free throws to up the lead to 96-93 going into the final minute.\nSan Antonio blocked two shots and forced two turnovers in the final minute, but Fournier got free in the corner and made a 3-pointer with 13.3 seconds to tie the game at 96.\nAfter a Spurs timeout, Leonard dribbled the clock down to the final second, rose up over Magic defender Aaron Gordon and buried the game winner.\n\"It was one of those games where things weren't going well and we just had to grind it out,\" Mills said. \"We didn't have a lot of energy, but the ending was a great example of the confidence and belief we have in Kawhi.\"\n\n San Antonio started the game 1-for-9 from the field, then hit 11 of its last 12 shots in the first period. ... Tim Duncan (sore knee) returned to the starting lineup after missing eight games with a sore knee. He played only 18 minutes, none in the fourth quarter. ... Tony Parker and Manu Ginobili did not play. ... The Spurs win percentage, 84.9 (45-8) is the best in franchise history going into the All-Star break.\n SF Tobias Harris (ankle) missed his third straight game. ... Reserve C Jason Smith sat out the game with a bad back. ... Orlando is just 15-40 (27.2 percent) against San Antonio. ... Aaron Gordon had 14 rebounds, but scored only four points. ... Dewayne Dedmon had nine rebounds in 10 minutes.\n\n At Los Angeles Clippers, Thursday Feb. 18\n Host Dallas Friday, Feb. 19"},
{"url": "http://www.foxsports.com/florida/story/san-antonio-spurs-98-orlando-magic-96-021016", "text": "\n -- The  can do no wrong this season and the  can't seem to do much right.\nThe Spurs rallied from a 14-point fourth quarter deficit to beat Orlando 98-96 on Kawhi Leonard's jumper from the top of the key with 0.9 left to play Wednesday night.\nLeonard led the San Antonio with 29 points. LaMarcus Aldridge had 21 points and Patty Mills added 17 points and seven assists for the Spurs, who won their fourth straight game.\n\"We always pride ourselves on playing the whole 48 minutes of the game,\" Leonard said. \"We just kept pounding and fortunately everything broke for us.\"\nIncluding the last 0.9 seconds.\nThat was enough time for Magic guard Elfrid Payton to run down a length-of-the-floor pass and miss an uncontested reverse layup as the buzzer sounded. The miss ended the Magic's two-game win streak and sent Orlando to the All-Star break with just four wins in their last 19 games.\n\"We got lucky,\" San Antonio coach Gregg Popovich said. \"There was a pick down there and we didn't react very well.\"\nEvan Fournier, whose 3-pointer tied the game with 13.3 seconds left, led Orlando with 28 points. Nikola Vucevic had 20 points and 13 rebounds, Victor Oladipo scored 14. Payton had 13 points and seven assists.\n\"In key moments, we struggle to make a game-ending play or combination of plays,\" Magic coach Scott Skiles said. \"We could feel the Spurs picking it up (in the fourth quarter) and we didn't react well. We started throwing them the ball and became casual.\"\nPayton took the blame.\n\"I've got to make that shot,\" he said. \"I tried to let the ball bounce, but it slipped out of my hands. Still, I make that shot all the time and at the end of the day, I've got to make it.\"\nThe Spurs were down 81-67 early in the fourth quarter when the Magic began a familiar fourth quarter fade to the finish. That coincided with Leonard, Mills and Danny Green getting serious at the offensive end.\nThe Spurs trio split the team's first 21 points of the period evenly, cutting the deficit to 91-88 when Mills converted a layup while falling to the floor with 4:30 to play.\nAldridge, who was passive most of the night, stepped up and scored the next six points for San Antonio, including an 18-foot fadeaway jumper with 1:10 left in the game that gave the Spurs a 94-93 lead. Leonard added two free throws to up the lead to 96-93 going into the final minute.\nSan Antonio blocked two shots and forced two turnovers in the final minute, but Fournier got free in the corner and made a 3-pointer with 13.3 seconds to tie the game at 96.\nAfter a Spurs timeout, Leonard dribbled the clock down to the final second, rose up over Magic defender Aaron Gordon and buried the game winner.\n\"It was one of those games where things weren't going well and we just had to grind it out,\" Mills said. \"We didn't have a lot of energy, but the ending was a great example of the confidence and belief we have in Kawhi.\"\n\nSpurs: San Antonio started the game 1-for-9 from the field, then hit 11 of its last 12 shots in the first period. ... Tim Duncan (sore knee) returned to the starting lineup after missing eight games with a sore knee. He played only 18 minutes, none in the fourth quarter. ... Tony Parker and Manu Ginobili did not play. ... The Spurs win percentage, 84.9 (45-8) is the best in franchise history going into the All-Star break.\nMagic: SF Tobias Harris (ankle) missed his third straight game. ... Reserve C Jason Smith sat out the game with a bad back. ... Orlando is just 15-40 (27.2 percent) against San Antonio. ... Aaron Gordon had 14 rebounds, but scored only four points. ... Dewayne Dedmon had nine rebounds in 10 minutes.\n "},
{"url": "http://www.foxsports.com/nba/story/davis-pelicans-snap-jazz-s-7-game-win-streak-100-96-021016", "text": "\n NEW ORLEANS (AP) Anthony Davis capped a 19-point night with a running left-handed hook and 3-pointer in the final minute, and the New Orleans Pelicans beat Utah 100-96 on Wednesday night to snap the 's seven-game winning streak.\n Jrue Holiday scored 21 points for the Pelicans, who won their second straight. Davis scored all but three of his points in the second half. His running hook from about 5 feet out gave New Orleans a 94-92 lead with 59 seconds remaining. His 3 made it 97-93 with 35 seconds left.\n Derrick Favors scored 29 and Gordon Hayward, 21 for Utah, but each missed a free throw in the final minute.\n Rodney Hood added 15 for Utah, but the Jazz turned the ball over 17 times and missed 14 of 21 shots from 3-point range."},
{"url": "http://www.foxsports.com/nba/story/timberwolves-come-back-from-18-down-to-stun-raptors-117-112-021016", "text": "\n MINNEAPOLIS (AP) Karl-Anthony Towns had 35 points and 11 rebounds, and the  came back from 18 points down to stun the Toronto Raptors 117-112 on Wednesday night.\n Canadian star Andrew Wiggins scored 13 of his 26 points in the fourth quarter, including a jumper with under 2 minutes to go that gave Minnesota a 112-109 lead. Ricky Rubio had 19 points, eight assists and eight rebounds to outplay All-Star Kyle Lowry, and the Wolves used a huge advantage at the free throw line to close out a team that had won 14 of 15 games.\n DeMar DeRozan scored 35 points for the Raptors, who head home to host All-Star Weekend beginning on Friday night. But Lowry was held to 14 points and seven assists while battling foul trouble, and the combination of Wiggins and Towns was too much down the stretch."},
{"url": "http://www.foxsports.com/nba/story/celtics-rally-late-overtake-clippers-in-overtime-139-134-021016", "text": "\n BOSTON (AP) Isaiah Thomas had 36 points and 11 assists, including a fade away jumper that sent the game to an extra period, to help the  overtake the  139-134 in overtime on Wednesday night.\n Jared Sullinger added 21 points and 11 rebounds. Jae Crowder finished with 19 points, and Avery Bradley added 18 points as the Celtics won their eighth straight at home.\n Boston played the second half without big man Kelly Olynyk. He left late in the first half with a bruised right shoulder.\n The Clippers led by five late in regulation, but went without a field goal for more than three minutes.\n Chris Paul led the Clippers with 35 points and 13 assists. J.J. Redick added 27 points and DeAndre Jordan finished with 21 points and 16 rebounds."},
{"url": "http://www.foxsports.com/nba/story/grizzlies-rout-nets-in-1st-game-since-gasol-s-broken-foot-021016", "text": "\n NEW YORK (AP) Mike Conley scored 20 points, Jeff Green had 12 of his 18 in the third quarter, and the  beat the  109-90 on Wednesday night in their first game since losing  to a broken right foot.\n The Grizzlies unleashed a strong perimeter attack in the absence of their franchise center, making seven 3-pointers in a 39-point third quarter that blew open the game.\n Zach Randolph finished with 15 points for the Grizzlies, who were coming off consecutive losses, both in overtime. Gasol was hurt in the first quarter against Portland on Monday and Memphis learned the extent of his injury Tuesday.\n The Nets' Joe Johnson was scoreless, ending the NBA's longest active streak with at least one field goal."},
{"url": "http://www.foxsports.com/nba/story/cousins-collison-lead-kings-past-76ers-021016", "text": "\n PHILADELPHIA (AP) DeMarcus Cousins had 28 points and 12 rebounds, and Darren Collison scored 21 of his 25 points after halftime to lead the  to a 114-110 comeback victory over the  on Wednesday night.\n Rajon Rondo added 14 points, eight rebounds and 15 assists for the Kings, who snapped a four-game losing streak overall and six-game skid on the road while winning for just the second time in their last 10. It also allowed Sacramento to enter the break on a positive note following a tumultuous week that included rumors of the impending dismissal of coach George Karl.\n Rookie Jahlil Okafor tied his career high with 26 points to go with 10 rebounds, and Robert Covington scored a career-high 29 points for the 76ers, who played without top big man Nerlens Noel."},
{"url": "http://www.foxsports.com/arizona/story/suns-markieff-morris-archie-goodwin-get-into-fight-on-bench-021016", "text": "\n  teammates  and  got into a screaming and shoving match on the bench during the first quarter of Wednesday's game against the Golden State Warriors.\nThe fight appeared to start over an on-court disagreement, which Morris was attempting to explain during a timeout. But it escalated to shoving and then cameras caught Morris' hand around Goodwin's throat before the two were separated.\nGoodwin was removed from the game following the timeout but returned to start the second quarter.\nAfter the game, reporter Gerald Bourguet posted to Twitter Morris' comments on the incident.\n\"We're family,\" Goodwin said. \"It happens. I love him like a brother, he loves me.\"\nSuns interim coach Earl Watson downplayed the incident after the game, though he said he hadn't seen video of the whole encounter.\n\"I wouldn't say it was a fight,\" Watson said. \"I would say it's a pushing match. I've never seen an NBA player really fight. They push and then run behind referees.\"\n\"They're the closest on the team. They're like big brother, little brother,\" Watson added, noting the two players used to live together. \"... We have to learn how to control our emotions. Other than that, those two are really close.\n\"The team is not split.\" \nGoodwin finished with a team-high 20 points. Morris added 19 points and eight rebounds in Phoenix's 112-104 loss. "},
{"url": "http://www.foxsports.com/nba/story/celtics-rally-late-overtake-clippers-in-overtime-139-134-021116", "text": "\n BOSTON (AP) The way the  are scoring right now, they may want to try bottling a little of it before they leave for the All-Star break.\n Whatever it is, it has the Celtics looking like a probable playoff team heading into the second half of the season.\n Isaiah Thomas had 36 points and 11 assists, including a fade away jumper that sent the game to an extra period, to help the Boston Celtics overtake the  139-134 in overtime on Wednesday night.\n Jared Sullinger added 21 points and 11 rebounds. Jae Crowder finished with 19 points, and Avery Bradley added 18 points as the Celtics won their eighth straight at home. Boston trailed by five with just over a minute left in regulation before rallying to force the extra frame. Boston is averaging 115 points during its current win streak at the Garden.\n ''We play together and we make adjustments on the fly and I think that's big,'' Sullinger said. ''It's not just from (coach) Brad (Stevens), it's not from Isaiah or ET (Evan Turner) or Jae Crowder or Avery. It's from everybody. Everybody makes adjustments and is willing to listen.''\n Though possible shakeups to the roster before the trade deadline are possible for this young team, Crowder said no one wants to see any tinkering.\n ''Guys in the locker room we are sticking together, we're fighting. We stick up for one another,'' Crowder said. ''Everyone gets along and it's a great energy in the locker room.''\n Boston played the second half without big man Kelly Olynyk after he left late in the first half with a bruised right shoulder. But the Celtics found a way to make up for the lack of his presence inside.\n Chris Paul led the Clippers with 35 points and 13 assists. J.J. Redick added 27 points and DeAndre Jordan finished with 21 points and 16 rebounds.\n The loss spoiled what may be Clippers' forward Paul Pierce's final game in the Boston Garden. The 38-year-old played 15 seasons with the Celtics and was facing his former team for the eighth time.\n The Clippers led by five late in regulation, but were held without a field goal for more than three minutes.\n ''I think we try to pride ourselves on our defense - so we didn't defend. That's probably why we lost,'' Paul said.\n TIP-INS\n Clippers: The Clippers did not have a field goal for the final 3:29 of regulation. ... Paul had 10 points and five assists in the first quarter. It was the 37th time in his career he's had at least 10 points and five assists in a quarter. That's the most in NBA since 2005-06.\n Celtics: Improved to 10-3 in the second game of back-to-backs.\n TRAGIC NEWS: Clippers coach Doc Rivers was informed by a member of the Clippers organization immediately after the game about the death of Ingrid Williams, wife of Oklahoma City assistant Monty Williams. The 44-year-old died Wednesday night from injuries sustained in a car crash on Tuesday. Rivers has known both side before they married, and the friendship expanded when Monty coached his son and current Clippers' guard Austin Rivers after he was drafted by the New Orleans Pelicans. ''I'm heartbroken,'' said a teary-eyed Rivers. ''Sometimes it doesn't seem fair. There's no better human being in the world than Monte and Ingrid. Sometimes you question everything, and this is one of those times.''\n SALUTING PIERCE: For all the late-game plays by the Celtics, the pregame spotlight belonged to Pierce. In his eighth game against his former team, the 38-year-old received the starting nod in what could possibly be final game in the Garden against his former team. The moment resulted in a huge ovation by the Boston fans when his name was announced. Pierce, who spent 15 seasons in Boston and won a championship in 2008, acknowledged them, raising his right hand before his teammates started playfully pounding on him.\n QUOTABLE: ''I think the NBA had a lot of say so in it, and so did we. And that's the way it should work. I thought it was really well done in that light. They have more people that can investigate things than us because they do it all the time. I just thought as far as that went I thought it was really well handled by both sides.'' - Rivers on the team and NBA collaborating to decide on a suspension for Blake Griffin.\n CELEBRITY WATCH: Boxing legend ''Marvelous'' Marvin Hagler sat courtside.\n UP NEXT\n Los Angeles hosts San Antonio on Feb. 18.\n Boston travels to Utah on Feb. 19.\n ---\n Follow Kyle Hightower on Twitter at http://www/twitter.com/khightower"},
{"url": "http://www.foxsports.com/nba/story/davis-pelicans-snap-jazz-s-7-game-win-streak-100-96-021116", "text": "\n NEW ORLEANS (AP) Anthony Davis wasn't about to leave the court with any regrets.\n Davis had missed eight of his first 13 shots, but the score was tied as New Orleans' game against Utah entered the final minute, and the ' front-court star didn't hesitate to assert himself.\n ''I feel like as a leader of the team that's my responsibility,'' Davis said. ''At some point in time, you've got to take over a game.''\n Davis capped a 19-point night with a running left-handed hook and 3-pointer in the final minute, and New Orleans beat Utah 100-96 on Wednesday night to snap the Jazz's seven-game winning streak.\n ''I just shot the ball with confidence and tried to play hard, knowing that all the shots I took were good shots,'' Davis said.\n Jrue Holiday scored 21 points for the Pelicans, who won their second straight. Davis scored all but three of his points in the second half. His running hook from about 5 feet out gave New Orleans a 94-92 lead with 59 seconds remaining. His 3 made it 97-93 with 35 seconds left.\n Derrick Favors scored 29 and Gordon Hayward 21 for Utah, but each missed a free throw in the final minute.\n Rodney Hood added 15 for Utah, but the Jazz turned the ball over 17 times and missed 14 of 21 shots from 3-point range in Utah's final game before the All-Star break.\n ''Tough night for us, but overall we're playing good basketball and we've got a lot of confidence going into the break, Hayward said. ''They were physical down the stretch. We couldn't get the stops when we needed them tonight and (there were) too many turnovers also in the second half for us. We still battled and just came up a little short.''\n Norris Cole had 11 points for New Orleans, including a pair of free throws with 22 seconds left to give New Orleans a five-point lead.\n GRIEVING \n Shortly before tipoff, the Pelicans learned of the death of Ingrid Williams, the wife of former Pelicans head coach Monty Williams, who was fired after last season despite leading the club to the playoffs. Ingrid Williams died in a car crash in Oklahoma City, where the family relocated when Monty Williams was hired as a top Thunder assistant.\n Jrue Holiday, who played two seasons for Williams, said the news appeared to undermine the Pelicans' focus early in the game.\n ''The players that were here with Monty and their family definitely felt it,'' Holiday said. ''Obviously we're all blessed to play the game of basketball but family comes before that. And I know most of the guys were thinking about our families, thinking about his family.''\n Pelicans coach Alvin Gentry said the team said a prayer for Williams' family in the locker room before the game and the arena's public address announcer asked for a moment of silence before tip-off.\n Davis, who became close to Williams during his first three NBA seasons - and also during the Olympics and the FIBA World Cup, with Williams serving as a Team USA assistant - made it known through team spokesmen that he would ''respectfully'' decline to comment on Ingrid Williams' death.\n However, he said in a tweet: ''Completely devastated. Ingrid Williams was like a 2nd mother to me when I got to NOLA. My thoughts & prayers are with Monty & the family.''\n EMPTYING THE TANK\n Despite coming off an overtime victory in Dallas a night earlier, Utah led much of the game and did not appear tired until the final minutes.\n The Jazz made 12 of 15 shots in the third quarter, turning a two-point halftime deficit to a lead as large as seven after consecutive driving dunks by Hayward and Trevor Booker.\n Rudy Gobert had nine of his 12 points in the third quarter, and Utah took a 77-71 lead into the final period. Utah briefly bumped its lead up to 79-71 on Hayward's short jumper before the Pelicans responded with an 8-0 run to tie it.\n Holiday and Alexis Ajinca each scored four points during the game-tying surge, which set up an tense, back-and fourth final eight minutes during which neither team led by more than two until the final minute.\n ''Obviously (Tuesday) night took something out of us,'' Jazz coach Quinn Snyder said.\n TIP-INS\n Jazz: Utah also saw a road winning streak end after three games. ... Hood did not score at least 23 points for the first time in four games.\n Pelicans: Guard Tyreke Evans missed his eighth straight game with a right knee injury that was initially diagnosed as tendinitis but now might require surgery. Pelicans coach Alvin Gentry said Evans is seeking a second opinion. ''There is a possibility that it's something that could keep him out the rest of the season,'' Gentry said earlier Wednesday. ''We won't know that until the opinions are gathered and the information is processed.''\n UP NEXT\n Jazz: Visits Washington on Feb. 18.\n Pelicans: Visits Oklahoma City on Thursday night."},
{"url": "http://www.foxsports.com/nba/story/cavaliers-beat-lakers-kobe-bryant-last-game-in-cleveland-lebron-james-kevin-love-injured-shoulder-021016", "text": "\n\nWith 20,000 fans roaring, Kobe Bryant and LeBron James hugged and seemed to be in a world of their own.\nOne on one.\n\"It was just a lot of mutual respect,\" James said of the embrace. \"Sometimes what is known doesn't need to be said.\"\nThe two superstars shared the same floor in Cleveland for the final time on Wednesday night as the Cavaliers, despite playing the second half without Kevin Love, downed the  120-111 in their last game before the All-Star break.\nKyrie Irving scored a season-high 35 points and James added 29 for the , who feared Love had re-injured his surgically repaired left shoulder in the first half. However, following the game Love said he only has a \"stinger\" and doesn't expect to miss any time.\nBryant finished with 17 points in his last performance in Cleveland, where many fans cheered his every move and fans serenaded him with \"Ko-be\" chants throughout the night.\nFor James, there has been no player of his era quite like Bryant.\n\"His competitive nature,\" James said when asked what he admires most about Bryant. \"A lot of guys might be bigger, taller or jump higher, but it's something that's in you that gets you to that level.\"\nLou Williams scored 28 to lead the Lakers, who have dropped 13 of 15.\nThe Cavs caught a major scare late in the second quarter when Love quickly left the floor after getting his arm caught under Bryant's while working in the post.\n\"At the time I really didn't know what it was,\" Love said. \"It's like when you get hit in the funny bone in your elbow, it's just shooting pain. It felt like fire was running down my arm. It's just a stinger.\"\nIt's the same shoulder Love had dislocated in the first round of last season's playoffs when Boston center Kelly Olynyk yanked it from the socket while battling for a loose ball. Losing Love disrupted the Cavs' title chase and for a moment Wednesday night, it appeared Cleveland would be without him again.\nCleveland carried a 19-point lead into the fourth quarter, but struggled to put away the lowly Lakers.\nBryant converted a 4-point play and made three free throws to get Los Angeles within 108-100, but J.R. Smith and James made 3-pointers in the final three minutes.\nThe Cavs tastefully saluted Bryant during pregame introductions with a video presentation of some of his best moments. Bryant watched the tribute on the arena's gigantic scoreboard before hearing his name and taking the floor with his teammates. He patted his chest in appreciation as Cleveland's crowd -- dotted with fans wearing Bryant's purple-and-gold No. 24 jersey -- chanted his name.\n\"It felt great to play here so many years and get that type of reaction,\" Bryant said of the crowd's salute. \"It was really special.\"\nBefore the opening tip, Bryant hugged Cleveland coach Tyronn Lue, who won two NBA titles as his teammate in Los Angeles.\nBryant and James started out guarding each other, a matchup NBA fans never got to witness in the Finals and will only see one more time when the Cavs visit the Lakers on March 10.\nBefore the game, Bryant said he's never viewed James as a rival.\n\"I never looked to see what he was doing,\" Bryant said. \"I just felt like we were a completely different generation. I just missed that thing completely. Not like a Magic-Bird sort of thing. From the time he came into the league it was more helping him, giving him direction, advice.\"\nJames said he's sorry he never developed a rivalry with Bryant.\n\"We never had the matchup that everybody wanted, that we wanted,\" he said.\n\nBryant said there have great moments and some hard ones to handle during his league-wide farewell tour.\n\"That we stink, that's tough,\" he said. \"But being able to say, `thank you' to the fans, it's tough for me to express how I feel. It's hard to put into words how much I appreciate it.\"\n\nLakers rookie D'Angelo Russell got drilled in his groin area by a hard pass thrown by James in the fourth quarter. Russell dropped to the floor and stayed there for several moments before he walked gingerly to the bench, where Bryant was laughing at him.\n\"Once I knew he was OK, the jokes write themselves,\" Bryant said.\n\nBryant will make his 16th All-Star game appearance this weekend, but he could use the extra rest.\n\"I feel horrible, my ankles, knees, everything,\" Bryant said. \"This stretch couldn't come at a better time. My ankles hurt. My knees hurt. I'm looking forward to having a complete week where I do nothing.\"\n\n One of Bryant's roles in his final season is to mentor Russell, the No. 2 overall pick in last year's draft. \"Well, it's like a big brother, or a grandfather,\" Bryant cracked. \"I just talk to him often about the game and the mentality and technique and execution, as well as some of the psychological things that he's going through and how to navigate through those. ... The Lakers have lost eight of nine on the road.\n G Matthew Dellavedova missed his fifth straight game with left hamstring soreness. ... James entered the night trailing Paul Pierce for 15th place on the NBA's career scoring list. ... Because he's played with Bryant and coached James, Lue is as qualified as anyone to compare the two superstars. \"They're both the same,\" he said. \"Kobe is more ready to fight you, he'll cuss you out. LeBron is more by example.\"\n\n Host San Antonio on Feb. 19.\n Host Chicago on Feb. 18."},
{"url": "http://www.foxsports.com/nba/story/timberwolves-come-back-from-18-down-to-stun-raptors-117-112-021116", "text": "\n MINNEAPOLIS (AP) The Toronto Raptors were rolling, beating up on a young Minnesota team when maybe, just maybe, their thoughts drifted to the party that awaits them back home this weekend.\n That's when the  pounced, and a Canadian star and his fellow No. 1 overall draft pick delivered a stunning comeback.\n Karl-Anthony Towns had 35 points and 11 rebounds, and Toronto-born Andrew Wiggins scored 13 of his 26 in the fourth quarter to rally the Timberwolves from 18 points down to a 117-112 victory Wednesday night.\n Ricky Rubio had 19 points, eight assists and eight rebounds to outplay All-Star guard Kyle Lowry, and the Wolves used a huge advantage at the free throw line to close out a team that had won 14 of its last 15 games.\n The Wolves have lost five games this season when leading by at least 17 points. They trailed by 18 in the second quarter and flipped that script.\n ''We got back in the locker room and just talked among ourselves and found out what we needed to do,'' Wiggins said. ''We found out what was working and we kept doing it.''\n Minnesota set season highs with 43 free throws made on 53 attempts on the way to its largest comeback win of the season. The Raptors were whistled for 34 fouls compared to 21 for the Wolves.\n DeMar DeRozan scored 35 points for the Raptors, who head home to host All-Star Weekend beginning on Friday night. But Lowry was held to 14 points and seven assists while battling foul trouble, and the combination of Wiggins and Towns was too much down the stretch.\n ''We're not good enough to come out and throw our press clippings or our record on the court and not perform,'' Toronto coach Dwane Casey said.\n The Raptors appeared to be cruising toward a highly anticipated weekend in Canada when they raced out to an 18-point lead in the second quarter. Then Lowry picked up his fourth foul, Jonas Valanciunas couldn't handle Towns in the paint and the Timberwolves came all the way back to grab the lead early in the fourth quarter.\n ''They're just another team to me,'' Wiggins said when asked if there was something special about beating the team he grew up watching. ''Another team to beat.''\n Casey emphasized before the game the need for a veteran group to hold it together for one more night before the party starts in Toronto. The Raptors were facing a Timberwolves team with the third-worst record in the West that was just blown out by lowly New Orleans in this building two nights prior.\n When the Raptors got up big early, they might have relaxed a little bit and they found themselves in a fight for the final 9 minutes.\n Rubio's third 3-pointer gave the Timberwolves a 104-98 lead with 5:24 to play.\n The Raptors fought back to tie the game with under 3 minutes to play, but Wiggins hit big shot after big shot a day before heading back to his hometown to play in the Rising Stars Challenge on Friday night.\n ''We'll see them again,'' Lowry said.\n LANDMARK WIN\n The Timberwolves improved to 17-37, one more win than they had last season.\n ''We're going in the right direction,'' Wiggins said. ''We have the right pieces. We have all the talent. Now we just need to put everything together.''\n TOWNS SHINES\n Towns joined Shaquille O'Neal, Kevin Durant, Carmelo Anthony, LeBron James and Chris Webber as the only players in their 19- or 20-year-old seasons to have at least 35 points, 10 rebounds and three blocks in a game. When asked if he surprises himself with his production, Towns quipped, ''I do surprise myself sometimes. Missing two free throws, missing open jump shots.''\n TIP-INS\n Raptors: Their 68 points were their most in a first half this season. ... Bismack Biyombo left in the second quarter after a nasty spill under the basket but was able to return in the second half. ... The Raptors made 10 of 31 3-pointers to just 4 of 14 for Minnesota.\n Timberwolves: F Tayshaun Prince missed the game to attend former teammate Chauncey Billups' jersey retirement ceremony in Detroit. Zach LaVine started in Prince's place and finished with 13 points. ... Gorgui Dieng had 14 points and 10 rebounds, and all five Timberwolves starters finished in double figures. ... The Wolves again played without Kevin Garnett (leg), Nikola Pekovic (ankle) and Kevin Martin (wrist).\n UP NEXT\n Raptors: Visit Chicago on Feb. 19.\n Timberwolves: Visit Memphis on Feb. 19."},
{"url": "http://www.foxsports.com/nba/story/houston-rockets-jason-terry-chemistry-horrible-bad-words-021116", "text": "\nIf you gave  a dime for every time the general public could think the  had turned their season around, he'd have...at least 50 cents. Houston, who started off poorly, had seemed to have hit its stride of late. And it went into Wednesday night's game against the Trail Blazers a half a game up on Portland for the No. 8 seed in the West.\nNow, that is no more. The Rockets' third consecutive loss pushed them a game below .500 and out of the current playoff picture. And Jason Terry, whose Rockets team has taken loads of deserved criticism this season, didn't seem too happy following the defeat:\nTerry can speak with some expertise on this matter, considering he was part of a championship Mavericks team that notoriously got along well in 2011. And when a 38-year-old, 17-year vet feels that strongly about his team, it's always going to open some ears.\nHouston came into the year as one of the five supposed elite teams in the Western Conference—along with the Warriors, Spurs, Thunder and Clippers. Obviously, as the Rockets sit closer to the bottom than to the top of the West at 27-28, things haven't gone well. \nThe chemistry has seemed off all year. Terry is just confirming, in the most aggressive way, what our eyes are already telling us."},
{"url": "http://www.foxsports.com/southwest/story/pelicans-snap-jazz-s-7-game-win-streak-021016", "text": "\nNEW ORLEANS (AP) -- Anthony Davis capped a 19-point night with a running left-handed hook and 3-pointer in the final minute, and the  beat Utah 100-96 on Wednesday night to snap the Jazz's seven-game winning streak.\nJrue Holiday scored 21 points for the Pelicans, who won their second straight. Davis scored all but three of his points in the second half. His running hook from about 5 feet out gave New Orleans a 94-92 lead with 59 seconds remaining. His 3 made it 97-93 with 35 seconds left.\nDerrick Favors scored 29 and Gordon Hayward, 21 for Utah, but each missed a free throw in the final minute.\nRodney Hood added 15 for Utah, but the Jazz turned the ball over 17 times and missed 14 of 21 shots from 3-point range.\nNorris Cole had 11 points for New Orleans, including a pair of free throws with 22 seconds left to give New Orleans a five-point lead.\nDespite coming off an overtime victory in Dallas a night earlier, Utah led much of the game and did not appear to have tired legs until the final minutes.\nThe Jazz made 12 of 15 shots in the third quarter, turning a two-point halftime deficit to a lead as large as seven after consecutive driving dunks by Hayward and Trevor Booker made it 74-67.\nRudy Gobert had nine of his 12 points in the third quarter, hitting both of his shots and five of six free throws, and Utah took a 77-71 lead into the final period. Utah briefly bumped its lead up to 79-71 on Hayward's short jumper before the Pelicans responded with an 8-0 run to tie it.\nHoliday and Alexis Ajinca each scored four points during the game-tying surge, which set up an tense, back-and fourth final eight minutes during which neither team led by more than two until the final minute.\nDavis had a quiet first half, but the Pelicans put forth a balanced effort that was good enough to take a 47-45 lead into halftime.\nThe Pelicans got 28 points from reserves in the opening half, helping them erase an early nine-point deficit.\nUtah hit three of its first four 3-point attempts, the third, by Hayward, putting the Jazz up 19-10. New Orleans tied it early in the second quarter and neither team led by more than three points the rest of the half.\nTIP-INS\nJazz: Utah also saw a road winning streak end after three games. ... Hood did not score at least 23 points for the first time in four games. ... G Trey Burke, who stayed behind because of an illness during the current road trip, missed his third straight game.\nPelicans: Guard Tyreke Evans missed his eighth straight game with a right knee injury that was initially diagnosed as tendinitis but now might require surgery. Pelicans coach Alvin Gentry said Evans is seeking a second opinion. \"There is a possibility that it's something that could keep him out the rest of the season,\" Gentry said earlier Wednesday. \"We won't know that until the opinions are gathered and the information is processed.\" ... Before tip-off, the Pelicans asked for a moment of silence for Ingrid Williams, the wife of ex-Pelicans head coach Monty Williams. Ingrid Williams was killed in a car accident earlier Wednesday. Monty Williams, now an assistant coach with Oklahoma City, was hired by New Orleans to his first and only head coaching job in 2010 and fired after last season.\nUP NEXT\nJazz: Visits Washington on Feb. 18.\nPelicans: Visits Oklahoma City on Thursday night."},
{"url": "http://www.foxsports.com/nba/story/charlotte-hornets-michael-kidd-gilchrist-shoulder-injury-sustained-021116", "text": "\n nightmarish season continues. \nKidd-Gilchrist missed the ' first 46 games of the season after tearing his labrum and dislocating his shoulder in October. He underwent surgery shortly after. \nUpon his recent return, he was tremendous. He defended on the perimeter as well as he always does. He was getting to the hole and finishing around the rim more. The fourth-year talent, who's still just 22 years old, was back to help the Hornets in their playoff chase.\nThen, Wednesday night, he dove for a loose ball. Pacers center Ian Mahinmi dove on him in the process. A depressing outcome arose:\nThat's the same shoulder as the one he had surgery on just five months ago.\nAnother shoulder injury. Another play which didn't need to happen. There is no official timetable from the Hornets on MKG's injury yet, but this is severely unfortunate for a young player who's never truly been given a chance to shine."},
{"url": "http://www.foxsports.com/nba/story/san-antonio-spurs-kawhi-leonard-orlando-magic-game-winner-to-beat-jumper-021116", "text": "\nDon't tell me you expected any sort of reaction after he hit the shot. \nQuiet Kawhi doesn't give you facial expressions. He just gets buckets, prevents them on the other end and then goes home to sit on his couch and (this part is just speculation) stare at a turned-off TV screen just because that's the sort of screeching entertainment he prefers. \nWhen the  need their best player, their best player shows up. Wednesday night, with  playing on the second night of a road back-to-back, that's exactly what happened. \nThe Spurs, who trailed the  by double-digits in the fourth quarter, came roaring back in the final period to take a three-point lead. But after Orlando's Evan Fournier hit a triple to tie the game with just 13 seconds remaining, it was Leonard's turn to whisper that he's got this one:\nThat crossover and shot is on Aaron Gordon, too, a particularly strong defender. Gordon guarded the shot well, actually. There wasn't much else he could do. Leonard, who had 29 points in the game and who has become—probably—one of the NBA's five best players, is just that good at this point."},
{"url": "http://www.foxsports.com/nba/story/nba-minnesota-timberwolves-karl-anthony-towns-monster-rookie-of-the-year-021116", "text": "\nWhile  fans have been a bit hesitant to fully fall in love with 2014 No. 1 pick Andrew Wiggins, they are all-in on 2015 No. 1 pick , who put an exclamation point on his final game Wednesday before heading to Toronto to kick off All-Star Weekend with Friday's Rising Stars Challenge.\nThe Toronto Raptors were the latest to witness the Towns rookie rampage: season-high 35 points on 12-of-19 shooting, 11 rebounds and three blocks in 35 minutes in the Timberwolves' 117-112 victory.\nLet's just get this out of the way: Towns is the NBA's Rookie of the Year. The New York Knicks' Kristaps Porzingis has had wonderful first season, and what a story he has been after naive Knicks fans booed him on draft night. But let's make no mistake -- Towns is a monster, and he's the only sane pick for ROY.\nHis huge game Wednesday put the 20-year-old in some elite company, joining Shaquille O'Neal, Kevin Durant, Carmelo Anthony, LeBron James and Chris Webber as the only players in their 19- 20-year-old seasons to have at least 35 points, 10 rebounds, and three blocks in a game. \nTowns is averaging 17.1 points, 10.1 rebounds, 1.8 blocks and 1.4 assists for the season. He's shooting 54.4 percent overall and boasts a true shooting percentage an eyelash below 60 percent. That means the 7-footer can shoot free throws. Wednesday he was 11 of 13 from the foul line, and for the season he's knocking them down at an 85.2-percent rate, which makes him exceedingly dangerous late in games.\nTowns is one of four players in the league this season averaging at least 17.0 points, 10.0 rebounds and 1.5 blocks, joining Pau Gasol, Anthony Davis and Brook Lopez. He's one of just 11 players to average a double-double.\nThe Timberwolves aren't going to make the playoffs again this season, which will extend the longest drought in the NBA to a 12th season. But with each game, the future really is looking a little brighter."},
{"url": "http://www.foxsports.com/north/story/nba-minnesota-timberwolves-stun-toronto-raptors-karl-anthony-towns-021016", "text": "\n The Toronto Raptors were rolling, beating up on a young Minnesota team when maybe, just maybe, their thoughts drifted to the party that awaits them back home this weekend.\nThat's when the  pounced, and a Canadian star and his fellow No. 1 overall draft pick delivered a stunning comeback.\nKarl-Anthony Towns had 35 points and 11 rebounds, and Toronto-born Andrew Wiggins scored 13 of his 26 in the fourth quarter to rally the Timberwolves from 18 points down to a 117-112 victory Wednesday night.\nRicky Rubio had 19 points, eight assists and eight rebounds to outplay All-Star guard Kyle Lowry, and the Wolves used a huge advantage at the free throw line to close out a team that had won 14 of its last 15 games.\nThe Wolves have lost five games this season when leading by at least 17 points. They trailed by 18 in the second quarter and flipped that script.\n\"We got back in the locker room and just talked among ourselves and found out what we needed to do,\" Wiggins said. \"We found out what was working and we kept doing it.\"\nMinnesota set season highs with 43 free throws made on 53 attempts on the way to its largest comeback win of the season. The Raptors were whistled for 34 fouls compared to 21 for the Wolves.\nDeMar DeRozan scored 35 points for the Raptors, who head home to host All-Star Weekend beginning on Friday night. But Lowry was held to 14 points and seven assists while battling foul trouble, and the combination of Wiggins and Towns was too much down the stretch.\n\"We're not good enough to come out and throw our press clippings or our record on the court and not perform,\" Toronto coach Dwane Casey said.\nThe Raptors appeared to be cruising toward a highly anticipated weekend in Canada when they raced out to an 18-point lead in the second quarter. Then Lowry picked up his fourth foul, Jonas Valanciunas couldn't handle Towns in the paint and the Timberwolves came all the way back to grab the lead early in the fourth quarter.\n\"They're just another team to me,\" Wiggins said when asked if there was something special about beating the team he grew up watching. \"Another team to beat.\"\nCasey emphasized before the game the need for a veteran group to hold it together for one more night before the party starts in Toronto. The Raptors were facing a Timberwolves team with the third-worst record in the West that was just blown out by lowly New Orleans in this building two nights prior.\nWhen the Raptors got up big early, they might have relaxed a little bit and they found themselves in a fight for the final 9 minutes.\nRubio's third 3-pointer gave the Timberwolves a 104-98 lead with 5:24 to play.\nThe Raptors fought back to tie the game with under 3 minutes to play, but Wiggins hit big shot after big shot a day before heading back to his hometown to play in the Rising Stars Challenge on Friday night.\n\"We'll see them again,\" Lowry said.\n\nThe Timberwolves improved to 17-37, one more win than they had last season.\n\"We're going in the right direction,\" Wiggins said. \"We have the right pieces. We have all the talent. Now we just need to put everything together.\"\n\nTowns joined Shaquille O'Neal, Kevin Durant, Carmelo Anthony, LeBron James and Chris Webber as the only players in their 19- or 20-year-old seasons to have at least 35 points, 10 rebounds and three blocks in a game. When asked if he surprises himself with his production, Towns quipped, \"I do surprise myself sometimes. Missing two free throws, missing open jump shots.\"\n\nRaptors: Their 68 points were their most in a first half this season. ... Bismack Biyombo left in the second quarter after a nasty spill under the basket but was able to return in the second half. ... The Raptors made 10 of 31 3-pointers to just 4 of 14 for Minnesota.\nTimberwolves: F Tayshaun Prince missed the game to attend former teammate Chauncey Billups' jersey retirement ceremony in Detroit. Zach LaVine started in Prince's place and finished with 13 points. ... Gorgui Dieng had 14 points and 10 rebounds, and all five Timberwolves starters finished in double figures. ... The Wolves again played without Kevin Garnett (leg), Nikola Pekovic (ankle) and Kevin Martin (wrist).\n\nRaptors: Visit Chicago on Feb. 19.\nTimberwolves: Visit Memphis on Feb. 19."},
{"url": "http://www.foxsports.com/nba/story/los-angeles-clippers-boston-celtics-chris-paul-deandre-jordan-alley-oop-and-1-best-of-the-year-021116", "text": "\nNo one throws down an alley-oop like . Even his teammate, Blake Griffin, can't replicate what D.J. can do when he skies into the air to field a lob from Chris Paul. \nThe Celtics learned that firsthand Wednesday night during their thrilling win over the . But before Boston could walk away with a victory, the Clips came out firing with some flashy first-quarter play:\nThat finish isn't quite DeAndre's  from a few years ago, but it's pretty darn impressive, maybe the NBA's best lob finisher's best lob finish of the season. But it wasn't enough to help the Clippers to victory. The Celtics eventually pulled out a 139-134 overtime win."},
{"url": "http://www.foxsports.com/nba/story/los-angeles-clippers-chris-paul-deandre-jordan-hack-a-jordan-intentional-foul-021116", "text": "\nDown the stretch of Wednesday night's game between the Boston Celtics and Los Angeles Clippers, Celtics head coach Brad Stevens instructed Jonas Jerebko to intentionally foul DeAndre Jordan. It's a lame yet effective strategy teams use on a nightly basis to disrupt L.A.'s high-powered offense and put a career 41.8 percent free-throw shooter at the charity stripe.\nBut after spending five years as Jordan's teammate, future Hall of Fame point guard Chris Paul has finally figured out a way to protect his big buddy:\nPaul is the king of gamesmanship. He does whatever it takes to win and has never cared how he looks doing it. Sometimes that can be aggravating. But other times, like here, he comes off looking like a brilliant tactician.\nThe Clippers lost by five, but Paul finished the game with 35 points, 13 assists, five rebounds and three steals. It's only the second time in his entire career , but more legendary than anything else was his decision to sacrifice himself for the greater good."},
{"url": "http://www.foxsports.com/nba/story/los-angeles-clippers-boston-celtics-paul-pierce-fake-pregame-fight-021116", "text": "\n is beloved in Boston after having spent most of his career there, so it's only right that his  teammates used him as prop before playing the Celtics on Wednesday.\nThe Clippers staged a fake pregame fight of sorts and made Pierce the victim by mobbing him and pretending to beat him up.\nPierce played along like a good sport, and it all looked like fun.\nJust an aside: Apparently the Clippers do this sort of thing quite often. Don't you think they would have halted it at least while Blake Griffin is serving a suspension for, you know, ?"},
{"url": "http://www.foxsports.com/nba/story/golden-state-warriors-chicago-bulls-1996-more-impressive-winning-percentage-all-star-break-021116", "text": "\nBy around the time the  got to 10-0, people started to wonder if this could be the greatest team of all time. When they extended that to 24-0, shattering the record for most consecutive wins to begin a season, the conversation really gained legs. \nIt hasn't ended. And now,  heads into the All-Star break with an almost unrealistic 48-4 record as the team chases the 1996 ' 72-10 best-ever season. But the Warriors have already bested  in an important stat:\nFor reference, that 1967 76ers team finished 68-13. The 1972 Lakers won 69 games. The 1997 Bulls won 69, as well.\nThe Warriors, who won 67 games and a championship last season, would need to go 24-6 the rest of the way to match the '96 Bulls' all-time greatest record. Of course, that's still an .800 winning percentage, but for Stephen Curry & Co., .800 almost seems like nothing. "},
{"url": "http://www.foxsports.com/nba/story/houston-rockets-dwight-howard-trade-rumors-021116", "text": "\nNBA fans, general managers and agents, it's time to get serious — because the trade deadline is just a week away, and apparently there's going to be at least one big name potentially up for grabs.\nAfter making it to the Western Conference finals last year, the  have imploded among heightened expectations and uneven play. Firing their head coach while the 2015-16 season was still young hasn't produced the desired results, and the question of whether Dwight Howard and James Harden can make it work remains unanswered.\nThrow in the fact that Howard is reportedly angling for a maximum contract extension this offseason, and it makes sense that the Rockets would finally be interested in trading the mercurial big man ():\nHoward's agent, Dan Fegan,  which stated that neither Howard nor Fegan had asked the Rockets for a trade. Howard followed that statement with , claiming that he \"wants to win\" wth Houston.\nAnd wins aren't out of the question. He's still a very good player; he's averaging 14.6 points and 12.0 rebounds this season, and he's often the only thing giving Houston's defense a fighting chance. But any team that trades for the former Magic and Lakers center has to know that it's all about this season and maybe next. If you're one major piece from an NBA Finals push  then maybe it makes sense to roll the dice and hope that you can win a ring before Howard's value plummets.\nBeyond that, Howard's balky back makes a long, expensive contract a risk not worth taking. Of course, we get the feeling that won't stop a team like the Knicks from thinking about putting Howard and Kristaps Porzingis next to each other in a post-oriented offense.\nMaybe it's finally time for a Howard-for-Carmelo Anthony trade. In a somewhat mundane season where the championship seems like a foregone conclusion — thanks for that, Golden State — such a titanic shakeup would give the NBA a much needed shock to the system. Because who doesn't love a major trade?"},
{"url": "http://www.foxsports.com/nba/story/minnesota-timberwolves-tom-thibodeau-cursory-contact-coach-report-sam-mitchell-021116", "text": "\nThe  were left in a tragic situation when Flip Saunders passed away at the beginning of this NBA season. Off the floor, they lost a mentor, a friend and an idol. On it, they lost a coach, someone who was supposed to develop the young pups like Andrew Wiggins, Karl-Anthony Towns, Zach LaVine and more. \nSam Mitchell took over with an interim title, but it doesn't seem like things will develop beyond there. Could Tom Thibodeau's name be in the mix for the future? ESPN's Brian Windhorst admitted it might while making an appearance on ESPN Radio's Mike & Mike.\nVia :\nThibodeau will be a much sought after entity this upcoming offseason after taking the year off following his ousting from Chicago. He spent the previous five seasons before this one as coach of the Bulls, leading them to the playoffs during each year he ran the bench.\nThibs has rightfully earned a reputation as one of the NBA's greatest defensive minds. And he can certainly fix much of what's wrong with the Wolves' current offense, one of the more outdated attacks in the league, relying on midrange shots all too much and three-pointers all too little.\nThe Wolves have tons of young talent in Wiggins, Towns, LaVine, Shabazz Muhammad, Gorgui Dieng and more. Thibs has worked with Kevin Garnett in the past, as well. The former Bulls coach was an assistant for Doc Rivers during the Celtics' championship runs in 2008 and 2009. There is a basketball attraction there even though the team is in a small market. \nBut Minnesota would hardly be the only team that wanted Thibs this offseason. The Wolves would certainly have their competition if talks were to become more than just \"cursory.\""},
{"url": "http://www.foxsports.com/nba/story/suns-assign-mcrae-to-bakersfield-of-d-league-021116", "text": "\n PHOENIX (AP) The  assigned guard  to the Bakersfield Jam of the NBA Development League on Thursday, and said he will play in the D-League All-Star Game on Saturday in Toronto.\n McRae signed a second 10-day contract with the Suns on Monday after initially signing Jan. 29. The 24-year-old former Tennessee player has averaged 4.8 points, 1.2 assists and 11.3 minutes in six games with the Suns.\n In his last D-League game for the Delaware 87ers, he scored a league-record 61 points against Canton on Jan. 26. He averaged 23.1 points, 5.2 assists and 4.5 rebounds in 28 games for Delaware."},
{"url": "http://www.foxsports.com/carolinas/story/hornets-michael-kidd-gilchrist-out-indefinitely-after-re-tearing-labrum-021116", "text": "\n rapid recovery from a torn labrum suffered during the preseason was one of the pleasant surprises of the NBA's first half. On Wednesday night against the Indiana Pacers, however, the story took a wrong turn: The 22-year-old  wing re-tore the labrum in his right shoulder.\nThe team announced the MRI results on Thursday afternoon. Kidd-Gilchrist is out indefinitely and the team will reevaluate the injury, which may require surgery, after the All-Star break.\nThe injury more than likely ends Kidd-Gilchrist's season.\nThe injury is especially unfortunate not only because of Kidd-Gilchrist's relentless efforts to return to the court this season for his team — this coming after inking a new four-year contract with a player option that could keep him in Charlotte through the 2019-20 season — but because he was playing some of the best basketball of his career, particularly offensively. \nIn seven games this season, Kidd-Gilchrist averaged career highs with 12.7 points per game and a 118 offensive rating. Even more encouraging, the Kentucky product posted a career-best 60.3 true shooting percentage and had hit as many 3-pointers (three) over the past two weeks as he had in his previous three seasons combined.\nThe Hornets posted a 5-2 record with their top wing defender in the lineup, pushing into the Eastern Conference's No. 8 seed entering All-Star Weekend."},
{"url": "http://www.foxsports.com/nba/story/suns-booker-replaces-76rs-noel-in-rising-stars-challenge-021116", "text": "\n TORONTO (AP)  rookie  has replaced injured Philadelphia player Nerlens Noel on the U.S. team roster in the Rising Stars Challenge on Friday night.\n The NBA announced the move Thursday.\n Booker, the 19-year-old former Kentucky guard drafted 13th overall last year, is averaging 10.6 points and shooting 40.3 percent from 3-point range in 48 games. In 23 starts, he's averaging 15.2 points, and had a season-high 32 points against Indiana on Jan. 19.\n Booker also will compete in the Three-Point Contest on Saturday.\n Noel has tendinitis in his right knee."},
{"url": "http://www.foxsports.com/nba/story/phoenix-suns-markieff-morris-fight-strangle-choke-archie-goodwin-good-leadership-021116", "text": "\n shoving  on the bench during Wednesday night's loss to the Warriors isn't unhappiness. \nUnhappiness leads to sulking. Unhappiness leads to poor performance. Unhappiness isn't wrapping your palm and fingers around another man's, a teammate's neck.\nThis is a step beyond. This is a chemical reaction. This is what happens when you drop a Mentos into a Diet Coke or when you toss a match into a vat of alcohol. \nMorris, shortly after getting into that aforementioned physical altercation with Goodwin (which you can watch ), has a different name for it: Leadership.\nMorris may say that he's just leading, and it's certainly presumptuous to view a relationship externally and immediately jump to conclusions, but there are a few things we know to be true.\nWe know Morris demanded a trade over the summer after the  dealt his brother to the Pistons. We know Morris took back his request publicly at the beginning of the regular season. We know Morris, who should've been on the rise coming off the best season of his career, dogged it at the start of the season to such a degree that at-the-time coach Jeff Hornacek thought it'd be best to sit him on the bench instead of even playing him. We know teams around the league have reversed course on his contract. What was once thought to be a team-friendly four-year, $32 million deal isn't so right now, even if Morris has upped his play since Phoenix fired Hornacek at the beginning of the month.\nFor all the talk there is about uncertainty with the Kings or weirdness with the Clippers, the Suns have a chaotic situation going on, as well. And though it's unfair to compare leadership styles—there's no right way to lead—it's hard to imagine how getting into a physical altercation in public can help the 14-40 Suns dig themselves out of the hole they've already created for themselves."},
{"url": "http://www.foxsports.com/nba/story/cleveland-cavaliers-lebron-james-toronto-schools-charity-foundation-donation-uniforms-021116", "text": "\n will spend All-Star Weekend in Toronto along with the rest of the NBA's best players, and while he's there, he's decided to do some good. James' family foundation surprised a group of Toronto students Thursday with a team uniform giveaway. \nVia The :\nThis is far from the first time James and his foundation have made the news. He's known for bringing some amount of good will to the All-Star Game each year. Last year, he flew  to New York, the setting for the game, for the weekend's festivities.\n\"It means a lot to me and my foundation to be able to give back to every All-Star city, and in Toronto we wanted to do something special for some teams and groups that earned it,\" he said, via the AP.\nMaybe no deed from James is greater than the one he announced last summer, when James disclosed that his charity would be spending more than $41 million to send 1,100 Akron-based students to college on four-year scholarships."},
{"url": "http://www.foxsports.com/nba/story/nba-all-star-game-los-angeles-lakers-kobe-bryant-reggie-miller-hate-love-021116", "text": "\nWith  set to play in his 18th and final All-Star Game, the memories and stories of the  legend are pouring in from all over the basketball world.\nIn Reggie Miller's case, he has an extremely tortured relationship with Bryant.\n\",\" . \"Obviously, along with Shaq (O'Neal), that Laker team denied me from the ultimate goal in winning a championship.\"\nMiller's 18 title-less years with the Indiana Pacers built more than just competitive hate for Bryant, of course. All the encounters with Kobe gave Miller a deep appreciation and respect for him as well.\n\",\" . \"I love him because, when you come in at 18 and you play 20 years at the shooting guard position, and to end it all with one (championship ring) for the thumb and the amount of minutes, points and mileage that he's put on his baggage, that shows me a love for the game.\n\". Father time catches up to all of us, and to have to be able to pass the torch and the legacy to guys like D'Angelo Russell and Julius Randle, it's tough for superstars to give an inch and Kobe has had to take a step back and assess what's important to him. So I respect him giving back to these young guys and teaching them what it's going to take to be successful in this league.\"\nSo, really, what Reggie is telling us is he has absolutely no idea how to really feel about Kobe after competing against him for many years, which Kobe would probably take as the ultimate compliment and a sign of a Hall of Fame career well done."},
{"url": "http://www.foxsports.com/west/story/la-clippers-jj-redick-is-giving-fans-extra-access-during-nba-all-star-weekend-021116", "text": "\n is pulling out all the stops in his quest for the three-point crown. \nAlready in Toronto for the 2016 NBA All-Star Weekend, Redick is inviting fans to watch his Friday practice session for the Foot Locker Three-Point Contest live via .\n \nOf course, some fans might remember Redick's somewhat comical error during last year's Three-Point Contest when the  guard shot and made multiple attempts with his foot on the three-point line. Redick has vowed this year to keep his feet behind the arc and not to shoot any \"long twos\" during the contest.\n \n "},
{"url": "http://www.foxsports.com/nba/story/san-antonio-spurs-kawhi-leonard-shaq-shaquille-oneal-hands-photo-all-star-game-toronto-021116", "text": "\n forward  is the league’s reigning defensive player of the year and having an  certainly helps his cause. That measurement includes giant hands that we now know rival those of future Hall of Famer Shaquille O'Neal.\nThe Western Conference All-Star is in Toronto as part of this weekend's festivities, and on Thursday night he joined the \"TNT NBA Tip-Off\" set to catch up with Shaq, Ernie Johnson, Kenny Smith and Charles Barkley.\nAt one point during their conversation, Shaq and Leonard went hand-to-hand. Keep in mind that Leonard gives up six inches of height on the big man. Also think about all those times Shaq lined up a free throw and the ball looked like a grapefruit. Here was the result:"},
{"url": "http://www.foxsports.com/nba/story/thunder-hold-moment-of-silence-for-assistant-williams-wife-021116", "text": "\n OKLAHOMA CITY (AP) The  held a moment of silence for assistant coach Monty Williams' wife before their game against the  on Thursday night, a day after she died following a car crash.\n Williams coached New Orleans last season, and the Pelicans also held a moment of silence for Ingrid Williams before their game Wednesday night against Utah.\n The family's pastor, Dr. Mark Hitchcock of Faith Bible Church in Edmond prayed for the family.\n Thunder star Kevin Durant was overcome with emotion as he reflected after the morning shootaround.\n ''Just love Coach Monty so much, man,'' Durant said. ''I feel for him, man. It's somebody we all love.''\n Thunder coach Billy Donovan said it would be different Thursday without Williams to his right, but the team had no choice but to prepare for the game.\n ''I thought our group this morning was as good as it could be coming in,'' Donovan said. ''Everybody, I think, personally, is hurting for Monty and his family. Just trying to have faith right now that Ingrid is in a better place, and hopeful that our guys will come out there and play to the best of their ability.''\n Ingrid Williams, 44, was involved in a crash Tuesday night. An oncoming car crossed the center line and hit her SUV just outside of downtown Oklahoma City, said police Capt. Paco Valderrama. That driver was pronounced dead at the scene, Valderrama said.\n Monty Williams was hired by New Orleans to his first and only head coaching job in 2010 and fired after last season. He helped guide the Pelicans to the postseason twice and had a record of 173-221.\n Pelicans star Anthony Davis spent three seasons with Williams as his coach and said Ingrid Williams was important, too. He said in a tweet: ''Completely devastated. Ingrid Williams was like a 2nd mother to me when I got to NOLA. My thoughts & prayers are with Monty & the family.''\n First-year Pelicans coach Alvin Gentry said Ingrid's impact was significant. It really affected his team as it prepared for its game Wednesday night, and the players were still dealing with it Thursday.\n ''It was really difficult for our guys to get through it because he (Monty Williams) has had such an impact on the players, and she had even more of an impact, maybe, with the mothering that she did for most of the guys and the type of person that she was,'' Gentry said. ''She wanted everybody to feel like they had a home away from home.''"},
{"url": "http://www.foxsports.com/southwest/gallery/most-nba-all-star-game-appearances-of-all-time-012916", "text": ""},
{"url": "http://www.foxsports.com/buzzer/story/jose-bautista-nba-all-star-celebrity-game-canada-coach-towel-boy-021116", "text": "\nToronto Blue Jays outfielder José Bautista knows his role and how to make the most of it.\nWith two-time NBA MVP Steve Nash and Toronto Raptors Global Ambassador Drake  six-time American League All-Star Bautista has joked there's not much for him to do but look pretty.\n\"Hopefully I’ll just stand there, look halfway decent and maybe pass out some towels,\" . \"I’m just going to sit there and pretend I know what’s happening.\"\n\"I'm a fan because mostly I can't do what those guys can,\" Bautista also said recently. \"It's pretty cool to see and watch their talent level. I'm a big fan. I follow the (Miami) Heat, which is probably not what most Toronto people want to hear but it is the truth. That's about it -- I wasn't very good at it when I played.\"\nThe coaching staff for the American team appears to consist of only actor-comedian Kevin Hart, a four-time celeb game MVP who has enough energy to fill an entire staff.\nWe can certainly understand that Bautista wants to avoid a  situation, but he's not giving himself enough credit. Almost anything goes in these celebrity games and we know .\nMaybe some celebratory, Bobby Knight-style chair launching? "},
{"url": "http://www.foxsports.com/arizona/story/suns-devin-booker-replaces-nerlens-noel-in-rising-stars-challenge-021116", "text": "\n rookie Devin Booker has replaced injured Philadelphia player  on the U.S. team roster in the Rising Stars Challenge on Friday night.\nThe NBA announced the move Thursday.\nBooker, the 19-year-old former Kentucky guard drafted 13th overall last year, is averaging 10.6 points and shooting 40.3 percent from 3-point range in 48 games. In 23 starts, he's averaging 15.2 points, and had a season-high 32 points against Indiana on Jan. 19.\nBooker also will compete in the Three-Point Contest on Saturday.\nNoel has tendinitis in his right knee.\n\n\nIn other Suns news, the team assigned guard Jordan McRae to the Bakersfield Jam of the NBA Development League and said he will play in the D-League All-Star Game on Saturday in Toronto.\nMcRae signed a second 10-day contract with the Suns on Monday after initially signing Jan. 29. The 24-year-old former Tennessee player has averaged 4.8 points, 1.2 assists and 11.3 minutes in six games with the Suns.\nIn his last D-League game for the Delaware 87ers, he scored a league-record 61 points against Canton on Jan. 26. He averaged 23.1 points, 5.2 assists and 4.5 rebounds in 28 games for Delaware."},
{"url": "http://www.foxsports.com/other/story/utah-jazz-gordon-hayward-esports-021116", "text": "\n star Gordon Hayward has been very open about his passion for eSports, and he now wants to help viewers who still don't understand why watching people play video games has become ridiculously popular.  \nIn an essay for , Hayward concludes that confused traditional sports fans should stop worrying so much about the definition of a \"sport,\" and instead recognize that the competitions share the same qualities. \nThe eSports movement mirrors traditional sports in countless ways. There are huge fan bases, rivalries, leagues, seasons, player trades, free agency and sometimes even promotion and relegation. More importantly, Hayward writes that though the rules and intricacies of each game are different, competitive gaming provides him the same sort of satisfaction as playing basketball.\n\nYou can read more at ."},
{"url": "http://www.foxsports.com/nba/story/detroit-pistons-retire-chauncey-billups-jersey-021016", "text": "\n — Moments before his jersey went up to the rafters, Chauncey Billups spoke to the crowd about the night the  wrapped up the 2004 NBA title by routing the Los Angeles Lakers in Game 5 of the Finals.\n''We had one motivation,'' he said. ''We wanted to win it here at home.''\nBillups was the most valuable player in the Finals that year, and he had his No. 1 jersey retired by the Pistons on Wednesday night at halftime of their game against Denver.\nHe was the second player from that 2004 team honored by the Pistons this year. The Pistons retired Ben Wallace's jersey last month at a similar ceremony — in front of a packed house on a night Detroit beat Golden State.\nThere were some empty seats in the upper level Wednesday, but Billups wanted to be honored while the Pistons were playing the Nuggets. Billups is a Denver native and played for the Nuggets for two stints during his career.\n''This was by design, only because there's a lot of people that contributed to my success as a player and as a man, in Denver, my hometown,'' Billups said before the game. ''There were several dates that I could have chosen. This one obviously stuck out.''\nBillups does have a mild regret about his run of success with the Pistons. He figures they could have won more titles.\n''I felt like, two and maybe three championships — we were that good,'' he said.\nBen Wallace was on hand Wednesday, and so were Richard Hamilton, Rasheed Wallace and Tayshaun Prince from the 2004 champions. Pistons great Isiah Thomas was also at the Palace for the ceremony.\n''This is what tradition looks like,'' Thomas told the crowd. ''This is what it feels like.''"},
{"url": "http://www.foxsports.com/nba/story/houston-rockets-james-harden-numbers-don-t-mean-anything-021016", "text": "\nAround this time last year, the basketball world was in the midst of a heated MVP debate, one topped with two names: Stephen Curry and . At the end of the year, Curry ended up winning the award narrowly, though many—including Harden, of course—thought the  shooting guard, whose team had dealt with more injuries and roster attrition, did more to help his team win.\nThis year, that debate seems laughable—though whatever has happened following last season hardly delegitimizes the opinions of those who thought Harden deserved the 2014-15 award. And though Harden's numbers are almost identical to the ones he posted a year ago, he isn't even in the MVP conversation with the Rockets falling from second-best in the West to .500 at the 54-game marker. \nHarden apparently agrees. He said as much Wednesday, via :\nCurry is the clear No. 1 candidate for the MVP this season, outdoing Harden in plenty of categories, but most importantly in wins. His 47-4 Warriors, pacing for the best record of all time, currently hold a baffling 21.5-game lead on the team they defeated in the Western Conference Finals just last season.\nHarden, meanwhile, has sustained criticism for showing up a little out of shape at the start of the season, for contributing to a slow Rockets start, for taking at least some of the blame for the firing of Kevin McHale. He still holds the reasonable title for the NBA's best shooting guard, even as his defense has fallen and his isolation play has come under more fire with the Rockets underperforming. But, as he would put it, all those numbers mean squat when you may not even end up leading a team as talented as Houston's into the postseason."},
{"url": "http://www.foxsports.com/nba/story/arena-league-in-talks-with-leonsis-about-washington-team-021016", "text": "\n WASHINGTON (AP) Commissioner Scott Butera says the Arena Football League is in ''serious negotiations'' with Ted Leonsis' Monumental Sports & Entertainment about bringing a team to Washington.\n Butera confirmed a Washington Post report that the Arena Football League had a strong interest in the Washington area and is in talks with Monumental. Butera said in a phone interview on Wednesday that the goal would be to have a team in place for the 2017 season.\n Butera couldn't comment on where the team might play, other than to say it would be ''well-liked by all of the fan base.'' Monumental owns Verizon Center, where the NBA's Wizards and NHL's Capitals play.\n The AFL currently has eight teams but none located on the East Coast between Philadelphia and ."},
{"url": "http://www.foxsports.com/nba/story/miami-heat-hassan-whiteside-bill-russell-021016", "text": "\n center  knows how unique a talent he is. He let everybody know that last month after he produced his second of now three points-rebounds-blocks triple-doubles on the season: \"Ain't nobody doing it with blocks.\"\nAin't no doubt about it.\nBut Whiteside also has to know how many of millions of dollars he's potentially costing himself with sophomoric antics such as Tuesday's foolish elbow tossing that earned him a flagrant 2 foul, an ejection and suspension.\nNot only that, Heat coach Erick Spoelstra took the unusual step of telling Whiteside to scram, immediately. Spoelstra didn't want him anywhere around. Whiteside's veteran teammates, Dwyane Wade and Chris Bosh, were again left to lament the big man's unfortunate immaturity, just as he should be all grown up by now at age 26, just as he's on the cusp of striking it rich this summer as an unrestricted free agent. \nThere's a reason why Whiteside's salary this season is less than $1 million when the league average is nearly $4.5 million.\nThere's no debate about the value Whiteside's obvious physical talent. His presence in the paint changes how opponents attack the Heat. He's averaging 12.2 points, 11.0 rebounds and 3.9 blocks a game. No player has averaged at least 4.0 blocks a game since Dikembo Mutombo did 20 years ago. Recently, Whiteside posted on his Twitter account a quote from Hall of Famer Bill Russell about the true art of being a shot blocker:\nIt's easy to find Russell's great sayings. Just Google \"Bill Russell quotes,\" click on the first entry and that very Russell quote that Whiteside tweeted is the second one on the very first line.\nBut it's the first Russell quote on that first line that Whiteside should concern himself with most if he plans on not wasting a career that is finally burgeoning:\nAttaining greatness in the NBA takes more than physical prowess. For Whiteside's sake, let's hope he starts taking to heart all of Bill Russell's teachings."},
{"url": "http://www.foxsports.com/nba/story/damian-lillard-jerry-colangelo-added-to-list-finalists-usa-basketball-rio-olympics-021016", "text": "\nDamian Lillard has been very vocal about his unhappiness with how he's been treated by USA Basketball in the past, and with good reason. It's run by Jerry Colangelo with an iron fist, and requires very specific actions from players in order to be included in the program's inner circle.\nLillard believed he was on the outside looking in, so when asked about attending the Las Vegas minicamp last summer -- one which Colangelo called \"mandatory\" for players who wanted a chance to be included on the roster for this summer's Rio Olympics -- he didn't hesitate in letting his true feelings be known.\n\"I did it the last few summers and last summer I didn't make it,\" Lillard said at the time .\"I don't know why I would go. After I got cut last summer, I don't think I'm a part of it.\"\nUnsurprisingly, Lillard didn't make the cut when the original list of 30 finalists was released.\n“There’s no hard feelings toward (USA Basketball), but any time I go into a situation, I want to have a real opportunity,” said Lillard in January . “If I’m going to invest myself in something I want to have a real opportunity at it and the last time that I did that I felt like the decision was already made before the decision was made. Whether I played good or bad I didn’t feel like it mattered.”\nIt appears as though Lillard has changed his mind, and decided to make amends. He's been added to the list of finalists, but it took him making a personal phone call to the program's godfather to make it happen.\n“I recently received a call from Damian, and during our conversation he expressed his desire to be considered for the U.S. Olympic Team and to remain involved with the USA National Team in the future as well,” Colangelo said via the official release. “Both Mike (Krzyzewski) and I feel like Damian is playing at a very high level and that he should be added to our list of Olympic finalists. Damian has been a member of the USA National Team since 2014, and he participated in National Team training camps in 2013 and 2014, so he does have equity in USA Basketball, which is always important to me.”\nThis feels more like a business decision by Lillard than anything else, because this doesn't really change any of the issues he's had with the program in previous years. But staying involved is important if he wants to be considered for the future, so it makes sense to take the first step in that process."},
{"url": "http://www.foxsports.com/north/story/midweek-stock-report-february-10-minnesota-gophers-minnesota-wild-021016", "text": "\nEvery Wednesday, FOX Sports North takes a look at which athletes' stock is trending up and whose is trending down.\nIn other words, who is trending up, like Minnesota Gophers forward Amanda Kessel, and whose stock is way, way down, like Minnesota Wild defenseman Jonas Brodin.\nWith that in mind, let's \"take stock\" of the current sports scene in Minnesota.\n\nHer career may have been in jeopardy just a few months ago, but the University of Minnesota forward is finally back. Kessel was shelved while battling post-concussion symptoms following the 2014 Sochi Olympics, missing the 2014-15 season after sitting out the previous year in order to train and compete with Team USA. The 2013 winner of the Patty Kazmaier Award as the best women's player in college hockey and a silver medalist in Sochi, Kessel notched a pair of assists in the Gophers' road series against WCHA rival North Dakota, and brings yet another offensive weapon to 25-3-1 Minnesota's high-flying attack.\n\nThe Minnesota senior matched the NCAA's single-game women's scoring record Sunday, scoring a whopping 60 points to lead the Gophers to a double-overtime win over Northwestern. Banham finished 19 of 32 from the field to tie a record that has stood since 1987, six years before she was born. Banham also moved into 24th on the NCAA's all-time scoring list, and now has 2,773 career points for the Gophers. To top it all off, she got a congratulatory tweet from NBA star Kobe Bryant.\n\nA junior forward for the Bulldogs, Iafallo picked up his first multi-point game of the season Friday, scoring twice to lead UMD to a 5-3 win over NCHC foe Colorado College. The New York native was at it again Saturday, scoring the game-winner in the third period of a 3-2 win. Iafallo chipped in Tuesday as well, notching an assist in a 3-2 loss to nonconference rival Bemidji State, and now has 14 points on the season.\n\nThe fourth-year defenseman and rumored trade candidate has a minus-1 rating over his last 10 games, as well as just one assist during that span, but his season hit another speed bump Saturday. The Wild announced that Brodin will be out three to six weeks with a foot injury, complicating both Minnesota's defensive corps and its search for scoring talent in the lead-up to the Feb. 29 trade deadline.\n\nThe Serbian forward was productive in a loss to the Pelicans on Monday, scoring 10 points and grabbing four rebounds despite doing much of his damage with the game out of reach in the fourth quarter, but it's been a rough week for Bjelica otherwise. He was inactive in wins over the Chicago Bulls and the Los Angeles Clippers.\n"},
{"url": "http://www.foxsports.com/fantasy/story/three-burning-fantasy-basketball-questions-feb-10-021016", "text": "\n\n\nMarc Gasol will be sidelined for 4-6 months with a broken right foot, which means you can drop him in all re-draft leagues. It's a tough break for Gasol owners, as his assists (3.8 a game) and free throw percentage (82.9 percent) always gave Gasol sneaky value across the board at the center position. Gasol is a guy who takes nothing off the table, and you can't afford to lose someone like that. \nFinding a replacement along those lines can be difficult. Gorgui Dieng is a great option, but he's owned in 70+ percent of most leagues. Robin Lopez isn't a stud, but he'll quietly put up solid numbers in every category if he's available. \nOn the lower-owned spectrum, Alex Len is a decent stash. Phoenix has nothing to play for and will want to get him court time. There's always the chance that Tyson Chandler is shipped to a contender, as well, leaving a bunch of minutes for the talented big man to fill. \nAgain, you won't be able to replace a guy like Gasol and keep cruising at the same speed. It's probably not a bad idea to look for guys like Dieng who won't hurt you in any category, though, so you don't see much of a drop-off if you're holding onto a top spot. \n\nIt's a little early for that, but not too early. We tried to warn you last week about Tyreke Evans, who is debating on whether to go under the knife on his right knee yet again. That would take him out for the year. Try and sell him now and hope that you're trading him to an owner who has his head in the sand.\nWho else is a candidate to get surgery and shut it down? Jimmy Butler is slated to miss the next three or four weeks with a strained knee, and it wouldn't be a surprise if the Bulls pulled the plug on the season at some point while he's out. The Bulls are barely above .500 as it is, and that's with Butler doing nearly all of the heavy lifting. I don't trust Derrick Rose to keep the Bulls afloat, and Pau Gasol is always a threat to miss time. I would sell on Butler right now as well. \nBrandon Knight could be unlikely to return this year. He's been dealing with a groin injury all year, and Phoenix has very little to gain by trotting him out there before he's absolutely 100 percent. Knight could put up big scoring numbers as Phoenix's top option should he return, but I'm no optimistic. \nIf Kevin Martin isn't dealt at the deadline, he probably won't play much for the young Timberwolves. If Brook Lopez gets nicked up, the Nets won't hesitate to shut him down, either.\nEssentially, any star player or banged up veteran for a non-playoff team is at risk. The players who have proven to be prone to injury (like Lopez, Anthony Davis, etc.) are at an even greater risk. Tread cautiously. \n\nIn my mind, it's  point guard Dennis Schroder. There's been talk of the Hawks blowing up their core altogether, but even barring that, it seems unlikely that Atlanta will play out the year with Jeff Teague and Schroder both on the team. \nAtlanta seems much more likely to commit to Schroder. He's younger, cheaper, controllable and has a higher ceiling. The Hawks staff has had plenty of time with Teague, and it's pretty clear that it's just not going to work out at an elite level. Schroder has his flaws and can play out of control, but he's earned his chance. \nAs the point guard in an offense where he'll have plenty of touches, especially if Al Horford or Paul Millsap are dealt as well, Schroder's arrow is pointing way up. Per 36 minutes he's averaging 18.3 points and 7.9 assists with 4.9 boards, 1.7 threes and 1.7 steals. That's a fantasy stud, even if the percentages and turnovers will burn you a bit. \nThere will be nights where he'll frustrate you with mistakes, but he's one of the most exciting young players in the league.\nIf I had to stash one free agent before the deadline who is owned in less than 50 percent of nearly all leagues, it would be Schroder. Go get him. "},
{"url": "http://www.foxsports.com/nba/story/rose-back-in-bulls-lineup-against-hawks-after-missing-game-021016", "text": "\n CHICAGO (AP)  is in the Chicago Bulls' lineup Wednesday against the  after missing a game because of soreness.\n The 2011 MVP point guard was a late scratch from Monday's loss at Charlotte because of soreness. Rose is having one of his toughest seasons on the court, averaging 15.9 points and 4.8 assists. He is shooting just 40.9 percent overall and 24 percent on 3-pointers.\n Chicago came into Wednesday's matchup third in the Central division at 27-24 after dropping 12 of 17 games."},
{"url": "http://www.foxsports.com/nba/story/sacramento-coach-karl-says-meeting-with-gm-divac-positive-021016", "text": "\n PHILADELPHIA (AP)  coach George Karl said Wednesday he has a positive outlook after meeting with team general manager Vlade Divac amid a losing streak and speculation about his job.\n Karl said before the Kings-76ers game in Philadelphia that he and Divac are on the same page.\n ''I've always felt good about Vlade. I don't think Vlade and I have a disconnect other than we want to win more games than we're winning right now,'' Karl said. ''And that's fine with me. Everyone should want to win more games.''\n Sacramento is 21-31 and has lost eight of its last nine. After Wednesday's game, Karl said the team would go home for the All-Star break to ''regroup and recuperate.''\n Divac said in a statement that Karl ''is our coach and we're collectively working through our issues.''\n He told The Associated Press before the game that the team's defense must improve. Sacramento is allowing a league-worst 109.1 points per game and has given up 120.8 over a four-game losing streak.\n ''Defensively, we are not good,'' Divac said. ''That's something we have to improve big. It would make a difference. Our offense is stable, but defensively we go on and off.''\n Divac said he believes in his players, but didn't rule out adding pieces to help defensively -- or in other areas -- before next Thursday's trading deadline.\n ''We do have what we need, but still like every other organization, if it's something that will improve us we will do it,'' he said. ''But, now, we are happy with the group.''\n Karl declined to offer more specifics about their meeting.\n The coach said speculation about his job won't add extra pressure.\n ''That's your world,'' he said. ''My world is basketball, the gym and players. Your world is interpretation, innuendo, gossip. I'm not into it.''\n Kings star DeMarcus Cousins and Karl have struggled to work together. The All-Star center has not hid his emotions or frustrations.\n Karl says he thinks the team's funk is temporary.\n Meanwhile, he says he won't be bothered by the criticism that comes with losing.\n ''When you're younger, you're always a little more into what people are saying and what people think of you,'' said the 64-year-old Karl, who is coaching his sixth NBA team after time in Cleveland, Golden State, Seattle, Milwaukee and Denver.\n ''As you get older, I think you learn you have no control over that. You can do your job perfectly in this league and if you don't fulfill expectations, you're going to be criticized,'' he said.\n Last year, Karl became the Kings' third coach in one season. He took over following the 2015 All-Star break, succeeding Tyrone Corbin. Corbin had been promoted from top assistant to replace the fired Michael Malone. Karl coached Sacramento to an 11-19 record for the rest of the season.\n The Kings are in 10th place in the Western Conference and haven't made the playoffs in 10 years."},
{"url": "http://www.foxsports.com/nba/story/kobe-bryant-lebron-james-lakers-cavaliers-trade-021016", "text": "\nIt sounds fair enough:  for . What's not to like?\nIn 2007, Kobe was 28 years old and had just dropped 32 points per game on helpless defenders. LeBron was 22 and just finished his one-man show in the playoffs, leading a talent-starved  roster to the Finals.\nSo why wouldn't the Cavs send The King to the  for the Mamba in a  by the Lakers in the summer of 2007?\nForget the fact that LeBron was six years younger and was the franchise's hometown hero (though those two reasons were probably enough for the Cavs to balk at the deal.) LeBron's ability to do more with less could not be ignored.\nLeBron led that Cavs team in scoring (27.3 per game), assists (6.7) and steals (1.6) while finishing third in rebounds (6.7). He was asked to do virtually everything on a roster that lacked another offensive weapon.\nIt wasn't like Kobe, who had championship three rings at the time, was swimming in talent on his roster either (Luke Walton was the third-leading scorer!) But the one thing the Mamba did have was Lamar Odom, who averaged 16 points, 10 rebounds and five assists that season. Odom was easily better than any option LeBron had on his team. Odom's versatility and ability to handle the ball provided Kobe with a true No. 2 option.\nThe Cavs' second-leading scorer was Larry Hughes at 15 points per game. Hughes played mostly shooting guard, leaving LeBron to shoulder most of the ball-handling duties.\nLeBron's ability to carry this team was on full display against the Detroit Pistons in the Eastern Conference finals. He scored 48 points, including 29 of the Cavs' final 30, against one of the best defensive teams at the time despite the Pistons knowing he was really the only real scoring option. But LeBron still showed trust in that roster, averaging eight assists during that run playoff run.\nKobe was no joke either in the 2007 playoffs. Despite the Lakers losing 4-1 to the Phoenix Suns in the first round, the Mamba averaged 33 points. It just wasn't enough against a Suns team that won 61 games that season.\nKobe's ability to score is undeniable, especially at that point in his career. He was at the height of his powers, virtually unstoppable one on one. But he was never known -- even now at the end of his career -- as a player who would get his teammates involved offensively. Would he have shown the same trust LeBron did in that Cavs roster? Doubtful at best.\nBut remember, Kobe was fuming because he wanted to win. Despite the Cavs reaching the Finals in 2007, Kobe, who had a no-trade clause, would have seen the flaws in their roster and balked at the move despite facing an easier path to the Finals in the East.\nBut forget the on-court debate. How would Kobe react playing in Cleveland? The Cavs had to have known that if Kobe wasn't happy playing in Tinseltown with the Lakers, how could it ever have worked out in Cleveland?\n\"I never would've approved it. Never. The trade to go to Cleveland? Never,\" Bryant told ESPN's Baxter Holmes this week. \"That wasn't one of the teams that was on my list. It was Chicago, San Antonio [or] Phoenix.\"\nIn the end, the Cavs made the right decision, though really there wasn't any real decision to make. LeBron's importance to that franchise -- that city -- meant he was untouchable in a way that many NBA stars aren't. No knock on Kobe, but for the Cavs, this one was a no-brainer."},
{"url": "http://www.foxsports.com/san-diego/story/kobe-advice-to-lebron-james-021016", "text": "\nCLEVELAND (AP) --  remembers giving a pair of his sneakers to  as a gift and offering the teenager some advice.\nThe years in between have passed in a blur.\nOn his final visit to Cleveland to play against James on Wednesday night, Bryant reflected on his relationship with a player who once hung a poster of him on his bedroom wall in Akron, Ohio, and has grown into a valued friend.\nAnd as gets ready to say goodbye to the NBA after two decades, Bryant was stunned to learn that James, too, is on the back half of his career.\n\"Is this his 10th year?\" Bryant asked, before being told that James has been in the league longer. \"Eleventh year? Thirteenth year! He's a true, true vet. It's strange. To me, it still seems like he just got into the league. Pretty crazy. ... He might retire soon, too.\"\nBryant was at ease during his interview session with reporters before the  played the . This is Bryant's sendoff, his farewell tour, and the 37-year-old is trying to savor every moment.\nWhen he was in high school and on the verge of becoming a household name, James met Bryant before playing against Carmelo Anthony in an All-Star game in Philadelphia. It was then that Bryant dropped some knowledge on James.\n\"I remember sitting down and talking with him,\" Bryant said. \"The advice I gave him, because he would have so much coming at him, was focus on the game. Stay true to the craft. Everything else would sort out. That was the most important piece of advice I could give him.\"\nOn several occasions this season, James has spoken with reverence toward Bryant, one of the game's most celebrated players with whom he is often compared. The two didn't always have the strongest connection, but is has matured over the years, helped by them playing together on the U.S. Olympic team.\nBryant and James once seemed on a collision course to meet in the NBA Finals, but the matchup never materialized, disappointing a basketball world wanting to see the greats go head-to-head with everything on the line.\n\"We never crossed paths unfortunately,\" Bryant said. \"I just wanted to win the damn thing. I didn't care who we played. For the fans it probably stinks because it would have been a great matchup, but from a player's perspective it doesn't matter who you play. ... Just want to win the championship.\"\nBryant recalled previous visits to Cleveland, including the 1997 All-Star Game when he participated in the dunk contest as a rookie. That year the showcased the game's Top 50 players, a who's who of hoops immortality that had Bryant in a daze.\n\"Man, I remember walking around the hotel, I remember walking around this arena, and just running into a great after great after great after great after great,\" Bryant said. \"I grew up watching all of these players. So I watched all of the classic videos, the films, the books. So to see these players all walking around, it was pretty amazing.\"\nThis weekend, Bryant will take his All-Star bow. It will be the last time he mingles with his peers, who will undoubtedly honor him throughout the festivities in Toronto.\nBryant's career has come full circle.\n\"I can't wait to be around them and talk to them and see how far the game has progressed, see all this young talent the different generations of players,\" said the 16-time All-Star. \"To me, LeBron is still young. I can't fathom this is his 13th season and the generations that come after him -- the Durant generations, the Curry generations. There are so many generations in between that. It's going to be fun for me to be around.\n\"When I first played in an All-Star game, imagine an 18-year-old, 19-year-old kid walking into a locker room and here's John Stockton with his little itty-bitty shorts. There's Barkley. There's Clyde Drexler. There's Gary Payton. I was a 19-year-kid.\""},
{"url": "http://www.foxsports.com/nba/story/monty-williams-ingrid-oklahoma-city-thunder-new-orleans-pelicans-coach-car-crash-021016", "text": "\nThe wife of  assistant coach Monty Williams died Wednesday evening at a hospital from injuries suffered in a car crash, police said.\nThe 44-year-old Ingrid Williams was involved in a crash Tuesday night. An oncoming car crossed the center line and hit her SUV just outside of downtown Oklahoma City, said police Capt. Paco Valderrama. That driver was pronounced dead at the scene, Valderrrama said.\nThe Thunder issued a statement expressing \"deep sorrow\" and saying the team would support Williams \"in every way possible.\" Williams joined the Thunder this season after five seasons as the  head coach.\nA statement on behalf of the Pelicans' owners said Ingrid Williams will be remembered \"as one of the most generous, kind and humble individuals we've ever known.\"\nThe Pelicans held a moment of silence for her before tip-off of their game against the Utah Jazz on Wednesday night. Monty Williams was hired by New Orleans to his first and only head coaching job in 2010 and fired after last season. He helped guide New Orleans to the postseason twice and had a record of 173-221.\nDenver coach Michael Malone became choked up while talking about Williams' death after his team's win over the Detroit Pistons.\n\"I apologized to the team. The first half, I coached very angry,\" he said. \"I don't know if you guys heard, Monty Williams, a good friend of mine, his wife was killed in an accident.\"\nAfter a long pause, he said, \"So I apologized to them because it's taking my anger out on them, and they don't deserve that.\"\nPelicans star Anthony Davis spent three seasons with Williams as his coach.\nHe said in a tweet: \"Completely devastated. Ingrid Williams was like a 2nd mother to me when I got to NOLA. My thoughts & prayers are with Monty & the family.\"\nIt wasn't immediately clear what caused the oncoming car to swerve. An investigation is ongoing.\nMonty Williams was the 24th pick in the 1994 NBA Draft. He played nine seasons with New York, San Antonio, Denver, Orlando and Philadelphia."},
{"url": "http://www.foxsports.com/nba/story/kobe-bryant-lebron-james-los-angeles-lakers-cleveland-cavaliers-rivalry-021016", "text": "\n and  played Wednesday night for the second-to-last time.\nBut it comes as no surprise that the  great downplayed any competition with the fellow Hall-of-Fame talent -- who's six years younger and has three fewer championship rings.\n\"I never looked to see what he was doing as something to push me,\" Bryant told reporters before his final game in Cleveland.\nAs for any perceived rivalry between two of the biggest stars in the game, Bryant simply doesn't feel that there is one.\n\"I wouldn't say he was a rival. ... I just felt like we were completely different generations. I just missed that thing completely. Not like a Magic and Bird sort of thing. It was more like, from the time he came in the league it was more helping him, giving him direction, advice, 'cause I was just so much older by NBA years. So no, I've never had that.\"\nBryant and James have been the two faces of the NBA for quite some time -- ever since LeBron entered the league in the 2003-04 season. But the Black Mamba and King James have never faced each other with a title on the line.\nSo is it weird to Bryant that he's never met James in the Finals?\n\"I wouldn't say weird,\" Bryant said. \"It's just, I don't know if weird would be the term I'd use for it. Our teams, just, we never crossed paths unfortunately. I don't want to say it was weird or anything like that. Just the ebb and flows of each season.\"\nUnfortunate is right. A Kobe vs. LeBron Finals is the kind of matchup that NBA fans dream of, but Bryant isn't losing sleep over what could have been.\n\"It didn't matter to me,\" Bryant said of his NBA Finals opponents. \"I just wanted to win the damn thing. I didn't care who we played. For the fans, it probably stinks because it would have been a great matchup, but from a player's perspective it doesn't matter who you play. Just want to win the championship.\"\nAnd that he did, five of them.\nBut Bryant will never catch Michael Jordan's six rings. And, for that matter, he'll never catch LeBron's MVP count, either (James has four, Kobe one). At the end of the day, the 37-year-old's comments shouldn't be seen as disrespectful in any way. Bryant simply never looked up to a younger player who ultimately had to change organizations to win it all.\nAnd there's nothing wrong with that.\nOf course, there's also a chance Bryant isn't being totally honest, and it killed him to watch James unofficially take his spot atop the league's totem pole. But all we can go by is what the man says."},
{"url": "http://www.foxsports.com/nba/story/pistons-without-3-starters-against-denver-021016", "text": "\n AUBURN HILLS, Mich. (AP) Detroit's Reggie Jackson and Ersan Ilyasova are sitting out Wednesday night against Denver, leaving the  without three starters in their final game before the All-Star break.\n The team said before the game that Jackson and Ilyasova had both been ill. The Pistons are also without Kentavious Caldwell-Pope, who has been recovering from a core muscle strain.\n Forward Anthony Tolliver started Wednesday's game in place of Ilyasova, while Brandon Jennings and Stanley Johnson replaced the usual starting backcourt of Jackson and Caldwell-Pope."},
{"url": "http://www.foxsports.com/nba/story/pierce-thankful-in-possibly-his-final-visit-to-garden-021016", "text": "\n BOSTON (AP)  started his career in the shadows of Celtics legends.\n When his career ends - possibly one day soon - his name will surely be among them.\n As  forward prepared to play what may be his final game in Boston's famed Garden on Wednesday night, 15 years of memories and the idea of it maybe being his final visit here hung over ''The Truth'' as well.\n ''Could be,'' Pierce said before the game. ''I'm not 100 percent sure. Like I've been saying the last two years I'm taking it year-by-year. But this could possibly be.''\n Pierce said in each of his previous visits to Boston since leaving in 2013, the feeling when he returns remains the same.\n ''It's always special when I step on the Garden,'' he said. ''This has been the bulk of my career. You spend 15 years here...memories of winning a championship here. It's a special feeling. Special fans. Special building. I always savor the moments when I step on this court.''\n Pierce was given the start by Clippers coach Doc Rivers Wednesday, which resulted in a huge eruption by the Garden fans when his name was announced. Pierce acknowledged them, raising his right hand before his teammates started playfully pounding on him.\n When Pierce started his career in Boston in 1998, fans thought there were getting a steal with limitless upside. Ten years later he not only fulfilled that expectation, but delivered the franchise's 17th championship as part of the Big Three tandem of Kevin Garnett, Ray Allen, himself.\n After playing more than 1,100 games and scoring more than 24,000 points in his Boston tenure, he returned Wednesday for his eighth career game against the Celtics as a 38-year-old and role player on a Los Angeles Clippers team that is in the mix to challenge for another title.\n He's also reunited with Rivers - his former Celtics coach - who credited Pierce with having the most impact on their title run in 2008.\n ''He went through more than any of us,'' Rivers said. ''He went through tough times before I got here. We went through tough times together. Yet he's one of those guys that never asked to leave, he never wanted to bail. He stuck it out and he got rewarded for it.''\n As for his role with the Clippers, Rivers said Pierce has not only embraced the idea of being a role player, but Rivers had leaned on him to help impart wisdom that would normally fall on the coach's shoulders.\n ''He gives us leadership. He gives us truth. Instead of me using my voice, I can use Paul's voice. That's been nice. It's a different team than the one here. This is a young team and a team that's trying to get over the hump. So Paul's been really good.''\n This season not only could be the final one for Pierce, but possibly for Garnett, who is 39.\n ''I don't know what his plans and I don't know what I'm doing,'' Pierce said. ''But this could be the last time, who knows?''\n One thing he hasn't ruled out is coming back to Boston once he's finished playing - whenever that is.\n ''I think all possibilities are open. If that is an opportunity that presents itself I would love to,'' Pierce said. ''Who knows, maybe I'll find a role here someday in the future.''\n ---\n Follow Kyle Hightower on Twitter at http://www.twitter.com/khightower"},
{"url": "http://www.foxsports.com/nba/story/sacramento-kings-shaq-shaquille-oneal-george-karl-insight-shares-021016", "text": "\nShaquille O'Neal is always good to share his opinions on the . His most famous ones came as a player, when he would refer to them as the \",\" but what many forget is that nowadays, Shaq is a minority owner of the team fighting for a playoff spot at the bottom of the Western Conference.\nNow, though, the Kings are struggling and much of the blame has fallen on coach George Karl, whom the Kings have wanted to fire and then not wanted.  \nBut Shaq says he has some inside info:\nThe Kings brought in Karl only a year ago, but the results haven't changed much for the franchise under the presence of the veteran coach. Sacramento is just 32-50 since he arrived in town last year. Meanwhile, the 21-31 Kings are five games back of the No. 8-seed Rockets in the Western Conference standings."},
{"url": "http://www.foxsports.com/nba/story/warriors-stephen-curry-degree-motionsense-lab-science-measures-shot-really-fast-021016", "text": "\nWhen watching  guard  score seemingly at will on the basketball court, what's perhaps the most striking is how little time he needs to gain enough separation from a defender in order to create his shot. \nOpponents can be in his personal space with arms outstretched, but it just doesn't seem to matter. Curry leads the league in true shooting percentage, despite being the focus of the defense on a nightly basis. And the reason for that is because it doesn't seem to take him any time at all to release his shot.\nThanks to , we now have some data to show just how insanely quick Curry's shooting motion is.\n\"That’s probably the most interesting [measurement],” Curry told FOX Sports. “It’s something that I feel is very natural in how I play the game. And being 6-foot-3 in NBA terms is still kind of short, so I still have to use that speed and quickness to get my shot off. \n\"Obviously I’m not out there on the court thinking I’ve got [however many] seconds to get a shot off, it’s just how I play. And to have that analyzed by science is pretty cool, and to see how that actually works. It just gives me more incentive to keep working on it and maybe get a little faster.”\nThe analytics on Curry provided by the Degree MotionSense Lab are obviously specific to him. But he says he's very open to reviewing any advanced data that might be available which could help him with his game, and the Warriors are among the organizations that are doing their best in this regard to help their players out. \n“We get a lot more [data] than we used to,” Curry told FOX Sports. “We wear wearable technology during practice and it tells you how far you run, the different load you put on your body through practice and things like that. And then with the in-game analytics that they have -- actually my favorite one is . If I move from one side of the court, do three guys move with me? Do I draw that much attention? I understand a lot more than I probably did last year or two years ago, and I’m sure it’ll continue because it’s valuable information to know.\n\"You don’t want to be overloaded by it, but if you’re really trying to understand the game and how to get better, and learn different ways you can get a leg up on the competition? I’m all open ears to it.”"},
{"url": "http://www.foxsports.com/florida/story/miami-heat-hassan-whiteside-future-undecided-021016", "text": "\n --  leads the NBA in blocked shots, ranks fifth league-wide in rebounds per game and has all three of  triple-doubles this season.\nThat's a most impressive resume, all sure to help his cause this summer when he's in line for his first enormous contract.\nEven so, his future in Miami is hardly guaranteed.\nThe enigmatic center has raised eyebrows around the team with some of his social-media posts, argued with the  stat crew during a game over his rebound total and usually isn't on the court in the final minutes of close matchups. And his most recent issue was Tuesday with him ejected for throwing an elbow in the fourth quarter against San Antonio.\n\"Sometimes,\" Heat guard Dwyane Wade said, \"we don't know what he's thinking.\"\nWhatever Whiteside was thinking on Tuesday when he threw the elbow to the head of San Antonio's Boban Marjanovic isn't known. Whiteside was sent home by team officials before reporters arrived in the locker room, and the Heat won't practice again until Feb. 17. That's one day before the NBA's trade deadline, and the Heat will have to decide whether to trade him now and try to get something back or risk losing him this summer for nothing.\nGetting kicked out a game again -- Tuesday's was his third ejection in 93 games with the Heat -- doesn't help his cause.\n\"That's something that we'll deal with,\" said Heat coach Erik Spoelstra, who wasn't hiding his displeasure.\nWade and took great pains during his postgame comments to hammer home the point that his teammates are still there for Whiteside and want to help him. They also want to be able to count on him, and that isn't always the case.\n\"You can always help a guy or try to give a guy advice,\" said Heat forward Chris Bosh, whose locker is next to Whiteside's and that means he's in his ear more than most. \"People have given me advice over my career. I think the next step for him is really learning about reputation. Unfortunately, he's taken a step back.\"\nWhiteside was picked up off the NBA's scrap heap by the Heat last season, and things eventually clicked like Miami had gotten a steal. No NBA player blocked more shots in regular-season games in 2015, and he had as many triple-doubles in those 12 months as LeBron James -- only five players had more. A guy who had to play in Lebanon and China when no one in the NBA wanted him seemed like he finally arrived.\nAnd he's had some games this season that were statistically impressive. He's gotten double-figure rebounds in 29 of his 45 games, at least five blocks in 16 games, shot 70 percent or better in 15 games.\nBut Miami has had 23 games this season in which there's been a margin of four points or less in the last two minutes. Whiteside has played in only eight of those games, according to STATS.\n\"Coach is going to make the decisions he's going to make,\" Whiteside said earlier this week. \"I can't control that. He's the coach.\"\nWhiteside's talent isn't questioned. But things like complaining about calls, lobbying for a better video-game rating, a penchant for in-game pouting and of late boasting that he was driving a car that could exceed 200 mph -- though he never suggested he was driving that fast and only pointed to the speedometer display during one of his Snapchat videos -- are all things the Heat are surely noticing.\nSome team will probably give Whiteside a big contract this summer. It just might not be Miami, and if he makes it past the trade deadline the final 29 games of the Heat season could be his final chance to impress.\n\"He knows what he means to the team,\" Bosh said. \"He knows that he has to keep his head in every situation. ... He wants to win. We just have to encourage him and keep telling him what it takes to win.\""},
{"url": "http://www.foxsports.com/nba/story/kobe-bryant-lebron-james-los-angeles-lakers-cleveland-cavaliers-kobe-retirement-021016", "text": "\nAs the  retirement tour made its final stop in Cleveland, many didn't know what to expect from ' home crowd.\nBefore tipoff of Wednesday's Cavaliers-Lakers matchup, even if only for a short moment, Quicken Loans Arena wasn't The King's Court.\nIn his final appearance against the Cavaliers in Cleveland, Bryant was honored by the team and the fans during pregame introductions.\nThe crowd erupted as the Black Mamba was introduced by the ' emcee, with a standing ovation to follow:\nThe 37-year-old Bryant will face James and Co. one final time before season's end, on March 10 at the Staples Center in Los Angeles.\nBryant announced in November that he would retire following the 2015-2016 season."}]